[
  {
    "Job ID": "4267438193",
    "Titlu Job": "Project Manager\nProject Manager",
    "Companie": "CONLAN Grup",
    "Locatie": "Sibiu, Sibiu, Romania · 4 weeks ago · 65 applicants\nPromoted by hirer · No response insights available yet",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4267438193/?eBP=CwEAAAGYso0H5u4ZpELxPxj1kDb6q3HK6eQztPRfkJho-Pi7_tdd76QveDY6K6Ag8LOVCpoxQuKVqYf7ELJ4IlWIK1eCpV6Vtj-oeNHqvekGQJM4BAW4WdU8GCDCgj92eehqpJv49150LYdluSlRK0E0hCSG7aE2xyauEVckxBYgEagyY3YyrGyKSevaFB1Rl20o7Foe0ZiBdLUtXKFGoxDkubBY34y63WXJU4uZfIU87RtBdJwETadigyQ7B18vaotUo71xLYd5-MkLACvvW3J_7QgdVMinIEgEL3JfQXRsKtpXtsbp8_fYwxP84_wpuLpqMFTM-BHremgWm4kdwb0RubuNNLzdnfefoLzZ7W-RYXrhyA1ctX53sH6nzvITJOyr9pWnG660RF-0ixzNrgCAdpf2WJvL9csnAHDrUv4OgBJqtK2UTTW7X1_DsEtxVjYo8q3b0K83RHqCF_D-mDW3RfNEPjQztmwii4ncgDZfpS3jZ31c94UtLoxBvQXKVAhq2Ydpvnkzm6yhPReBBaNXLJJnqjOO&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=M8M0xTktvxApCNDUPtRNVA%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\n#ConlanTeam\n#NextLevel\n#ConlanGrup"
  },
  {
    "Job ID": "4269323511",
    "Titlu Job": "Artificial Intelligence Engineer\nArtificial Intelligence Engineer",
    "Companie": "STREAMWIDE Romania",
    "Locatie": "Bucharest Metropolitan Area · 4 weeks ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4269323511/?eBP=CwEAAAGYso0H5tczamMFFOVZB4ZuC0ntGAjCNRdHN2BmFk5zjz09YaYkDnokqJ91Iy2mscmZd_1BN1AOKEyXbHlb3JT0az4ww8DtaR4y43GV25F3VP4cN-y7sgHjv-a0wVIN6FKl5vmivNHqJimhpu3xXUn0FlFAbOrPANmC83wXqgWuGH3WfNYFnMZc1kyl_GQotWVKYLDUBGl_QgGdPTsZa1huY-_cGJXxTVya5anxUMKFae5JBRbCF192-FkwkIyfT_B1Fkzgk23Ykx9_EaRzIoaaMyaM7vL1CsriR60PxX4gF3LCSkaFV5sgMbbNNSVAnmqFwk38kPPamurPLQUG3m874hVnOXiBGMcn5vr_KteN7dBku2OFNF2YL-Ieka3KRx6sMESTvoRv8oq7iE5H-s5zZw2hOqJCb3Uu2jWepUTW26I1hh4Loov1KShqb42H5ABQqioyqWTzSoH7IIsExJZxN4ccxYRsTyxAAdV5ZCsDPKBBcBXB2hfT9BJOTm8LgrN1Mk7DBMM&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=WaoVy%2FwyOMkq5THLwMZdxw%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nWho we are?\n\nSTREAMWIDE is a leading communications software technology provider delivering mission critical communication, enterprise communication and digital services solutions.\nHeadquartered in Paris, with 6 subsidiaries globally (USA, Singapore, China, France, Tunisia, Romania), the company has been providing communications software solutions to customers worldwide for more than 15 years. Specialized in carrier grade value-added services and critical communications, we serve the public safety sector, operators, and enterprises in over 70 countries with our own patent-protected software technology portfolio.\nThe two main platforms the company operates are Team on Mission and Team on the Run. Team on Mission is our mission critical communication solution for public safety and infrastructure available on premises. Team on the Run is the enterprise solution available on SaaS.\n\nWho you are:\n\nYou are currently a master's student in computer science or artificial intelligence at university or engineering school and are looking for a part time collaboration\nYou have knowledge of JavaScript, HTML, and CSS\nYou have knowledge of AI concepts and methodologies\nYou have knowledge of testing and debugging techniques\nYou have good interpersonal skills and ability to communicate\nAble to work independently and collaboratively\nYou have a good level of written and spoken English\n\n\nWhat you will do:\n\nWithin the artificial intelligence team in Bucharest, in our main R&D subsidiary, you will design, develop, and test user interfaces for AI applications using modern web development technologies., You're main tasks will be to:\n\nConduct user studies to gather requirements and ensure usability\nImplement AI models within the interface using APIs\nIntegrate AI interfaces with other systems and platforms\nPerform thorough testing and debugging to ensure functionality and performance\nTrain the current AI model to learn and perform better\nDocument design decisions and user feedback\n\nThis project is a determined one for 6 months, but it can be prolonged if the business needs requires. After you can have the possibility to apply for another role if there is a vacancy in our company and the role suit your skills.\n\nWhat we offer:\n\nInternational work environment in a company going through an exciting growth phase\nFriendly team\nAttractive compensation package\nPartial work from home\nMedical subscription for employee and family members\nBookster subscription"
  },
  {
    "Job ID": "4281572340",
    "Titlu Job": "Data Privacy Intern\nData Privacy Intern with verification",
    "Companie": "SLB",
    "Locatie": "Bucharest, Romania · 1 week ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4281572340/?eBP=CwEAAAGYso0H5mRtXTtF42hSFyPSZdqn4bcy3vQqKyQbRk9fD1jSxZleWZfHxTZAbQ654W6k7gVsOjWJWamJXvo0bjq3--og_cJy03HXx7er7yj-v4VbLW1iaih0zevvJsSKCKGvigENnxajnzVuXZ9am75v2jKrtV23AaFpmIDnoPLU6pRIwTV9zpAng5C45lLm8DpqcZAl84-0diK0V7_TH3MaR1xJ0OL0elOzVBF3A1L6eYRLxNMgdvyqDmxtgH-gcKrNHnOur_QupDruTltY2f0cJf1bVOVcDjqE5O0yzLts8KnhCnnTu_604yRpP7jxLPlPDfhnMKIC6bNvj8Fp6_nQSJFA8R4YaIceyCdxBe7o9qhHjKV7I-_QNGwYwnCqq8OrgXoE4OkKvIMnY2b72IZCjbnX4WFkT9xmQpkHHVXQxdJf2ME2SgsN_m8LUh_hvl0tkGnRpZrAKTBDo8CuuX-Mg460Nwy0Rt2YVGikUl2sxXpqARKM6cENoaLBExIOA5-wZq_FuqI&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=JGFUH3fmoJZs5g28W0v5Tw%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nJob Title:\nData Privacy Intern\n\nAbout Us:\nWe are a global technology company, driving energy innovation for a balanced planet. At SLB we create amazing technology that unlocks access to energy for the benefit of all. We are facing the world’s greatest balancing act- how to simultaneously reduce emissions and meet the world’s growing energy demands. Our collective future depends on decarbonizing the fossil fuel industry, while innovating a new energy landscape. It’s what drives us. Ensuring progress for people and the planet, on the journey to net zero and beyond. \n More than 98,000 employees over 120 countries already started their SLB journeys. Start yours now! \n If you would like to know more, please visit our website at https://www.slb.com/ \n\nLocation:\nBucharest, Romania\n\nJob Summary: \nWe are seeking two highly motivated and detail-oriented interns to join our Global Data Privacy department. The selected candidates will support the team in managing key privacy tools, developing and maintaining documentation, and driving awareness through communications and training. This internship offers hands-on experience in global privacy governance and risk management practices across a dynamic, cross-functional environment.\n\nResponsibilities and Duties:\nTool & Data Management\nSupport the management of the TrustArc DP&P risk assessment tool.\nMaintain and update the DPQP assessment data library to ensure consistency.\nIdentify and flag business processes requiring reassessment due to high-risk indicators.\nAssist in developing the Audit Portfolio based on risk classification.\nEnsure alignment and data consistency between TrustArc and other risk assessment tools (e.g., CSQP, SAQP).\nHelp leverage TrustArc's capabilities to enhance risk mapping by business processes.\nContribute to expanding and improving the use of the TrustArc platform.\nSupport the management of the Data Breach Reporting tool, ensuring alignment with Cybersecurity Reporting procedures.\n\nGovernance Documentation\nHelp manage and maintain the Data Privacy & Protection (DP&P) Policies & Standards Library.\nAssist in developing a structured document repository aligned with program requirements.\nEnsure documentation is consistent with Ethics & Compliance (E&C) and HR Compliance standards.\nSupport the implementation of a formal document, review and update process.\n\nCommunication & Training\nMaintain and update the DP&P HUB page and related training materials.\nAssist in the development and execution of the DP&P Annual Communication & Training Plan, ensuring alignment with the E&C Compliance Plan.\nSupport the development of global data privacy legislation and regulatory library, including consolidation of legal alerts and tracking updates.\n\nEssential Requirements:\nCurrent undergraduate or graduate student pursuing a degree in Law, Information Security, Public Policy, Business, or related field.\nStrong interest in global data privacy, compliance, or cybersecurity.\nExcellent analytical and organizational skills.\nProficiency in MS Office tools; experience with data platforms or assessment tools (e.g., TrustArc, ServiceNow) is a plus.\nStrong written and verbal communication skills.\nSelf-starter with the ability to work independently and collaboratively in a global team.\n\nWhat You’ll Gain\nExposure to global data privacy operations and tools.\nExperience working in a cross-functional compliance and risk environment.\nOpportunity to contribute to real-time projects that impact global governance and data protection strategies.\nMentorship and professional development in privacy, compliance, and governance practices.\n\nIf this role is of interest to you and you are eager to learn more then we strongly encourage you to apply. We can then discuss how you will help shape and grow SLB moving forward. \n\nBlueFlex Scheme:\nWe offer hybrid working with a combination of on-site & home working days to achieve the right work-life balance and allotted time for participating in volunteering and sustainability efforts. \n\nCertifications and Awards:\nThe Disability Equality Index awarded us the title of “Best Place to Work for Disability Inclusion” in 2023.\nRanked among LinkedIn’s “Top Companies in the UK for Career Development” in 2024.\nProud member of Business Disability Inn and Valuable 500 initiative.\nProudly ranked 4.3 out of 5 on Glassdoor for Equality, Diversity, and Inclusion.\nProudly ranked 4.1 out of 5 on Glassdoor for overall employee benefits.\nProudly ranked 4.2 out of 5 overall on Indeed.\n\nSLB is an equal opportunity employer. Qualified applicants are considered without regard to race, colour, religion, sex, sexual orientation, gender identity, national origin, age, disability, status as a protected veteran or other characteristics protected by law.\n\n#SLB #BalancedPlanet #Decarbonisation #NetZero #JoinUsNow"
  },
  {
    "Job ID": "4273849078",
    "Titlu Job": "AI Engineer\nAI Engineer with verification",
    "Companie": "Patrianna",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 1 week ago · 41 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4273849078/?eBP=CwEAAAGYso0H5gPV-QEokbepCkxoHsYFB8ysALMauLEDGpEaX8uwB04LCfCOZPyTQmUIP6fb8V3xYKTStIbvLNm3Rp3xnDh-pLnhJGHg6BDM1RvMtjLl9CP09obfVnFWRROS4T58bxXeSlN_TmH6luBAvNmsencv7JyZlZ99ODY5Q_gj6WsnsramMCa2xw0wM2-LC2diS27r-M45cPlaCHt1V8t3exyI_w3H_VIE1Sswcai1sNyg_smC_wkl02-ImRoioySl1quhDwyoqYlqSBSwxMZyyu2QvUtZTFbQpGAdk8dgRNRcQ5A89ONToggN29KC8GBJdgfrkX5ufOeymgK2QAh7ltkHF51Z96B8Sq34ugMP1e6hUUe0MRVShuXEwdFR1obBjr7aCFMuCFTo7P0ZxjQCf-Xf9pTBNCRChjmV-45T96n15tucJpSRWh9UpAFBI_ci5bTJNfYd4dx5twQ2KqVU0ocBRSe8dVZE2rT1R3Kt7Rm3DmAbwGddnhsrUHvFUz621oIn&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=shzsGTMCDZueciuoHBUwmg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nPatrianna is a rapidly expanding product development company headquartered in Gibraltar, with a dynamic team spanning the globe. We are on the lookout for exceptional talent—driven, ambitious individuals who are ready to elevate business functions with expertise, adaptability, and a passion for continuous growth.\n\nWe’re looking for an AI Engineer to lead the development of an intelligent, self-evolving data ecosystem powered by large language models (LLMs). You’ll be at the forefront of innovation, blending data engineering, real-time intelligence, and AI productization to deliver cutting-edge solutions across the business.\n\nKey Responsibilities\n\n LLM-Oriented AI & Automation Systems\n\n Build, fine-tune, and integrate LLM pipelines using platforms such as Vertex AI, OpenAI, Google Studio for data transformation, summarization, and retrieval-based tasks.\n Develop prompt-driven automation systems for workflows including metadata extraction, tagging, reporting, and anomaly detection.\n Design and deploy RAG (Retrieval-Augmented Generation) and embedding-based search solutions integrated with enterprise knowledge bases.\n\n Agent Orchestration & Autonomy\n\n Build intelligent agents using CrewAI, LangChain or similar frameworks to support use cases like automated report generation, root cause analysis, and interactive user agents.\n Implement feedback and memory mechanisms to support context-aware, evolving agents.\n\n AI-Native API & Platform Integrations\n\n Develop, manage, and scale API integrations that connect AI workflows with data warehouses, business tools, and external data sources.\n Create intelligent endpoints for model inference, decision logging, and webhook/postback triggers to support real-time interactions and data enrichment.\n\n Data Modeling for AI Workflows\n\n Architect and maintain data models optimized for AI usage—structured for quick access by LLMs, retrieval engines, and embedded reasoning tools.\n Integrate semantic layers and metadata mapping to facilitate natural language querying and low-code data exploration.\n\n Documentation, Scaling & Knowledge Ops\n\n Document all AI workflows—from prompt structures and agent behaviors to API interfaces and data flows—for reproducibility and team-wide collaboration.\n Build internal knowledge bases, vector stores, and wiki systems fueled by LLM summarization and indexing.\n Advocate for internal AI adoption through tooling, workshops, and scalable use case frameworks.Preferred Qualifications\n\n Must-Have\n\n Bachelor’s degree in Computer Science, Data Science, AI/ML, or related field.\n Strong experience with GCP ( Vertex AI, Google Studio and other GCP tools).\n Demonstrated success integrating LLM APIs (OpenAI, Vertex AI, Perplexity, Gemini) into production systems.\n Expertise with LangChain, CrewAI, OpenAI platform or similar frameworks.\n Expertise in building and deploying JS/n8n/Python-based AI workflows, agents, and APIs.\n Solid SQL knowledge for structured data operations and AI-data interplay.\n\n Nice to Have\n\n Google Cloud certifications in Data or Machine Learning.\n Experience with vector databases, embedding generation, and RAG infrastructure.\n Exposure to autonomous agent memory systems, reward tuning, or action planning loops.\n Familiarity with Data Engineering process and tools."
  },
  {
    "Job ID": "4263377044",
    "Titlu Job": "Data Scientist\nData Scientist with verification",
    "Companie": "LSEG",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 2 weeks ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4263377044/?eBP=CwEAAAGYso0H5lybcqpCx-DoNC66cCXTLa4LHOCXTHaDI6k5BzSjk6EBpYMCc4jUQEJYgvqOCtEoYMWAZ3CH64fabWGNBtJZQWT4Q022JJNgB7q7Fb5SRwBUZvnLuTwxnztGX6LJZh4QpMK3u8JxwIRtWVJQQfcRVlfJtfvgR_hePGYH2BgWhL_WCdhHZroORog9vX16Mjn3_YRvPhMqNy-bRGrOD8A7Pb3UXjlbsaafMlX8dMU0F9MtjVc568oujOS_Y3upExoddSkrdZXD4PPFNYB3Sk7D4JRvJXIiOpQw9YZ1gI-83bg5fnWwcBKlwvBmBYfeG9Ax2gJhpSkcdsmdrjfGx_B7SdNHtghaF5vq_ha26HTQauMPTKWt_M8CXWMI5_JR1tVSWVTGJho4sScBuWpH8QceXAn3pBYh6ReTUVWfNafi-__ROXvXslsuIueMBYr2WPstRjv7HrkIUsYRpFiVkTgZgA7Km4ZjdR77ruLSVxTq_IzycYfT-puVdjgZVDqK4xsZPcC26A&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=yL16cPXJguwHzNkTAlH9rg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nAbout Us:\n\nLSEG (London Stock Exchange Group) is more than a diversified global financial markets infrastructure and data business. We are dedicated, open-access partners with a dedication to excellence in delivering the services our customers expect from us. With extensive experience, deep knowledge and worldwide presence across financial markets, we enable businesses and economies around the world to fund innovation, manage risk and create jobs. It’s how we’ve contributed to supporting the financial stability and growth of communities and economies globally for more than 300 years. Through a comprehensive suite of trusted financial market infrastructure services – and our open-access model – we provide the flexibility, stability and trust that enable our customers to pursue their ambitions with confidence and clarity.\n\nLSEG is headquartered in the United Kingdom, with significant operations in 70 countries across EMEA, North America, Latin America and Asia Pacific. We employ 25,000 people globally, more than half located in Asia Pacific.\n\nProud to share LSEG in Romania is Great Place to Work certified (Sept ’24 – Sept ’25). Learn more about life and purpose of our company directly from the Romanian colleagues’ video: Bucharest, Romania | Where We Work | LSEG\n\nKey Responsibilities:\n\nWork in a multidisciplinary team to develop data science and AI products and solutions for clients. \nSupport the existing suite of data science and AI models.\nConduct innovative research and construct the next generation of financial models. \nTake responsibility for the Model Development Lifecycle, including coordination with key contributors from other functions. \nContribute to outreach geared toward client satisfaction, converting prospects to customers, and expanding the brand footprint. \nCoordinate and collaborate with various partners within the broader researcher team as well as across the organization.\n\nCandidate Profile / Key Skills:\n\n1-3 years' experience in model building/data science;\nEquity market expertise is preferred. However, a strong willingness to learn will be considered;\nExposure to data science, AI, machine learning, NLP, LLM is required;\nProficiency in Python;\nCloud experience (Azure, AWS or GCP) is desired;\nClient interaction experience is a plus;\nSelf-reliant, resourceful, innovative and eager to learn;\nAdvanced degree in Computer Science, Data Science, AI, Mathematics, Engineering or Physics is preferred.\n\nBenefits:\n\nWe are looking for intellectually curious people, passionate about the bigger picture of how technology industry is evolving, ready to ask difficult questions and deal with complicated scenarios! If you are creative and a problem solver, this is the place to be as will be supporting you to fast-forward your career!\n\nWe maximise each employee’s potential through personal development through a wide range of learning tools both formal and informal. We believe in remunerating our people with competitive salaries and a range of attractive benefits such as:\n\n25 days’ holiday per year\n1 additional day off for your Birthday\nAnnual wellness allowance\nShare Purchase Plan\nMedical Health Insurance\nMedical Subscription (preventive medical services)\nDental Coverage\nLife insurance\nPillar 3 Private Pension\nMeal Vouchers\nFlexible Benefits\nBookster\nVolunteering Events\nAll LSEG colleagues with at least one year’s continuous service, who become parents, are now entitled to at least 26 weeks’ paid leave, and the option to return to work on a phased basis, in relation with specific company’s policy and guidelines\n\nLSEG is a leading global financial markets infrastructure and data provider. Our purpose is driving financial stability, empowering economies and enabling customers to create sustainable growth.\n\nOur purpose is the foundation on which our culture is built. Our values of Integrity, Partnership, Excellence and Change underpin our purpose and set the standard for everything we do, every day. They go to the heart of who we are and guide our decision making and everyday actions.\n\nWorking with us means that you will be part of a dynamic organisation of 25,000 people across 65 countries. However, we will value your individuality and enable you to bring your true self to work so you can help enrich our diverse workforce. You will be part of a collaborative and creative culture where we encourage new ideas and are committed to sustainability across our global business. You will experience the critical role we have in helping to re-engineer the financial ecosystem to support and drive sustainable economic growth. Together, we are aiming to achieve this growth by accelerating the just transition to net zero, enabling growth of the green economy and creating inclusive economic opportunity.\n\nLSEG offers a range of tailored benefits and support, including healthcare, retirement planning, paid volunteering days and wellbeing initiatives.\n\nWe are proud to be an equal opportunities employer. This means that we do not discriminate on the basis of anyone’s race, religion, colour, national origin, gender, sexual orientation, gender identity, gender expression, age, marital status, veteran status, pregnancy or disability, or any other basis protected under applicable law. Conforming with applicable law, we can reasonably accommodate applicants' and employees' religious practices and beliefs, as well as mental health or physical disability needs.\n\nPlease take a moment to read this privacy notice carefully, as it describes what personal information London Stock Exchange Group (LSEG) (we) may hold about you, what it’s used for, and how it’s obtained, your rights and how to contact us as a data subject.\n\nIf you are submitting as a Recruitment Agency Partner, it is essential and your responsibility to ensure that candidates applying to LSEG are aware of this privacy notice."
  },
  {
    "Job ID": "4252583876",
    "Titlu Job": "Optimization Engineer\nOptimization Engineer with verification",
    "Companie": "Legion Technologies",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 1 week ago · 79 applicants\nPromoted by hirer · Actively reviewing applicants",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4252583876/?eBP=CwEAAAGYso0H5rAfcdbIYsxBMHuHjhngheNOTX1JKk-oQZJFBG3OwgH8oxtYIoB3sOeScuFnI-dhCbuFCY9Zws4WaY2aYf3vND7wvsP1TmIEZP9Be5iNZN2ZSgja2c5r2Z4zQrt8wQfm5xWyRIIqj4z0miXbVBV9LSdN-Eq4nDu1gT33wab62VflBs9SskDJve-oYIvuJOLTV70wQ-ktDSPJqdIumZ2ErjqLEm0swkhuHKm-HRrS0HKKVpZObkQnab-WqnaI09xq51-DguJOF_55d2BOo3WOC3lyyYUIlXW6pYbnqH3mVv0qNPyQURXOyqVz5F1fjN4WHzXY8mkelDPGkbgH0UBDw0VBjWzBVg65jaiFdGQBmwWWxojYEbbQiPMCT4rpB6Q0ik271rn-i8_I7txMQfi6u4qzhlY14DWvj4xsJipLQ_zYBXD49o_K8dAj3snMfy_6DS4ehlF-yxkWEQ8QWqiHxGGQbBalLm-V6YX4Sm2bACvBodAfxf2zn59iJt4sdDPtJQw&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=s0iNgYHlP0CBFyL7Bx%2B3MA%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nOPTIMIZATION ENGINEER\n\nHybrid, Bucharest, Romania \n\nJOB OVERVIEW\n\nThe Legion application is a high performance data driven Java enterprise application that implements sophisticated scheduling and optimization algorithms. It also provides the necessary endpoints for our Web and mobile frontend applications.\n\nRESPONSIBILITIES AND DUTIES\n\nAs an Optimization Engineer, you will be a member of the team responsible for the implementation and evolution of the Legion scheduling application.\n\nREQUIRED SKILLS AND QUALIFICATIONS\n\nSolid understanding of mathematical optimization concepts like linear programming, mixed integer programming, etc. \nYou also will need to be able to write secure, efficient, enterprise quality Java code\nHave a deep understanding of the techniques and technologies that are necessary for scalability and performance. \nWe use Springboot, Hibernate, MySQL, so familiarity with these technologies will be helpful. \nBachelor's or Master's Degree in Mathematics, Operations Research or similar field\nPlease note that this role involves participation in an on-call rotation.\n\nPREFERRED QUALIFICATIONS AND SKILLS\n\n1-5 years of experience working with optimization problems particularly scheduling optimization\nAbility to operate in an environment with limited resources\nA great communicator who can distill powerful messages which resonate with customers \nTrack record of building positive relationships with peers \n\nABOUT LEGION\n\nJoin Legion's mission to turn hourly jobs into good jobs. We're a mission-driven team seeking exceptional talent to propel this vision. Embrace a culture that's collaborative, fast-paced, and entrepreneurial. With us, you'll grow your skills, work closely with experienced executives, and contribute significantly to our mission. Our award-winning AI-native workforce management platform is intelligent, automated, and employee-centric and proven to deliver 13x ROI. We help labor-intensive organizations maximize labor efficiency and employee engagement simultaneously. Legion has earned recognition for its innovation, including spots on the Inc. 5000 list, Forbes' Next Billion Dollar Startups, and awards for our AI technology. Backed by leading investors such as Norwest Venture Partners, Stripes, First Round Capital, XYZ Ventures, Webb Investment Network, Workday Ventures, and NTT DOCOMO Ventures, we're making real change.\n\nIf you're ready to make an impact and grow your career, Legion is where you belong. Join us in making hourly work rewarding and fulfilling.\n\nBACKGROUND AND OPPORTUNITY\n\nThere are almost 75 million hourly workers in the United States, representing more than half of the entire workforce. Historically, managing hourly employees has been difficult due to high attrition (average of 60%) and high replacement costs (average of $3,200 per employee in retail). The ongoing labor shortage and competition from the gig economy, make it more difficult to attract and retain hourly employees. The top reasons hourly employees leave their jobs are a lack of schedule empowerment, poor communication with employers, and an inability to get paid early. Gen Z and the millennial workforce demand gig-like flexibility, modern technology, and compelling work options. Legion's mission is to turn hourly jobs into good jobs, serving the hourly workers who make up the majority of the US workforce. We believe in empowering employees and helping employers be efficient and innovative by enabling intelligent automation powered by Legion's Workforce Management platform to optimize labor efficiency and enhance the employee experience simultaneously.\n\nLegion WFM was built for the cloud with AI at the core and is designed to handle the complexity of modern businesses and meet the needs of today's hourly employees. Our team is composed of dedicated individuals from all backgrounds and experiences, globally distributed across all time zones.\n\nFor more information, visit https://legion.co\n\nCOMPENSATION & BENEFITS\n\nAt Legion, we offer competitive compensation and benefits packages to all employees. As a hybrid employer in Bucharest, Romania, pay for positions is determined using local, national, and industry-specific survey data.\n\nWe strive to make competitive offers allowing employees room for future growth. Salaries will be based on the applicant's location, level of experience, education, and specialized knowledge and skills. Additionally, we consider the external market rate, the amount we have budgeted internally, and internal equity within the company for the same position.\n\nBenefits include, but are not limited to:\n\nHealth Benefits\nPaid Time Off and Paid Holidays\nEquity\nMonthly Wellness Reimbursement\nMeal Vouchers\n\nEQUAL EMPLOYMENT OPPORTUNITY\n\nLegion Technologies is proud to be an equal opportunity employer and is committed to maintaining a diverse and inclusive work environment. All qualified applicants will be considered for employment without regard to race, color, religion, sex, age, disability, marital status, familial status, sexual orientation, pregnancy, genetic information, gender identity, gender expression, national origin, ancestry, citizenship status, veteran status, and any other legally protected status under federal, state, or local anti-discrimination laws.\n\nDISABILITY ACCOMMODATION\n\nFor individuals with disabilities who need additional assistance at any point in the application and interview process, please email recruiting@legion.co\n\nLegion is an equal opportunity employer. All applicants will be considered for employment without attention to race, religion, color, sex, sexual orientation, gender identity, age, national origin, veteran, disability status, or any other basis covered by appropriate law.\n\nHow We Determine What We Pay\n\nAs a fully remote employer, Legion determines pay for positions using local, national, and industry-specific survey data. We evaluate external equity and the cost of labor/prevailing wage index in the relative marketplace for jobs directly comparable to jobs within our company. Our posted salary range is based on national data and may be refined for a candidate's region/town/cost of living. For new hires, we strive to make competitive offers allowing the new employee room for future growth. Salaries will be based on the applicant's location, level of experience, education, and specialized knowledge and skills. Additionally, we consider the external market rate, the amount we have budgeted internally, and internal equity within the company for the same position. An employee/candidate with a stronger skill set will receive higher pay.\n\nJob Applicant Privacy Policy\n\nThis Job Applicant Privacy Policy (\"Policy\") describes how Legion Technologies, Inc. (\"Legion\", \"we\", \"us\" and \"our\") collects, uses, and discloses \"personal information\" as defined under California law from and about job applicants who are residents of California.\n\nThis Policy does not apply to our handling of data gathered about you in your role as a user of our consumer-facing services. When you interact with us as in that role, the Legion Privacy Policy applies.\n\nTypes of Personal Information We Handle\n\nWe collect, store, and use various types of personal information through the application and recruitment process. We collect such information either directly from you or (where applicable) from another person or entity, such as an employment agency or consultancy, background check provider, or other referral sources. This information includes: \n\nIdentification and contact information, and related identifiers such as full name, date and place of birth, citizenship and permanent residence, home and business addresses, telephone numbers, email addresses, and such information about your beneficiaries or emergency contacts.\nProfessional or employment-related information, including:\nRecruitment, employment, or engagement information such as application forms and information included in a resume, cover letter, or otherwise provided through any application or engagement process; and copies of identification documents, such as driver's licenses, passports, and visas; and background screening results and references.\nCareer information such as job titles; work history; work dates and work locations; information about skills, qualifications, experience, publications, speaking engagements, and preferences; and professional memberships\nEducation Information such as institutions attended, degrees, certifications, training courses, publications, and transcript information.\nLegally protected classification information such as race, sex/gender, religious/ philosophical beliefs, gender identity/expression, sexual orientation, marital status, military service, nationality, ethnicity, request for family care leave, political opinions, and criminal history.\nOther information such as any information you voluntarily choose to provide in connection with your job application.\nHow We Use Personal Information\n\nWe collect, use, share, and store personal information from job applicants for our and our service providers' business and operational purposes in the recruitment process such as: processing your application, tracking your application through the recruitment process, contacting references with your authorization, conducting background checks you authorize, and making hiring decisions. We will also use job applicant information for internal analysis purposes to understand the applicants who apply and to improve our recruitment process. We may sometimes need to use applicant information for legal purposes, such as in connection with any challenges made to our hiring decisions.\n\nWith Whom We Share Personal Information\n\nWe will disclose job applicant personal information to the following types of entities or in the following circumstances (where applicable):\n\nInternally: to other Legion personnel involved in the recruiting and hiring process.\nVendors: such as technology service providers, travel management providers, human resources suppliers, background check companies, and employment agencies or recruiters, where applicable.\nLegal Compliance: when required to do so by law, regulation, or court order or in response to a request for assistance by the police or other law enforcement agency.\nLitigation Purposes: to seek legal advice from our external lawyers or in connection with litigation with a third party.\nBusiness Transaction Purposes: in connection with the sale, purchase, or merger.\nHow to Contact Us About this Policy – If you have any questions about this Policy, please contact privacy@legion.co."
  },
  {
    "Job ID": "4282257651",
    "Titlu Job": "Data Engineer Internship\nData Engineer Internship with verification",
    "Companie": "IBM",
    "Locatie": "Bucharest, Bucharest, Romania · 2 days ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4282257651/?eBP=CwEAAAGYso0H5p79zMQXkI1zV4APXWi77LoOCWuu2Zj2Dm7PqO2wa2XJ2N18KorOO148cjOR5vSOcdhnBWrY5EUegtEbd5K5na8RMgl2R5gxdbdjeBn33-yIU2ij_j6TswGhNoUbzwpxHHIzrudg1eF1DaqdTz9YD__y_I8aq_D8ViHDrPRZ7gmmMmKUdlvo_c9w2S1sHglW1Tovc12r7ey3HFDVwkFr8jvCf3vJN4xPIHCB6hIBNlg6tj-IxfrPuq-FvB5Xc6lm-RCdB-ShsKvx44oRnbO3ycSrpLvUBtUo5bvA3UfY3VRdJSPOUr7tIk3X0sRAYEs5FsAarSNnQuj_k7O2hD0qT5VdYNhkHLj8wIwZbItzV4V3UytA2t2-YAwAOK1-zjbEH1jy6uXRU8qY3dArmdkTzMHP4FTIzpawUNbnqoM4vzZiOf_aLz3DpIgxH8y0Q2LQmYrW8401HDis-HW_cKUaCY1IgJ4hT8JjfUiRbNCHYJCh8ksS1JPDgOWpFbLP-DbhEboygOu7&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=u2B8cjEFuN7Hu9DpUNr8GQ%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nIntroduction\n\nIBM is a leading technology company that innovates and transforms industries and societies. We're committed to making the world a better place through the application of technology and expertise.\n\nWe're seeking highly motivated and talented Data Scientists to join our team as interns. As a Data Scientist Intern at IBM, you'll work on real-world projects that drive business outcomes and contribute to the development of AI, machine learning, and data analytics solutions. You'll have the opportunity to work with a diverse team of experts and develop skills in data science, analysis, and interpretation\n\nYour Role And Responsibilities\n\nData Science Projects\n\n Collaborate with cross-functional teams to design, develop, and deploy data-driven solutions\n Work on data analysis, machine learning, and AI projects to drive business outcomes\n Develop and deploy models using various machine learning algorithms and techniques\n Interpret results, provide insights, and communicate findings to stakeholders\n\nData Analysis and Visualization\n\n Collect, process, and analyze large datasets\n Develop data visualizations to communicate insights and findings\n Use statistical and data analysis techniques to identify trends and patterns\n\nCollaboration and Communication\n\n Work closely with data engineers, software developers, and product managers to integrate data science solutions\n Communicate complex technical concepts to non-technical stakeholders\n Collaborate with team members to share knowledge, best practices, and ideas.\n\nPreferred Education\n\nBachelor's Degree\n\nRequired Technical And Professional Expertise\n\nCurrently pursuing or recently completed a degree in Computer Science or a related field.\nSolid understanding of SQL and Python—strong analytical and algorithmic thinking is highly valued.\nFamiliarity with database structures and design principles.\nEagerness to learn and grow within the field of data engineering and data integration.\nBasic understanding of data modeling concepts such as normalization.\nStrong problem-solving skills, attention to detail, and enthusiasm for working with data.\nEffective communication and teamwork skills."
  },
  {
    "Job ID": "4271451893",
    "Titlu Job": "Data Scientist - Risk\nData Scientist - Risk with verification",
    "Companie": "Worldline",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 3 days ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4271451893/?eBP=CwEAAAGYso0H5pEsbVXwY-g26hEhYLT53UaEOrb4PU1YWT0wyfsnig1iC37JpQhdLaf1Eb-dhGQWkL5UptxfZ6hkV1MJCb-xpOhQl3m-1MYPUOMFEbrxTvKZHkEIFht5tVv5v7X5wp3L8ixtfgbuH6xdKSmkmCe9y3R6x_dmBs10-WHJcSFMlA6_QY81CkufqHi-I9GtwqnWpPNMxt_OMxwOoG0UcNd3WKnSueW4FgKu267HZ-nMtDMhBrKCGRLyGOQsCKa_NUh1o8GC-D17b1PGEUagj4DNt51e7N42BuIXiaHEhtmz7Tlek2c-FaKheINXHBoILElC3V7PW0hxnLR6zQ3LNniUfUp2wl32YbQwipxCSkeR91rKODOVKmssHxyCBrpNam7AaFHrBajqWX_SBC2Oplw0nQrWJ8fBSPQ1oWcdUJOpOiGCb_Viru1ulg_S6LmI_sg7tYFNb8AZ3lgYZlWR8Yt0M10UnKK-GQ_LMCujeEfCKKpqFoYJUhN9f63nslddx4YtKt2Q8Q&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=Gan3tGyvhD5vvNF%2FHibjCg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nJob Description\n\nData Scientist - Risk\n\nBucharest, Romania\n\n This is Worldline. \n\nWith 20,000 employees and a physical presence in over 50 countries, Worldline is the fourth largest player worldwide and the only European player with an international footprint to rival international payments peers based in the US, providing the full payment ecosystem.\n\nWorldline offers payment services, ranging from online payments, omnichannel solutions and a broad portfolio of payment terminals to one million merchants and 1,200 banks and financial institutions.\n\n The O   pportunity \n\nThe Risk Data Science team is a team of risk and data science professionals which primary responsibilities are to oversee the risk resulting from the payment transactions of hundreds of thousands of merchants, support other risk teams with reports and data insights and research models and techniques that would improve the treatment of risks.\n\nData management and analytics are key area of development as the team strives to turn huge amounts of data generated by payment transactions into unique insights that improve measurement, monitoring and management of merchant risk.\n\nDay-to-Day Responsibilities\n\nIn your role, you will explore the opportunities that statistical analysis and data engineering can bring to create value for the management of merchant risk.\n\nYour project work will address four key priorities in the development of our analytical capabilities:\n\n Data engineering: in close collaboration with Worldline’s BI team who has the responsibility of developing and maintaining data management platforms, you will develop a risk data repository for the analysis of millions of electronic payments that are processed daily by Worldline \n Reporting and Data Sharing: you will create reports and data sharing solutions using BI tools to help risk teams get access to the data that they need to best perform their tasks. Moreover, you will collaborate with users in refining the design of informative dashboards and data sharing systems. \n Merchant portfolio optimization: you will contribute to develop a risk-based pricing approach to achieve an optimal risk/reward balance consistent with the company's business strategy \n Machine learning and platform building: you will contribute to building machine learning models and putting them in production, building platforms and making sure the models function properly within the environment. \n Depending on your main area of specialization, and our team’s business needs, you may be required to place more focus on one or another of our key priorities. \n\nWho Are We Looking For\n\nWe look for big thinkers. People who can drive positive change, step up and show what’s next – people with passion, can-do attitude and a hunger to learn and grow. In practice this means:\n\n Ability to manipulate and analyse large and complex data sets coming from internal and external sources \n Data-driven and outcome-focused; able to tell stories using data \n Takes personal ownership; self-starter; ability to drive projects \n Result oriented and diligent \n Learns continuously; seeks out knowledge, ideas and feedback \n Good communication skills for interacting effectively with both business and technical development teams \n Good knowledge of BI systems and an ability to take feed-back with users and coordinate with them for improving the layout and functionalities of your system \n Master of Sciences degree in a quantitative field (Statistics, Data Science, Quantitative marketing, Econometrics, Quantitative finance or similar) \n Very good knowledge of data manipulation and analysis using SQL BI systems or python. \n Excellent understanding of relational model for database management and data modelling principles (conceptual/logical data models) \n Good knowledge of either R, Python, SAS or similar statistical software \n Knowledge of either JavaScript is a plus \n Good command of English required; fluency in French beneficial \n\nPerks & Benefits\n\nAt Worldline you’ll get the chance to be at the heart of the global payments technology industry and shape how the world pays and gets paid. On top of that, you will also:\n\n Hybrid Working Policy \n Gift vouchers on the occasion of Christmas/Easter Holidays \n Private medical services \n 21 vacation days/year \n Referral bonuses for new hires recommended by you \n WFH & Flexible Working Hours \n Full access to the “Learning” platform \n\n Shape the evolution. \n\nWe are pushing towards the next frontiers of payments technology, and we look for big thinkers to join our journey. People with passion, can-do attitude and a hunger to learn and grow. Here you’ll work with ambitious colleagues from around the world, take on unique challenges as a team, and make a real impact on the society. And with our empowering culture, strong technology and extensive training opportunities, we help you accelerate your career. Wherever you decide to go. Join our global team of over 18,000 innovators across 40+ countries, and shape a tomorrow that is yours to own.\n\n Learn more about life at Worldline at   jobs.worldline.com \n\n We are proud to be an Equal Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as an individual with a disability, or any applicable legally protected characteristics."
  },
  {
    "Job ID": "4267775535",
    "Titlu Job": "Data Scientist\nData Scientist with verification",
    "Companie": "OpenText",
    "Locatie": "Cluj-Napoca, Cluj, Romania · Reposted 1 week ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4267775535/?eBP=CwEAAAGYso0H5rvVU0OvywFrmYE6FRg3dc3AoVNQmLdjwkSNY9MczUT-jGaRhaiHxpBmbl89bF9HTsXYBnpaU4LuwOqeNJWZUa9SYeseHTqak5osdtCwt1HyQIrDvcPbNz-R9avdyMwetL9Vt6SXYl6aGIHtIAvXR_KocyLmvg61iMYn8BWwX67n1gRpO7AALf3bDcLrPAN_maPOraye8se3pmXzUmns_Ouyn03KblYtWAuxNy5NH82tbE_pb4Qhc-eTOlQoK2u2Fhu0ZhKXvxZ8VOky-WTFvICDVIvYwnBzjU_nyFJoTihQ8UA2zvQ9cTOLGh6B98X0262jsQwlNAf6YaizflzgWDYuto1XnsOa71rA4i5rawZgPLKfHBau42CpDGRgw_QHwwpK5jH7eJfSZGW-xkBCQPypYMMb4FrtokoSnDX3E4TM4a85CnHoFP4X5Qen27b8ZI0iKJHFi8pr0dgwERYn9XUqJobKCCf6t3FP5sl0wJrrXMURfrjsmLDPinJcXOMikDbl0Q&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=n8kZvsLYYbkzF2yKfb9b4Q%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nOpentext - The Information Company\n\nOpenText is a global leader in information management, where innovation, creativity, and collaboration are the key components of our corporate culture. As a member of our team, you will have the opportunity to partner with the most highly regarded companies in the world, tackle complex issues, and contribute to projects that shape the future of digital transformation.\n\nAI-First. Future-Driven. Human-Centered.\n\nAt OpenText, AI is at the heart of everything we do—powering innovation, transforming work, and empowering digital knowledge workers. We're hiring talent that AI can't replace to help us shape the future of information management. Join us.\n\nThe OpenText Functional Testing Family provides functional testing solutions enabling customers to test earlier and faster by delivering AI-driven test automation across an unparalleled range of technologies; on the most popular browsers, mobile devices, operating systems, and form-factors; from the cloud or on-premises; to deliver the speed and resiliency required to achieve automation at scale that is tightly integrated with an organization’s current DevOps toolchain.\n\nWe are seeking a talented Data Scientist to join our fast-paced, agile team focused on advancing our product in the Functional Testing Domain. In this role, you will lead the development of AI-driven features, combining Computer Vision and Large Language Models (LLMs) to deliver intelligent, scalable solutions. You’ll work closely with global teams and contribute to a modern SaaS-based platform.\n\nKey Responsibilities\n\nDesign, develop, and maintain deep learning models for Computer Vision applications\nDrive the research and implementation of LLM-powered features from concept to production\nCollaborate with cross-functional teams across multiple international locations\nContribute to the architecture and evolution of a SaaS-based product\nWrite clean, efficient, and scalable code aligned with best software engineering practices\nPartner with stakeholders to identify opportunities for data-driven solutions\nEvaluate new data sources and techniques to improve model performance and accuracy\nBuild tools and processes to monitor, validate, and optimize model outcomes\n\nRequired Qualifications\n\nProven problem-solving skills and a strong analytical mindset\nProficiency in Python and experience with statistical and data manipulation libraries\nHands-on experience integrating and fine-tuning LLMs for real-world applications\nSolid understanding of data architecture and scalable data pipelines\nFamiliarity with a range of machine learning techniques (e.g., clustering, decision trees, neural networks) and their practical trade-offs\nExcellent communication skills for effective collaboration across teams\nEagerness to learn and adapt to new technologies and methodologies\n\nWhat We Offer\n\nOpportunities for growth and learning through challenging projects and the latest technologies.\nBe part of a team working on innovative SaaS products.\nExposure to multiple technologies within a versatile and dynamic environment.\nAccess to training, coaching, workshops, and online learning platforms to develop and showcase your skills.\n\nOpenText's efforts to build an inclusive work environment go beyond simply complying with applicable laws. Our Employment Equity and Diversity Policy provides direction on maintaining a working environment that is inclusive of everyone, regardless of culture, national origin, race, color, gender, gender identification, sexual orientation, family status, age, veteran status, disability, religion, or other basis protected by applicable laws.\n\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please contact us at hr@opentext.com. Our proactive approach fosters collaboration, innovation, and personal growth, enriching OpenText's vibrant workplace."
  },
  {
    "Job ID": "4279483788",
    "Titlu Job": "Junior Business Intelligence Specialist\nJunior Business Intelligence Specialist with verification",
    "Companie": "Sievo",
    "Locatie": "Bucharest, Romania · 1 week ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4279483788/?eBP=CwEAAAGYso0H5vuJJB7VmlEl9X7LFDqW4zyPQPagJdYaWeKLd3vmoFGGdzBUWxKIcHlytsCCiDzS7QDnaDrNYilUrVvsjcQPHp46eCX1hI1tRAqSrsthX3IxyHA79qhSRyuKaFiPYrAvGOlyW5NxqR1sPeY59SDKVs-D1GDVFJqzacfnCUZRy5eKENXgtuuGoBzF-OHEJioGdzwYPUWiNhNah83V3krVKc0ZdE-EEkzJ-AJKW7BhRVki4C3NRlX8Xzm64hTXBl12DopuMLQakcfGQRB8_U7bVpiNEAaJN5DZjq__4gYjZQS8xDVb4w8eNg4peJquttlz2C2zc-6tgFJcj8k4djaviovKgXhIJbbl82xhSrIuiUQ57cYpbkFTb4GkKwa27dbD3bqp6ngwWpluso923AXklomZIVlrGm-SlGVqv04_rCOVMhFwcXsAI7iFEgBaEkcQBpDT6hir0o24l5AMsxP6x1CSk6hJ2mmTfkl4Po9rKGoGbdI4Vw&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=lGqmRDOdsIME5EAehE5n9A%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nMeet Sievo\n\nWe are Sievo – a fast-growing software-as-a-service (SaaS) growth company from Finland. At Sievo, we help the world's largest organizations make effective and timely decisions by creating smart and seamless procurement analytics software solutions.\nAs the global leaders in our field, we process 2% of global GDP annually and serve the largest companies in the world. Our client portfolio includes 150+ large, multinational companies such as Kellogg’s, Levi’s, and Deutsche Telekom. Our offices are located in Bucharest, Helsinki, and Chicago.\nAt the heart of our success are talented and passionate people. We take pride in fostering a collaborative and welcoming environment where people come first, differences are celebrated, and innovation thrives.\n\nAbout the team\n\nWe are now looking for Junior Business Intelligence Specialists (internal title: Solution Support Specialist) to join our Solution Support team in Bucharest!\nSolution Support is a driven, customer-focused, team that ensures our clients get the best out of Sievo’s Analytics. With team members across all locations in Bucharest, Helsinki, and Chicago we offer support to our global customer base with operative issues and questions, as well as design and implement more complex technical functionalities. If you enjoy working with data, problem-solving and supporting customers, this is the perfect place to make an impact!\n\nAbout the role\n\nAs a Junior Business Intelligence Specialist, you will:\nServe our diverse customer base and support all the different solutions we offer\nBe the first in line tackling the challenges our customers have, advising them when they have questions about our software\nTroubleshoot data flow issues and implement configuration changes to dashboards, charts and KPIs using SQL and Qlik Sense\nActively communicate with customers in writing through our support platform and occasionally participate in client meetings\nResolve support requests on your own or by cooperating with teammates and other teams like Customer Success Managers, Data Engineers, Data Managers and Software Developers\nTake part in the continuous development of our internal processes and ways-of-working\nWork mainly during the daytime, but be available for evening shifts that end at 1 am to offer support for our customers in the Americas\n\nWhat typically gives a good starting point for a Junior Business Intelligence Specialist?\n\nUnderstanding of relational databases, SQL, or some other programming language\nUnderstanding of Qlik Sense, or other BI tools (such as PowerBI or Tableau)\nStrong desire to serve and support customers\nStrong analytical and problem-solving skills\nIndependent working style and taking ownership of what you do\nAbility to learn quickly and pick up new software\nGreat communication skills and fluency in English (other language skills are appreciated)\nAlso, basic understanding of the Procurement/Finance context is a plus\n\nWhat we offer\n\nHybrid work environment with a great relaxed place to work in Afi Park 1, Bucharest\nInternational culture with colleagues and clients from around the world\nA company culture that challenges you to exceed and enables you to learn\nSupportive team which cares about your growth and development\nFreedom and responsibility – we are looking for people who yearn for this freedom and are willing to take on the responsibility\nAwesome perks such as private medical subscription, flexible benefits package, Sievo Equity Program, referral bonus, extra 5 days of vacation, and many more!\nThe salary for this position ranges from 5000 to 5900 RON/Net per month. This is a full-time position and offers a great starting point at Sievo for someone with strong analytical skills and a customer service mindset.\n\n\nHow to apply\n\nWe would love to hear from you next!\nIf we sparked your interest, send us your CV and cover letter through our recruitment system. And yes, bonus points for videos :)\n\nWe are reviewing applications continuously, which means that we look forward to receiving your application as soon as possible, but at the latest by August 31st.\nIf you have questions about the position, you can reach out to the hiring manager, Solution Support team lead, Plamen Angelov (plamen.angelov@sievo.com).\n\nAt Sievo, we celebrate and support differences and strive to create a culture where everyone feels valued and included. As an Equal Opportunity Employer, we do not discriminate against any individual in hiring or employment based on gender, gender identity or expression, age, ethnic or national origin, nationality, language, religion or belief, opinion, disability, state of health, sexual orientation, or other personal reasons."
  },
  {
    "Job ID": "4269007509",
    "Titlu Job": "Generative AI Engineer\nGenerative AI Engineer",
    "Companie": "BMW TechWorks Romania",
    "Locatie": "Cluj-Napoca, Cluj, Romania · Reposted 1 week ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4269007509/?eBP=CwEAAAGYso0H5qjLH9V4RpVe7vWzL0PDMpBXStM_JfLDg9lDlYAtVHv4GNloa_JusOUQYYx0v4ERM00ujxoyKvdJhLyVUOMzwW91DiAvoysLjFhYquT6xePzIjtRcT0fO98jN7LNZEwnYGXw8g3E-3Zgsa1EsWCUY_ZcoTMdi-ctMKT5gySqwZsxUCaDFxRqKXCNPFuV5xXVkZaz2rXKPI_-WhqXzBx1OOAdB2LWliCwMMPzd7IsdNgEoB3Y2CSid_iNu2wyzwkmorXrd1UzK9F3XYrR0Eo3l9OjxoGv5q8r9W6g9rSyZ_ZeEXvEogGRx0JSPJmvuP_QIDS4yjmzoFncyJUSSobDv6jeFiZkxHiGTywXR3w4drNahP-kxJzE-W1h8X1scYho1KLTWAvMxziO1JUq_S-9oaVR6aYphw_5C7JeJf2FvJ_c7DhHm59tA599hs7-Byern8AKd7DhZKjSH_FxTJ6-f5DvB3q8yhFyNNu8SxiP86bu7Y7MmABm1xaG_W_EfQAf8Bn_BhGy&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=R3Ym6ndYc40T5LTlCUEMYA%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nWho We Are\n\nEverything at BMW TechWorks Romania begins with passion. It transforms a job into a calling. It motivates us to continually reinvent mobility and bring new ideas to life and onto the roads. Passion for collaborative projects turns a team into a strong unit where every viewpoint is appreciated.\n\nWhatever you aspire to, at BMW TechWorks Romania we live and breathe software and we offer a wide variety of departments and fields where you can share your professional passion with us. By delivering software all the way from the idea to the final product, we lead BMW into the future of digitalization and mobility. And this also means:\n\nWe search for excellence\nWe get involved\nWe keep it simple\nWe share trust\n\nJoin BMW TechWorks Romania on our journey of innovation and excellence as we redefine the future of motion, one product at a time. Our engineers are vital to the innovation and digitalization of BMW Group's driving machines, production, sales and banking processes, and you could be part of our evolving teams.\n\nWhat Awaits You\n\nYou drive the development and optimization of (generative) AI applications with a strong focus on model evaluation, retrieval-augmented generation (RAG) and prompt engineering\nYou analyze and integrate data from various sources, ensuring high data quality and preparing it for effective AI-driven solutions\nYou experiment with LLM models to improve performance and applicability across business use cases\nYou collaborate with our AI platform team to enhance and scale AI-driven capabilities\nYou work closely with different business units, helping them leverage AI models for real-world applications and continuous improvements\nYou share your expertise in GenAI and machine learning with other teams, contributing to knowledge-sharing and innovation within the organization\n\nWhat Should You Bring Along\n\nA university degree in Computer Science, Engineering, or a related field \nAt least 2 years of experience as a Python Developer \nExperience with the usage of LLM APIs (OpenAI, Anthropic) \nExperience with prompt engineering \nExperience with RAG and vector databases (embeddings) \nKnowledge of data ingestion and preprocessing for LLM applications \nExperience with software development best practices (e.g., clean code, unit testing, CI/CD) \nFamiliarity with MLOps and best practices for deploying and maintaining AI models in production \nExperience with data pipelines and preprocessing techniques \nStrong problem-solving skills and the ability to work in a collaborative, agile environment \nExcellent English communication skills, both written and spoken \n\nWhat do we offer?\n\nChallenging projects with which we are shaping the mobility of tomorrow\nGreat team spirit within an international team\nState-of-the-art global IT landscape and processes\n100% implementation of the Agile Working Model methodology\nWide range of personal & professional development opportunities\nHigh level of job security\nWork-Life-Balance and flexible working hours\nAttractive and performance-related remuneration\nDynamic and highly-motivating work environment\n\nAt BMW TechWorks Romania, we view diversity and inclusion in all its forms as a cornerstone of our team's strength. Equal opportunities are a priority, and fair treatment of all applicants and employees is a fundamental principal of our corporate policy. Our recruitment decisions ensure a balanced and inclusive approach, valuing our people’s different personalities and skills, experience and viewpoints, regardless of sexual orientation, national origin or citizenship, gender identity, age, race, color, ethnicity, religion, or disability."
  },
  {
    "Job ID": "4267454104",
    "Titlu Job": "Junior Data Engineer\nJunior Data Engineer with verification",
    "Companie": "principal33",
    "Locatie": "Cluj, Romania · 4 weeks ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4267454104/?eBP=CwEAAAGYso0H5vc9UkTQZEnQro_0QNFLAaAy8GQpVQ7_HKgcE7uKfXuqYcNyygsMjoRwIsIxdhdiUnhAWE8H5pHWbtVDtYGVvS16LK7sMME0wryUSsM3AqSwgvyz2XMLrDwHuC-M1VAmGnpWO84jhJ5N3ZmSmoTQknsrnfMt9AYzYEoHIux28I-oAi2MdaPLzzA2BugFdRDNRuiEcwXQ2anMqu9prNXBtaW-7G1eo1iMCbNZoXyj00WL8W0rltXqavi0W9Rp0kAedBgDzr_A6yGtlPiAAz5L5VdEFAfmngzOq6kinTxQDQgwP4EzXRa6S-OXzVJvZdebdfPAMYwGbf885p50V-1AeNunt_dbAsoNaJ5GQcKCkpj2mrwoH_aflltBG2LFjtnWuYReJB7jM9of0Z6SqzTES4qTAKhkwxt6XC-PyUlTPtijEFNSMRe9ljwL6qPmIZ1fAX8cYrJ8bcpObsf-1U7OI4it66yANcqjC3X7NZMC4IY1PsZUc5at6CM8b4MIZwTuoHlGBg&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=i%2FMqfPReezqSgX7tcl66Fw%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nAbout us\nAt Principal33 we strive to make happiness at work a reality. Because it's not just about the money, it's also about the work environment and appreciation. It's about creating the best team setup you can imagine and getting involved in the things you're passionate about. And you can be a part of it, because it's fun to get things done!\n\nWe want our employees to innovate and we allow them to do what they are truly passionate about. Based on this conviction, Principal33 aligns its strategy around its vision: to become a leading IT service company and a better working-life balance. With currently over 250 employees from different countries, we are actively shaping the future of work.\n\nAbout the Job\nDevelop high quality data models in SQL to support our applications\nCreate well-defined, performant, and documented DBT model\nDesign, build, and launch new data models and data pipelines.\nImplement best practices in data engineering, including data integrity, validation, reliability, and documentation, while improving data discover-ability\nOptimize database design for performance\nDevelop automated data pipelines in AWS (Lambdas, Glue, EKS)\nDesign and build new ways on ingesting and providing data (API, 3rd party integrations).\nImplement muti-tenant data architecture systems\nBuild relationships with Data Scientists, Product Managers, and Software Engineers to understand data needs\n\nRequirements\n0-2 years of relevant Data working experience\nCoding skills in Python and SQL\nKnowledge of Data tooling (Airflow, DBT, S3, RDS, …)\nAbility to build workflows in Airflow with operators, dependencies, and error handling.\nImplements proper scheduling and triggering conditions.\nUnderstanding of and ability to follow data design principles\nGood understanding of GIT (branching, merging and rebase)\nAbility to communicate complex concepts concisely and clearly\nAble to work autonomously with agility\nStrong, concise communication skills\nFluent in English, written and spoken\n\nBenefits\nMedical insurance – Because your health and that of your family is our top priority. You’re covered!\nHoliday flat in Valencia – Dreaming of sunny days in Spain? Our company flat is ready for your next getaway.\nGifts for special occasions – We love celebrating you! Expect thoughtful surprises on Easter, Women’s Day, Father’s Day, and more.\nAnniversary gifts – Each work anniversary is a milestone worth celebrating, and we’ll continue to mark every year you spend with us with a special gift.\nTeam-building events – We value connection beyond work, offering engaging team experiences in great locations to inspire collaboration and fun.\nEnd of the year celebrations – We wrap up each year with a special celebration, filled with joy, laughter, and unforgettable moments.\nDay off on your birthday – Your special day is yours to enjoy, no work required!\nMonthly massage day – Treat yourself to a relaxing massage at the office once a month.\nMonthly themed lunch – Delicious food and great company – let’s keep sharing laughs and stories around the table each month.\nCommunity and social initiatives – We bring people together through activities like Bring Kids to the Office Day, donation drives, tree planting, sporting events, decorating the Christmas tree with your colleagues, celebrating new office openings, Principal33’s anniversary, Exchange Office, and more!\nAccess to Udemy Learning Platform – We know growth matters, so you now have unlimited access to thousands of courses on Udemy. Develop your skills, anytime, anywhere!\nGerman Language Courses – We offer dedicated language courses to help you develop your German skills, supporting both personal and professional growth.\nSAP Courses – We’re preparing to launch specialized SAP training sessions to support your professional development and boost your expertise in this valuable field.\nPersonal & Professional Growth – We support your development through masterclasses with experienced trainers and are open to investing in courses and training that help you grow."
  },
  {
    "Job ID": "4283561768",
    "Titlu Job": "ING International Talent Programme– Analytics Track @ING Hubs Romania\nING International Talent Programme– Analytics Track @ING Hubs Romania with verification",
    "Companie": "ING Hubs Romania",
    "Locatie": "Bucharest, Bucharest, Romania · 3 days ago · 33 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4283561768/?eBP=CwEAAAGYso0H5nI87QBwJmsTlXjkEo5Du8GXapLZoV9vACmwpUSDy04u-joVPUx2IelFgYheOXlJ9syK5qo1_VsmcgNq16I2FcpCqWo_bL48v8yB5vd1nBgaNNkDoxfri1RRlho8Ha6bchcJeohGTExpCoZF1twkGeSff3aPkEEVVqpeyMWm2Ecl-yfSx8ljDzXC61t6IjHiA6Hi4hdJnoCnxxP_B9FKSbuVzzoftPU0eqj1pL-RlgfnquUEsZX7MWf9wV7OJT9X2U3fze3uuq7n5KiZS3ImLOncRA9ur5WXh4_FWiUFzFTIcdzzYuWk8j_fkN0PZVFjInPh-iEvvuLiOYga8uEAn9CiRiwZdQqxmAAetptPU64pyAEyKisO9m5-G_7ZGw9vgTie9yokIAg_XfCnOYyRNlXjE_oJH22GufgL1XPMXIAb5J0oIyWf1akHWMZv5oRKY938LIEA2gGx-FZ0J9JifFO-Mgb6W0RhKCL90I9UotYkDjTjB3TK3nrfYMYcvqyUHl9Tmw&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=IlVrFqg3d5NfqGGW1e1cRQ%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nAbout ING International Talent Programme (ITP)\n\nJoining the ING International Talent Programme (ITP) means you have the chance to play a part in leading the change ING wants to make. During the two-years, you will learn more about your chosen discipline and the complex IT environment within ING. The wide selection of trainings also allows you to discover yourself and better prepare your strengths.\n\n This is a full-time, permanent role, 40 hours/week.\n\nYour Journey As a Trainee\n\nThe banking industry is evolving and there has never been a more interesting time to be part of it. At ING Hubs Romania we are a team of engineers developing software solutions for various countries across ING. The projects we develop impact millions of clients worldwide and enable the digital transformation of ING. We are working in an agile environment, we value proactive individuals with a can-do approach to problems and who put their curiosity to work in broadening their knowledge and skills.\n\nDo you want to unleash the power of data to redefine banking?\n\nAs an analytics trainee, you’ll use your passion for data to build models and write algorithms that make banking better, smarter and more personal. Your work will have a direct impact on people in over 40 countries worldwide.\n\nDoes data excite you?\n\nAre you inspired by its potential to reshape banking, based on people’s own personal wants and needs?\n\nYour analysis and insights can have impact in countless different ways and across all areas of our business: financial, risk, customer interaction, product development. Data is indispensable when deciding on our pricing strategy, for example, and when analysing and predicting risks with the help of intelligent models. And it drives innovation. It’s the logical starting point for progress.\n\nIf you’re excited by the possibilities of working with extremely large volumes of data – think of our millions of customers worldwide – we’re excited to hear from you.\n\nAreas of development \n\nBanking skills. Know ING strategy, learn the basics of banking in a broad perspective, and the environment we are operating in.\n\nPersonal Skills. Learn How To Lead, Communicate And Collaborate.\n\nProfessional expertise. Gain specific expertise in the trainee’s chosen track.\n\nSustainability. We want to be a banking leader in building a sustainable future for our company, our customers, society and the environment. Therefore, we give the opportunity to be a pioneer in defining new ways to do business. \n\nYour ITP Rotations\n\nIn your first year and a half of the program you`ll explore different areas within ING. You’ll have the chance to start your journey as a Junior Data Analyst or Data Scientist and you will continue to develop in this area. During this year and a half, you will have three rotations.\n\nThe second rotation you will have the opportunity to work abroad for six months with one of your projects. As we are a company with a presence in many countries across the globe, you could spend this time in Singapore, US, Poland, Australia or Spain.\n\nWhat Makes This Programme Awesome\n\nThis is a comprehensive programme that provides talented graduates with the knowledge, skills and on-the-job experience to become ING’s future leaders. We offer you the chance to shape your own ideas about banking in a receptive environment.\n\nThe program is truly international with over 100 trainees in 14 different countries. For each year of the programme there will be a global event designed as a bootcamp to develop your personal skill in the process.\n\nWhat We Offer\n\nGlobal events. Access to yearly 2 weeks’ global events with other ING International Talent Programme talents from all around the world (you will mainly be in Bucharest in the first 18 months).\n\nJob rotations. Insights into various business units during the first 18 months and work abroad into one of our ING countries for 3 - 6 months. (if circumstances allow)\n\nInternational onboarding. Following your local onboarding introduction, you will fly to our headquarters in Amsterdam for a one week-long international onboarding event. (if circumstances allow)\n\nTraining & learning experiences in different business lines to boost your knowledge and skill set.\n\nMentoring. Experienced ING executives will support your personal and professional development through regular feedback and coaching.\n\nSpecialized job. After 18 months of job rotations, you will start in your first dedicated assignment in the IT field.\n\nWhat we`re looking for:\n\nMandatory\n\nYou have a Bachelor’s/Master’s degree from a university, preferably in Informatics, Econometrics, Computer/Data Science, Information Management or Statistics;\nYou are passionate about data analytics & statistics;\nExcellent English written and verbal communication skills;\nYou have a maximum of 2 years of professional experience;\nExtra-curricular activities (such as board or committee experience, volunteer work, internships) to prove your leadership development and affinity with the track you applied for;\nUnderstanding & views on economic landscape & banking industry;\nYou are enthusiastic and consider the interests of our customers and your colleagues;\nYou have an innovative take on banking and an unconditional drive to turn your ideas into reality;\nYou are interested to learn more about banking/finance;\nYou act with integrity and responsibility.\n\nNice to have\n\nNatural interest in sustainability/ ESG- Environmental- Social - Governance.\n\nING’s International Talent Programme is looking for smart, results-driven people to make banking awesome.\n\nGet on the fast track with a traineeship and apply now!\n\n ING International Talent Programme (𝐈𝐓𝐏) is open to applicants until 1st of September.\n\nIf you want to deep dive into the processing of personal data conducted by ING Hubs Romania during the recruitment process and your rights related to it, read the privacy notices on our website (make sure to scroll until you reach the Data Protection section/ Candidates tab). \n\n, ING Hubs"
  },
  {
    "Job ID": "4283180676",
    "Titlu Job": "Predictive Modelling Analyst\nPredictive Modelling Analyst with verification",
    "Companie": "Allianz Services",
    "Locatie": "Bucharest, Bucharest, Romania · 4 days ago · 19 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4283180676/?eBP=CwEAAAGYso0H5kb5frWXyMDvdG084lJF8l8Z82yZKT45PpXNIKgYg0G3GSkf9ApYQBX7SMIrw9BiD-mYrSDYStWlNc16GwyF1Ye9Rz0AnsQZ-EEYM3aYY1mjTxsEJfIM6K_Ihga8EMq_fghboL8sMAXkcEWcoXXbimZ9V58O0mG3gL9iOTSuu5UjyyWZ5bbd9_X7I-hK0eoTaMkxh1NCetYk_9PHjm33O3sf1uzHgsVgZsuc5laeA7f33uPQklxjBYICiNRJlpGh43_fyq_b3ub3lx06HRgG83XYlgLeoWXTiYEsrztcPQHtzkN0uaFNrSv03FN4cMLAXBrN6zVYK7GnDWKX47pBHAV1VQNNWwagOWO63zMiIXOPWi2Of9s1v5IqmTvgZPnpJVrGazjWx2b56s7s0748yQJ6f2VYni74jglLSDGb6XQWOVujQ3zLeZFcxBBEwVbTXbCIbtYqH2HKSnQhOdrcifsAlCxUXOGEXgqa2G7tf3U4FzS6CpjEz7vrMKOCy0lWV7o&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=uc%2BUZlOckrTiSjqAIjp5jQ%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted; Be an early applicant",
    "Descriere Job": "About the job\nAllianz Services is proud to serve and be part of Allianz Group, one of the world's leading insurers and asset managers. Our global footprint, with more than 7,300 employees located across ten countries and four continents, enables us to unlock value for our partners across the insurance value chain and deliver superior client experience within Allianz Group. At Allianz Services, we have a strong specialization in core insurance operations, shared services, business analytics, engineering, and management consulting. Our people and our trusted relationships with partners are what matter most. These are rooted in our values of compassion, integrity, and expertise and we strive to continuously evolve, improve, and deliver excellence while contributing successfully to the transformation of Allianz. Caring actively for the environment, for people, and for our customers is what makes us a great place to work and together we are shaping a better and more caring tomorrow.\n\nAllianz Services is a company which belongs to the legal entity, Allianz Technology SE.\n\nJob Role\n\nOur Global Pricing Analytics team is seeking a Predictive Modelling / Data Science Analyst to build strong data driven pricing models for all Lines of Business across Allianz Commercial. This person will need to collaborate internationally with various stakeholders, both within Global Pricing and across other Allianz Commercial functions. Furthermore, this individual will support strategic Allianz Commercial projects, such as developing and driving data driven approaches to portfolio management.\n\nThe Pricing Analytics team is part of the Global Pricing department at Allianz Commercial and is responsible for driving the use of Predictive Analytics within Pricing across Allianz Commercial globally. You will join an international department located across London, Munich, Bucharest, Chicago and New York.\n\nWhat Will You Do\n\nApply statistical and data science techniques to support the development of predictive pricing models across a variety of business lines at Allianz Commercial\nPresent and communicate modelling results and recommendations to internal stakeholders\nHelp to improve the overall technical analytics capabilities of the Pricing Analytics team\nDevelop a strong knowledge of the company’s data and data systems\nWork as part of a project team to drive forward the development of models \n\nWhat You Bring\n\nAdvanced degree in a quantitative field desirable, preferably with significant emphasis on statistical modelling or machine learning, e.g. Statistics, Data Science, Machine Learning, Computer Science or a related field\n1-3 years’ experience working in an actuarial/technical role within the insurance industry desirable\nKnowledge of P&C insurance and pricing techniques\nTrainee P&C Actuary desirable \n\nYou have\n\nUnderstanding of a wide range of classical and modern statistical and machine learning methods such as GLMs, decision trees, ensemble and regularization techniques etc. Experience with Bayesian approaches desirable\nExperience building and validating models using statistical software (Python, R, Emblem, SAS etc.)\nAbility to work efficiently and effectively with large data sets from a variety of sources, including both internal and external data.\nStrong SQL programming skills required\nExperience with version control tools such as GIT desirable\nAbility to effectively interpret data and modelling results, and to then communicate them to audiences with differing levels of technical understanding\nAbility to express ideas and messages clearly, both written and verbally\nOrganised, self-motivated, results-oriented, collaborative and very resourceful\nExperience of working with colleagues located in different countries desirable\nCommitted to personal development and passionate about continually learning new technical skills \n\nWhat We Offer\n\nWe support your well-being \n\nWe foster an inclusive and healthy workplace with a flexible hybrid working model:\n\nExperience access to counseling services, mental health resources, and well-being sessions designed to keep you feeling your best \nEnjoy a monthly budget via the Benefit platform, for personalized benefits packages, including comprehensive medical subscriptions, meal tickets, private pensions plans, life insurance, Allianz Tiriac insurance discounts, and many more. \nPrioritize what truly matters with time off for your birthday, extra days off for each year in Allianz (up to 5), days off for legal holidays that fall on weekends, as well as 24th and 31st of December, plus special allowances to support diverse life events. \n\nWe invest in your growth \n\nBenefit from an extensive learning curriculum designed to support your career advancement and meet your professional needs, with access to technical and soft-skills trainings, international certifications (Agile, Lean Six Sigma, Prince, ITIL, IFOA, ACCA, IACCM and more), learning resources from LinkedIn and Allianz platforms, opportunities to advance your languages skills(German, French, English) and elevate with our leadership Program.\n\nWe value you and your work \n\nWe acknowledge and recognize your work through performance based-rewards to celebrate your achievements, team and individual recognition programs to celebrate your contributions and internal referral bonuses.\n\nYour personal information, including sensitive data, may be shared with Hiring Managers to assess your suitability as a candidate. Only suitable candidates will be contacted, and all applications are confidential. Allianz Group, a trusted global insurance and asset management company, values employee ambitions and challenges, fostering an empowering environment. We are committed to diversity and inclusion, welcoming applications from all backgrounds, regardless of ethnicity, age, gender, nationality, religion, disability, or sexual orientation. Allianz is an equal opportunity employer, encouraging you to bring your whole self to work."
  },
  {
    "Job ID": "4273269855",
    "Titlu Job": "(Internship) Data and process analyst in Data Mining and Phenix activity\n(Internship) Data and process analyst in Data Mining and Phenix activity with verification",
    "Companie": "Renault Group",
    "Locatie": "Bucharest, Bucharest, Romania · 2 weeks ago · 86 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4273269855/?eBP=CwEAAAGYso0H5l_tmLA--me-QM0Ftua5Kd8-yAul9aKdAXx5CeeDPHVyGWzhYYKnECYF-3lKSJxbZSCDYh_wN9dPP6ZvkT2VqRcbQj5SltPNndbTOt_fI0wPeOy_0GjmtTQu1AldEFzsG51BN8wjOiBeRerWWssleJp-HclrB5VzjSWNGiO37w3FfcK7m1epLNchXjy4GS7_hL3jJLjz82FElqYOM4ops-5vDh0eKpogvpJ9MGu2fpAi6HInfLAtUmX-VV0vdE9E0eOujI2D6zurb3l3tMDEePIGwKaHeuBhuN6DCFM-Z2lWbJl3CaYKK33R9nE0wl0gkNtNfZWY4jjBE3gfTNrPEJbOr21UvDxHtBz_Y3tMAet8qs6NAmWABGxTTeKwHL8JfeEfvKFIBYnGv-Ut2Jl2jv2l8qdzEyj6nDEXo2JK7jCiiCECspvi9FbFSXENst_s3KQ3o8NAKR7z3UDjFGcg7Q0B_GyCFH1hBVE57ZvnmhWW8gMiUDXmB1dVL-zvYeO-W10&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=hzrMCnCpWsJiE0tzOAqRrw%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nProgramul de internship Data and process analyst in Data Mining and Phenix activity (F/M) este deschis in DEP DAIT > DIRECTIA AFTER SALES ENGINEERING Romania/EURASIA, din cadrul DIR. GLOBAL BUSINESS SERVICES ROMANIA.\n\nWhat will you do?\n\nYou will learn about Data Mining activity and you will interact with our department, create reports, dashboards and learn about Renault network.\n\nIt will be an internship program that will be held on Bucharest site (in Preciziei street) with a period of 6 months and afterwards...who knows, you can be our colleague! :)\n\nWhat you will learn?\n\nYou will learn about Data Mining activity (which consists in databases evolutions & maintenance like Spotfire, Datalake, Agile, JIRA+ informatic evolutions & maintenance - Excel, Acces and robotization process implementation)\n\nYou will learn about Phenix application & processes - which consists in an internal app that is linked to all services around the world. In this app, all engineers develop repair methods, repair timing, soft calibration etc. You will learn how to maintain the application's functionality, test new features, and debug potential issues with support from the IT team.\n\nAt the end, you will present the key learnings from both activities, highlighting your contributions to the team as well as your involvement in supporting the department’s French language training\n\nWhat We’re Looking For\n\nTechnical proficiency in Excel, VBA, Macros, and the Microsoft Office Suite Strong communication skills Language abilities:\n\nFrench: B2 level preferred\nEnglish: Minimum B1 level\n\nAdvantages?\n\n Gained experience collaborating with clients and colleagues across various countries\n Knowledge over important phase from Renault After Sales (for making the technical documentation available worldwide)\n Acquired knowledge of quality standards across various processes and clients, while developing an RPA (Robotic Process Automation) mindset through the creation of automation proposals.\n\nToate candidaturile vor fi luate in considerare indiferent de nationalitate, gen, dizabilitate, varsta, rasa, culoare, religie, stare de graviditate, identitate de gen sau orientare sexuala."
  },
  {
    "Job ID": "4269617782",
    "Titlu Job": "Growth Engineer - Backend Focus (Mid-Level)\nGrowth Engineer - Backend Focus (Mid-Level)",
    "Companie": "Deepstash (and Paladin)",
    "Locatie": "Bucharest Metropolitan Area · 3 weeks ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4269617782/?eBP=CwEAAAGYso0H5qMhs8kqnrBGiBoQQhlLhiQjkJKHGTBrY1dkllHwjQSUerzL8bIKqD_YoJ8R9uhhJdKEYLvUbyPxRIFjyOMDPvoMH1b8eY0u4LOsYx-YGeqtXotiYk4zg5PA8H6ynJyO3jP1qHnDVsQzAd9yMekqxM4wOlAjweo0PZcIv5O2bh_mG_InPWgY9eN8qjLkRa4qUAQuioaZv-2_0pSt9CLT6kEFpjgv_wlD0QtVa65dJCoyKcFH-39E9leP2M4PyZrN_q9lkWuMuoqcaaHbcGqsZQd9SBfX4VkX1i233cDggYDdovG30EcFJeE2ta7_czA2YBj137yJzcDCHI9YWBQ1nKvhbGIQkbQRxgPXHbMYyU1mJMd7ckhwVEzbuw4LRnPG0H1iiDuvemP9ep33K6AeieMCzfxv6Y-Po1Rmqhu4ErJOa6tGW1qNXJD4CPndx4_cBhkDQH2ArtmtuYPA2ESGB5V5n1PGN5iL657X6-IfpysRtq6uS5Hk9NggSZnMmA&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=O3qapM88xzG5Kir1Z6fKTA%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nAbout us\nWe’re building an ecosystem of consumer mobile apps, all focused on education and personal growth. Deepstash, our flagship app has over 10M+ registered users. People use it to discover and save bite-sized ideas from books, articles, and podcasts. Think of it as your personal library of curated knowledge.\n\nPaladin is a fun and engaging way to learn history through storytelling and gamification. We've launched it last year and it's experiencing explosive growth!\n\nWe're looking for people who can own their work and push the rocketship on a higher orbit.\n\nWhat you will do\nYou will join a team of 10 engineers to build educational products that millions of users will experience.\nMaintain paywall infrastructure – Handle subscriptions, receipt validation (iOS & Android), entitlements, and pricing experiments logic. Stripe prices and web paywalls.\nMaintain auth logic – Keep authentication system working smoothly (email, social). \nSupport onboarding logic – Track user progress and serve onboarding steps when needed.\nSync web and mobile funnels – Build APIs to connect web signups to mobile app accounts.\nSupport revenue dashboard – Build and maintain a backend dashboard showing key revenue metrics.\nIntegrate with Amplitude – Allow fetching of events for growth/data analysis when needed.\nBuild ad automations – Create backend scripts/tools to support ad ops (e.g. creatives, budget, campaign syncing).\nHandle ads attribution signals – Send correct postbacks/events to ad platforms (Meta, TikTok, etc.) with proper parameters.\n\nBonus impact: While your day‑to‑day is backend heavy, you’re comfortable making small React or React Native tweaks (copy changes, adding an analytics hook, wiring a new API call) so experiments can ship without hand‑offs.\n\nWho you are\nAmbitious and self-driven. You can carry your own weight and take responsibility for your work.\nFast learner. New technologies excite you. You propose solutions when we don't know what we need.\nYou get stuff done. We believe in consistent delivery over big lengthy releases. Results matter more than anything and they won’t happen unless we work for it.\n\nHard Skills\n1-2 years of backend work (we work in Python but believe you can adapt if you're smart & motivated and worked on another stack)\nexperience interacting with 3rd party APIs\nBig bonuses:\nexposure to ads / marketing\nhaving worked in teams that built products from scratch\nproduction experience\n\nBenefits\nMarket-level salary\nHigh-impact role in a fast-growing team\nBeing part of a product company that is on a meaningful mission\n\nThis is a B2B role, with hybrid office presence requirement."
  },
  {
    "Job ID": "4271402718",
    "Titlu Job": "GenAI/AI Engineer - Consultant (f/m/d)\nGenAI/AI Engineer - Consultant (f/m/d) with verification",
    "Companie": "MHP – A Porsche Company",
    "Locatie": "Cluj-Napoca, Cluj, Romania · Reposted 3 days ago · 84 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4271402718/?eBP=CwEAAAGYso0H5upOHairZN1iem6Y4RAcL3-iqRS84UcgeX6yslyrTKF7G-WRYhXSxTwxpIZ3gYv-V1PJsn_eCnNZshDG6HOLsU_1L5xD-MUCKofP9Tsn1kVdMJuxgiSt9Ap3W3oPMy983bu6ODaPj5RnK-f-gsbM3A93QqGWDlqNUtQnoL2t528Pk6ueK7VWtkOt34hvR9f_O55kHLwwcqd7JXgUU1n9msjFlyiETQ9Px39Rphiz7sFurQLaondg3YXPo00BimjpZPNJXxoekSpE-g5WmlGIUVjytDRHLBFV_NCY-kMbN039p2qhZ72OSRBoWcjPJXOxhZp__CAQteD6EQCB-SuHf6HuQDWvOLBAZlx9n1AYFC4eLx8xZ8ogJOmCkZZF-kf-z2kVIQwXRzoz65IxNENSEWv0atkCI1JIwsm_K8QUh2uwtJPpdpJ61cYspD3GLBthzW2gSLmVAQa86hVZd3ELdI-FxtUrEIct1WIxtaOe4Jj6h_iYQG66SZqreU2kciBk4XLq3SCE&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=Jk%2FiKuBJUot7nyAjj81%2BaQ%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nENABLING YOU TO SHAPE A BETTER TOMORROW\n\n\n Code number: J000017318 \n Entry level: Professionals \n Location: Bucharest , Cluj, Timisoara \n Organization: MHP - A Porsche Company \n\n\n Tasks \n\n\nDevelop and optimize APIs using Python and FastAPI for AI-driven chatbot systems.\nIntegrate internal knowledge bases with relational databases such as PostgreSQL.\nDeploy and manage scalable applications using Azure Cloud Services (Blob Storage, CosmosDB, App Service, Functions).\nEnsure smooth communication between services, databases, and APIs.\nContainerize applications using Docker to enable consistent development and deployment.\nCollaborate with teams on version control and CI/CD processes using GitLab.\nPerform basic Linux VM tasks related to cloud environment setup and deployment.\nContribute flexibly to a variety of AI projects, including generative AI, deep learning, and data science initiatives.\n\n\nQualifications\n\nRequired Skills & Experience:\n\n\nStrong Python development skills, especially for API development with FastAPI.\nStrong background in Data Science and AI, including experience with machine learning algorithms, statistical analysis, data preprocessing, model training and evaluation, as well as practical knowledge of deep learning frameworks and techniques.\nExperience with Docker containerization and deployment.\nExperience with SQL and familiarity with PostgreSQL or similar databases.\nKnowledge of GitLab for version control and basic CI/CD pipelines.\nCloud knowledge, preferably Azure, for deploying and managing applications.\n\n\nNice to Have:\n\n\nFamiliarity with Large Language Models (LLMs) and Retrieval-Augmented Generation (RAG).\nExperience with Data Engineering\nExperience with OpenAI, LangChain, LangGraph, Ragas and other chatbot development frameworks.\nExperience with Infrastructure as Code (IaC) tools.\nExperience with Agentic AI systems and autonomous agent frameworks.\n\n\nThings to know before departure:\n\n\nStart: by arrangement - always on the 1st and 15th of the month\nWorking hours: full-time (40h), 27 vacation days\nEmployment contract: Unlimited\nLine of work: Consulting\nLanguage skills: business-fluent English, C1 level\nFlexibility & willingness to travel\nOther: a valid work permit\n\n\n Exclusive look behind the scenes \n\nAt MHP, you will continuously grow with your projects and objectives in an innovative and supportive environment. That makes us the perfect sparring partner for your career, fueling your growth as an expert in your field while expanding your business network.\n\nWe value the authenticity that comes from bringing your individual strengths into the team. Diversity plays a key role in our culture, and it brings different visions & flavors into the mix.\n\n\nWe all share a strong team spirit. Every win, big or small, belongs to all of us.\nWe always welcome curiosity, creativity, and unconventional thinking patterns.\nWe recognize the importance of healthy, tight-knit communities and sustainable environmental changes, and we strive to enact positive change in any form within our reach.\nWe’re here to co-create your ideal career growth plan tailored to your professional aspirations."
  },
  {
    "Job ID": "4264345810",
    "Titlu Job": "AI Intern Scrum\nAI Intern Scrum",
    "Companie": "Deutsche Telekom Services Europe Romania (DTSE Romania)",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 2 weeks ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4264345810/?eBP=CwEAAAGYso0H5ttFtsej4hn5p6mOtzpOa5kHY_TbYtLUYJKSwAlDNaEuBWoceSyor6QoFg5mhTfXzMf5yDC3XDNJQBFdvLPswTZdyd42IJ1NlmCa_qpZ6cS-hhFLnkZYMSSJZXit56yka3_KFLpZ7E2EI0SEcUI4JnpmSthsjbuBTA5Nyu6vKG97xcBshwpMtkJVVtRgcwIGEBXA0d-MSEcp8JvmNBUcNxjpPCFTDiW-hre1EmVfelxjMN5A1ADlKjngq2NWdllJL5g9O9UnxK_FK-Z63Bq7bebVO9uIcFpka9bx1eozN_41notIvH7-gLC7jdj75uLZ7Jm-DVygZ_fFtrAMgT5KnbNKk1HoPhEjDHUgZVmPJJ_cHogQPrvQ6bJ4JQfBAzElGpIN2wEAM1X_m-lKVIHaqmz9lE4R1B0LOnmrUuT5J3vtw-ikTtNlkOAi9hD2_C_wrDF8POBkrRPpaP-U-Eu6Wd8dCbF8Mh4Q5BqpWRXjK4ouZ5UddrNd9nQsVwJmrdjEnYKZDd1Q&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=K%2FKecqi8HxdIyaujwBEU4w%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nCollaborate closely with developers, team members, and customers to drive the successful delivery of innovative AI product features.\nAct as Scrum Master by leading Agile ceremonies, including sprint planning, daily stand-ups, sprint reviews, and retrospectives, ensuring a smooth and efficient workflow.\nSupport the Product Manager in both strategic planning and day-to-day operational tasks.\nAnalyze business data sets and create simple scripts for data evaluation and process automation.\nChampion user needs throughout the development process, offering guidance on UI/UX design to enhance the user experience.\nServe as a vital link between business and technology, ensuring clear communication and alignment across all stakeholders.\nYou are currently enrolled in a Master’s degree program – ideally in Business Informatics, Industrial Engineering, or a related field at the intersection of IT and business.\nYou have advanced proficiency in both written and spoken English.\nYou are passionate about IT, with a strong interest in Machine Learning and Artificial Intelligence.\nYou have initial experience in project management and relevant tools (preferably Jira), and a genuine interest in product development.\nYou are familiar with Agile methodologies such as Scrum – or are eager to quickly get up to speed.\nYou possess at least basic Python skills and hands-on experience with data analysis.\nYou’re an excellent communicator – both verbally and in writing – and enjoy working in a multicultural, collaborative environment.\nYou’re highly motivated and eager to translate academic knowledge into practical, real-world solutions.\nYou work independently, take initiative, and enjoy tackling new challenges head-on.\nNice to have: Experience in graphic design, ideally with Adobe InDesign."
  },
  {
    "Job ID": "4274082570",
    "Titlu Job": "Te pasioneaza Pietele de Energie? Incepe ca Junior Energy Trading\nTe pasioneaza Pietele de Energie? Incepe ca Junior Energy Trading",
    "Companie": "PPC Romania",
    "Locatie": "Bucharest, Romania · 2 weeks ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4274082570/?eBP=CwEAAAGYso0H5-PmjUMTN2WKtObajkWSELS-Puk16j7q-DofuOOexTEBiFEHEtsxAGinXSNEdoqDR7c50y9P9lDJZFkXojz5Lsnq01jvn5FVJqPpo_FhJJUx7yOv4mjp1a96t9YcF3LOyoIeRYsC195AjNdHz5AGPmyJsrBmyezju6a-ozc25PHHSpEuRYqfqvISHbYA2xlIdzwjP7OOEnNupP-KNujCsSTS1NcuB7m8uL_C0V5yMerkSekWUGgQ8NhRM_JXdYQYv98bY8Cue213mdI_VSrwL8bTRNi7K-bMW6JgvuHCYNzctLWutKLYvBCfy7N_pqEdrqyysJjPcOoHvTgpxTEhcZbFYBb_btw9J3gFONzcBr0yuMwq4r2Kw_tErA_rEZIu6F3VfUtsOkPO4eIDoohWXHH-9H--HYEALFVYmHb2601RoecGjhWsLfWW-CU9yrWYPoe7iBk-2BkHkdHcfcdfWMqmlV24-UDZyqjaHSsB87C8W60m4Lr4FPkEUV8qDJVWaac&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=J76zkfshaCViRN72SF%2BpcQ%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nTe pasioneaza Pietele de Energie? Incepe ca Junior Energy Trading \n\n\n🏫: PPC-Public Power Corporation Romania\n👥: Energy&Commodity Management\n📍: Bucuresti\n⌛: Program: Lucru in ture de 8 ore (07:00-16:00 / 13:30-22:30) – ideal pentru un stil de viata echilibrat si diversificat!\n\n\nEsti la inceput de drum si te pasioneaza energia si pietele dinamice? Avem locul ideal pentru tine sa cresti si sa inveti direct din actiune!\n\nDaca esti dornic sa incepi o cariera reala intr-un domeniu cu viitor, acesta e primul pas! \n\nAplica acum si hai sa invatam impreuna!\n\n\nIti cream contextul sa te dezvolti, fiind responsabil/a sa:\nInveti pas cu pas cum se tranzactioneaza energia electrica pe pietele angro short-term\nMonitorizezi pietele locale si regionale de energie, intelegand evolutiile si mecanismele de pret\nTe implici in procesul de ofertare si tranzactionare a certificatelor verzi pe piata angro, invatand sa iei decizii in timp real, cu suportul mentorilor\nColaborezi cu echipele interne si iti formezi o baza solida pentru o cariera in trading energetic\n\nDorim sa te alaturi in calatoria noastra cu: \nDorinta de invatare si interes pentru domeniul energiei\nStudii superioare in inginerie sau economie\nCunostinte bune de operare PC: MS Office (Word, Excel, PowerPoint)\nCunostinte bune de limba engleza\nAtitudine proactiva si capacitate de a lucra in ritm alert\nCapaciatea de organizare a timpului si sarcinilor pentru a respecta termene limita.\n\nVino in echipa #PPC si te asteptam cu:\n\n✔️ Perspective de evolutie in cariera \nTraining complet on-the-job: Nu ai nevoie de experienta – te invatam noi tot ce trebuie sa stii\nMentorat 1-la-1: Vei avea alaturi specialisti cu experienta care te vor ghida care vor oferi feedback constant penru o evolutie in cariera\nMod de lucru hibrid: Birou & smartworking\nEchipa de profestionisti: Te vei dezvolta intr-o echipa diversificata si profesionista\nSanse reale de crestere: Incepem de la junior, dar planul e sa devii expert!\n\n💸 Recompense \nabonament medical/asigurare medicala\ntichete de masa, prime (Ziua Energeticianului, Paste, Craciun etc)\nal 13 lea salariu\ndecontarea unei parti din biletul de concediu\nzile de concediu suplimentar in functie de vechimea in munca\nzile libere extra (Ziua de nastere, Ziua Energeticianului etc)\noferte speciale din partea colaboratorilor nostri\nprogram de bonusare a recomandarilor de noi angajati\nabonament Bookster\n\nCe altceva trebuie sa stii\n\nConfidențialitatea procesului de recrutare\nLa PPC, respectăm confidențialitatea fiecărei aplicații. Doar candidații selectați vor fi contactați pentru interviu, iar celelalte candidaturi vor fi păstrate în baza noastră de date timp de maximum un an.\n\nDespre PPC\nSuntem lideri în energie în Europa de Sud-Est, activi în producția, distribuția și furnizarea de energie electrică, dar și în dezvoltarea de soluții inovatoare pentru un viitor sustenabil. Cu o capacitate instalată de 10,7 GW, furnizăm energie pentru 8,7 milioane de clienți și livrăm anual peste 35 TWh.\n\nÎn România, PPC a devenit un jucător de top odată cu achiziția companiilor Enel în octombrie 2023. Cu o istorie începută în 1950, suntem listați la Bursa de Valori din Atena și ne extindem constant viziunea.\n\nAngajamentul nostru pentru diversitate și incluziune\nCredem că energia vine din oameni. La PPC, fiecare voce contează, iar diversitatea este motorul inovației noastre. Indiferent de vârstă, etnie, gen sau dizabilitate, oferim un mediu incluziv, în care poți crește și performa.\n🔹 #EnergiePentruOrice – pentru cariera ta, pentru viitor, pentru toți"
  },
  {
    "Job ID": "4281182916",
    "Titlu Job": "Junior Data Scientist & AI (€50k-€80k) - EU\nJunior Data Scientist & AI (€50k-€80k) - EU",
    "Companie": "Joinrs",
    "Locatie": "European Union · 1 week ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4281182916/?eBP=CwEAAAGYso0H587un9JZ1Wj4nzPTlVFIl_Og5aeVSqlsJ4N_XfN9sb_4BzS9e9DB2iDxbxLKeAwy1F5zxtS3bIRN9e5W649ox8-ZVAeXaETK4VmPvEpLbOm71nQI2UuWn1PwdYFE5V3T_aryMYd6k4xhAbns-vfSzekTWMhoU3C-8Qt3hLQI8nU6esgbRIAZ8rNuc_zCxJRglkAcmWofWCc1hNb8ZeaGwmaprpzI4iGW_07PlOaXceQPBrdYgEBelLg0j-M0Kwso7xh6NNMXXeJx8HfN65mGMGzGKS4sVB-OpHU6934vfyNH53H-r81J0CAIgUQwmw3s9UYDdghuLD2skOxl_dwhG5N5638nMX51H0mRq2o4Zp8iYQbtMWk2yRY1j3wBaCHPldSKgTJuqBQ5qff-op3OH1cejf87CDt-a1NcAjp4zCs3S2HLKIULmP11sXV-C0xRYuw0_q4D6Oc1zAfAng7IOZjS7OUwU88XJ53LsC8PQLInN3ZogCe4TPy0ocu4B1BiGyTl_5ZAkIW40g&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=BW39XaK2Gk%2BY4S7YUaYp7g%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Applied; Easy Apply",
    "Descriere Job": "About the job\nOur goal is to help every recent graduate worldwide find a job that aligns with their ambitions: join us to make the aspirations of a community of over 1,500,000 users come true!\n\nWe are constantly looking for students, recent graduates, and junior professionals (with 0 to 3 years of experience) who aspire to join our team across Europe. Apply for this position, and our HR team will contact you as soon as a relevant role becomes available and your profile matches our requirements.\n\nFor all Junior positions in the Tech Field, we offer a full remote contract (Annual Salary: €50k-€80k) in the EU Region, you will have the opportunity to grow exponentially thanks to on-the-job training, you will be able to work in one of our offices or fully remote for as long as you want and we will equip you with a latest generation MacBook.\n\nWe are looking only for Junior profiles, with 0 to 3 years of experience.\n--\n\nResponsibilities:\nWithin the team, you may be responsible for one or more of the following tasks:\nImplementation of Machine Learning Algorithms: You will have the opportunity to implement and test machine learning algorithms, contributing to the development of intelligent solutions for business challenges. Specifically, working alongside our tech team, you will be involved in Joinrs AI: our Artificial Intelligence model that assists our community in finding employment.\nData Analysis and Modeling: You will participate in data analysis, developing predictive models and contributing to provide meaningful insights to enhance business decisions.\nData Visualization: You will learn to create clear and informative data visualizations to effectively communicate complex results to various stakeholders. In particular, you will create interactive dashboards to showcase data and Key Performance Indicators (Data Visualization) to the team, clients, investors, and all key stakeholders.\nOptimization of Business Processes: You will collaborate in identifying and optimizing business processes through the application of data-driven solutions.\nParticipation in Technological Brainstorming Sessions: You will be involved in brainstorming sessions to generate innovative ideas and contribute to identifying new opportunities in the field of Artificial Intelligence.\nContinuous Training and Updates on the Latest Trends: You will have access to continuous training programs to stay updated on the latest trends and advancements in the fields of Data Science and Artificial Intelligence.\n\n--\n\nWhat We Offer:\nWorking in the Joinrs team means being able to choose the best psychophysical conditions for tranquility and productivity. This translates into:\nRemote working and flexibility. You'll have the opportunity to work remotely full-time, but you can also use one of our offices.\nDynamic work environment. Our offices remain open, providing shared workspaces, meeting rooms, break areas, and a bar with fresh fruit and various snacks. You'll also find a foosball table and a gaming station. We aim for an informal work environment that encourages shared moments, always respecting individual activities.\nTeam building & fun. We frequently organize aperitifs, games, and leisure moments, which are integral parts of life at Joinrs, both inside and outside the office.\nCompany welfare. We guarantee you a company welfare package that meets your expectations.\nTech pack. You'll use advanced software and modern technologies, and you'll be provided with the latest-generation MacBook.\nTraining. You'll always have a mentor in your Joinrs journey, acting as a reference for both technical and team aspects. We ensure constant professional growth with progressively increasing responsibilities. You can participate in industry events and training courses, along with continuous education on the best e-learning platforms.\nSocial Impact. Your contribution will support thousands of recent graduates in finding the job they aspire to.\n--\n\nWho We Are:\nOur mission is to support every recent graduate and junior professional in achieving their goals, helping them start their careers with optimism and a clear vision for their future.\n\nWe are a united team that strongly believes in collaboration: together we work, discuss, and achieve results that inspire us to aim for ever more ambitious goals.\n\nOur community includes over 1,500,000 members across the US, UK, Europe, and Brazil, as well as 300+ companies like PwC, Accenture, Gi Group, Danone, and Siemens. And we’re growing fast—join us!\n--\n\nContract & Compensation:\nFor all Junior positions we offer a full remote contract (Annual Salary: €50k-€80k).\n\nSalary reviews are scheduled every six months, with your compensation increasing rapidly as you gain experience and translate it into a more significant impact.\n--\n\nSelection Process:\nCV Screening: The first step is a curriculum vitae (CV) screening (usually within 20 days of application).\nPhone Interview: The second step involves a 15-minute phone interview with our HR Manager.\nVideo Interview: The final step is a video interview with both the HR Manager and your future supervisor, lasting at least 45 minutes.\n--\n\nWhy Join Our Team?\nSocial Impact: You'll have the opportunity to support our community in realizing their ambitions, as well as your own.\nSuccessful Startup: Joinrs was selected among the top 10 startups globally at the Web Summit in Lisbon.\nExponential Personal Growth: You'll have the opportunity for exponential growth, both in hard and soft skills, thanks to a training program based on on-the-job training and online support."
  },
  {
    "Job ID": "4201838137",
    "Titlu Job": "Coders - AI Training [Remote]\nCoders - AI Training [Remote]",
    "Companie": "Braintrust",
    "Locatie": "Romania · Reposted 1 month ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4201838137/?eBP=CwEAAAGYso0H57PV5qGX68GVrcm50SK9HYqlUqr6nRm9Mh468t6OLKAeOS3mHHrJxp-1fkF0pn_KRoHRGh949r8hI4qO0l4KTYYc9ec_AnuwBXULt2kSYki2-r0KRzBtwFwTWP6BW3R3u9j0rUdMSiwJD1kMsuOYYb7b_yWUJGzAZmR7LKe5bL1R4WaocXuGKreBCgS11LdFU23as217kW2pz3468LLv3KkimXxj4Z431Hx1I8YUceYUpFVER09Q_SjmDul7KWGXsG-P9g1KUs7FP1kk1lNWfAVSxPiXWAIbleWd40gqsEQyzY8OmaWtjoXTjRW6BtafmkptBgSrkzOcKb2yiaj0s-WNBIuABGrcEL0SPHsJS9B15TdTtyc-8Ijepju5M7tBMdxQWDlSTtSuK9sYfLZ4hy79ZqV6LSC3vTM6gY_OapMbpnLr_vxcpxNLM6AdKhTSsELmwpCSniq4rOhy7VtlDNmMRjjEGLpXzUCRT1RKSctgreDhxi4zJ6ky_UqtE6LZYHI_0W-P&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=2NreMD6gxnYWbTv6Op%2FGPw%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nRequirements\nThis is a great opportunity to supplement your income while looking for longer or more full-time work, all while contributing to the development of new AI models using your domain expertise!\nOur client has hired over 1000 BT Talent and intends to hire hundreds more!\nYou’ll have the flexibility to work as much or as little as you choose - 20hrs/week is suggested, but not a limit. Start working in as little as 48 hours.\n\nWhat to expect: If qualified, you’ll complete an ID verification & be invited to complete a 30-minute technical interview, typically scheduled within 48 hours of being invited. The interview will consist of technicals, choosing from: JS, Java, C++, and Python. If you successfully pass the interview, you’ll be approved and able to begin work ASAP. Otherwise, the next step will be to complete an async rating & writing assessment.\nIn both scenarios, you will be compensated for successfully completing the assessment, up to $175.\n\nRequired qualifications:\nComplete fluency in the English language is required. You should be able to describe code and abstract information in a clear way.\nProficiency working with any of the the following:\nPython, Java, JavaScript / TypeScript, SQL, C/C++/C# and/or HTML\nPreferred qualifications:\nBachelor's and/or Master's degree in Computer Science or equivalent. Students are welcome.\nProficiency working with any of the the following (in addition to the languages above):\nSwift, Ruby, Rust, Go, NET, Matlab, PHP, HTML, DART, R, Apex, and Shell\nData Science experience\nNote: Scale AI is partnering with Remotasks for this opportunity\n\nWhat You’ll Be Working On\nOur client has partnered with organizations to train AI large language models, helping cutting-edge generative AI models write better code.\nExample projects might include:\nEvaluating the quality of AI-generated code, including human-readable summaries of your rationale\nSolve coding problems, writing functional and efficient code\nOptimize code to run at maximum efficiency\nWriting robust test cases to confirm code works efficiently and effectively\nWriting human-readable summaries of coding problems\nWriting explanations of how code can solve problems and evaluate various solution approaches\nNo previous experience with AI necessary! You will receive detailed instructions on what is expected of you after you complete the application and verification process."
  },
  {
    "Job ID": "4279994607",
    "Titlu Job": "Python Developer with Hardware Interest\nPython Developer with Hardware Interest with verification",
    "Companie": "Kambi",
    "Locatie": "Bucharest, Bucharest, Romania · 1 week ago · 55 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4279994607/?eBP=CwEAAAGYso0H5zRJqz8WR9-dajTzmKgMeyT-UvsyCIlPhbok1KPWDeasAQCTY3GEjxwl8s4JltuYCPb0RZtDH5rYQMGKjrhq-faZPwMkWBcdSjKUkflOECUZlY37uOG_GWx8gvLFK-SHHBC60KGf_3avyleLdL36RGdJy8Mrf5xktw-gyRX0dyj64B3KsSSVKxmBBxBRukRit-c0k1LV0VppJO01KU_BvUNt7ZfujlT_OynfnrMK5KVTtUpzmSlJ2Qd2l5LyqRRaaIg7SFeYmeEQk4lA-yjQBwx4B4B7t65NcecH4RTI9ltx_Cknk2SFN79AQyyqjqyfgNhJ7cEe-xeTXHTalrCqsM6FCE4gg6TlN-FLhRFmgWxbWIHKCO2F7cvt47cOZAZvFv0p9Pgu5tv6lbVIre1yzvWc9GPNYnHceFuCMgjKe0UZ9Sap4Nx6jhETU314LnlsUKE3zEKZv9Nc-zw1P2fRUQNRs3JpuqyfrokczQl6tx3Elq5wWzdsJ9SORrPCQnP9Qa_lkhQ7&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=gSqYuhX5UpTaYUmWiYR5Zg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nAbout Kambi\n\nKambi Group plc is a leading B2B provider of premium sports betting services to licensed gaming operators. Our services provide an end-to-end solution for operators wanting to launch a standalone Sportsbook or bolster their existing offering with an innovative sports betting product. From front-end user interface to customer intelligence, risk management and odds compiling, all built on our in-house developed software, we strive to deliver the ultimate service and solution to our partners.\n\nOur vision is to create the world’s leading sports betting experiences, together with our partners.\n\nWe’re looking for a Python developer who is passionate about working closely with the hardware stack, developing internal tools for hardware automation, and getting hands-on experience with the physical machines themselves.\n\nThe ideal candidate is someone who knows Python inside and out, has experience with Django and Supermicro automation tools, and has practical experience in a data center environment. You should be able to identify a SATA SSD and an NVME SSD at a glance.\n\nThe role and responsibility\n\n\nKambi have a large environment mostly based on Supermicro servers all over the globe and we always trying to take the next step towards a better zero touch deployment system, and this is where you come in to help us.\nYou will be part of the “F One” team, that is the team that focus on the stack from Data center to OS and you will be sitting together with both other developers and hardware focused engineers.\nA normal day you will be mostly focused on the development tasks in the current sprint, but you will likely also have to help with a support task during the day\nWe would like if you had the possibility to travel to our different data centers if needed and you will be part of our on-call rotation where we support the physical server platform in case of incidents.\nIf you are interested, please also share a link to a GitHub repo for a python project you have done and, if possible, a picture or description of your home-lab setup.\n\n\nIs Kambi a place for you?\n\nWe highly value soft skills such as collaboration, communication, and problem-solving abilities. You will thrive in this role if you are curious, enjoy technical discussions with your team and willing to collaborate to find the most suitable solution.\n\nWe offer friendly, welcoming, and inclusive working culture in an international work environment. We value learning and development, both on an individual level and as a whole organization. It is important for us that we grow together. We like to have fun with our colleagues, but we also understand that each employee needs their flexibility to thrive.\n\nAnd one last thing...\n\nWe want a balance between office work and working from home. We believe we will all gain from the best of both worlds, so the way of working in Kambi is hybrid – we want to have a chance to work with you in office 2 days in a week.\n\nWe would of course be trilled if you tick off all our boxes, yet we also believe it is just as important we tick off all of yours. And if you think you have most of what we are looking for, but not everything, go ahead and hit apply. We would still love to hear from you!\n\n#wearekambi\n\nKambi's ongoing commitment to Diversity and Inclusion in the workplace\n\nIf you require any reasonable adjustment during the recruitment process, please notify your recruiter, who will assist you however they can. Diversity and inclusion is at the heart of who we are and who we aim to be. While we are proud of the positive and inclusive company culture we have created, we know we can do so much more. Kambi constantly evolves its Diversity and Inclusion strategy to ensure it becomes an even more inclusive and positive place to work, with the core management team reaffirming its commitment to delivering on employee feedback.\n\nCreating an inclusive environment\n\nWe believe Kambi's greatest strength is the collective talent of our employees. Kambi is committed to ensuring we create an inclusive work environment where everyone can feel valued, thrive and achieve their potential, regardless of who they are or what their background is. We know that it is only by having a balance of different voices, values and opinions that Kambi is able to be the market leader it is today.\n\n#wearekambi"
  },
  {
    "Job ID": "4243810736",
    "Titlu Job": "Machine Learning Engineer\nMachine Learning Engineer with verification",
    "Companie": "SS&C Technologies",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 1 week ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4243810736/?eBP=CwEAAAGYso0H53ezIRz7UVk9zT-xu7Z-_XhB7JzIc8UnSfHlIfkCSo0g4i_ViqwbkT8Y82hNsx5KWlrgHA-RucrCOTkluU3bx6Dho9b_iejL-F5HjiCoY0bBbrt8OZ0uXvxttdySP1TqdluQfOUCQaHj8rQS5lQ49wOZUXckUpHA3fklujOYk-X5bPAPJDYs1BpdTf2j3r6e8rDfa94ILtcQl0cKYtsoqEZwDRUO_5Zb-HJrKyXHbzQ9ihm2Cl2mmCtpKJd7iIaXaqJGcC0BXkMezou6_p5rEoCJ4eZb-2mCrA1YXeTVszNytd0hhtqmTzgweQE814X_Wf12l6KHZ1ZFD8tg45-IgkZ-XE-ykbB_QtJyztzv6tDaE9zPmbblvZcS3IZcVlJ2trxbc3hTXtiRMVFzWyUdZPBjVRXhJ0q_tuQGSgqsBSDM4Wwtdp_HsV0fmdc8B-4dWgsuZIM3clUw8HrGngMp2mgH6wTKhlaWP_KMTjuh8qYAg0Vz75Vg8rP6AL7mHnxuDCGPcA&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=JahjMOEZ7ingKonWu1s3Mg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nAs a leading financial services and healthcare technology company based on revenue, SS&C is headquartered in Windsor, Connecticut, and has 27,000+ employees in 35 countries. Some 20,000 financial services and healthcare organizations, from the world's largest companies to small and mid-market firms, rely on SS&C for expertise, scale, and technology.\n\nJob Description\n\nRole Overview\n\nSS&C is seeking a Machine Learning Engineer to join its Innovation team, driving the exploration and application of advanced AI and ML technologies across our financial services product landscape. This role will focus on designing, building, and deploying intelligent systems that solve real-world problems across domains like Funds, Wealth, and Life & Pensions.\n\nAs part of the Innovation function, you will work closely with product managers, data scientists, software engineers, and business stakeholders to develop machine learning models, integrate them into scalable systems, and contribute to the evolution of SS&C’s next-generation product offerings.\n\nKey Responsibilities\n\nDevelop and deploy machine learning models and pipelines to support new product features or internal efficiency tools.\nCollaborate with data scientists to translate prototypes into production-ready systems.\nWork with engineering teams to integrate ML components into microservice-based architectures.\nOptimize model performance, retraining strategies, and monitoring in production.\nSupport research into emerging AI/ML methods, including NLP, generative AI, and time-series forecasting.\nEnsure models are robust, explainable, and compliant with industry and regulatory standards.\nMaintain documentation and contribute to knowledge sharing within the innovation and engineering community.\n\nRequired Skills & Experience\n\nProficiency in Python and popular ML libraries (e.g., scikit-learn, TensorFlow, PyTorch).\nSolid understanding of software engineering principles, APIs, and containerization (e.g., Docker, Kubernetes).\nExperience deploying ML models into production environments using MLOps tools and practices.\nStrong problem-solving skills and a collaborative mindset.\nExperience working with structured and unstructured financial datasets is a plus.\n\nPreferred Qualifications\n\nDegree in Computer Science, Engineering, Data Science, or related field.\nExperience in financial services, particularly asset management, funds, or wealth technology.\nExposure to cloud platforms (e.g., AWS SageMaker, Azure ML).\nFamiliarity with regulatory considerations around AI (e.g., explainability, fairness, GDPR).\n\nUnless explicitly requested or approached by SS&C Technologies, Inc. or any of its affiliated companies, the company will not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services.\n\nSS&C Technologies is an Equal Employment Opportunity employer and does not discriminate against any applicant for employment or employee on the basis of race, color, religious creed, gender, age, marital status, sexual orientation, national origin, disability, veteran status or any other classification protected by applicable discrimination laws."
  },
  {
    "Job ID": "4280981529",
    "Titlu Job": "Working Student - Digitalization and AI/ML\nWorking Student - Digitalization and AI/ML",
    "Companie": "Hipo.ro",
    "Locatie": "Ilfov, Romania · 1 week ago · 5 people clicked apply\nResponses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4280981529/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=LR041cOl%2FYd5SpzYlagppw%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Be an early applicant",
    "Descriere Job": "About the job\nThis job is sourced from a job board. Learn More\nA Snapshot of Your Day\n\nAre you a student passionate about technology and eager to explore the world of digitalization, Artificial Intelligence (AI), and Machine Learning (ML) in a business environment?\n\nJoin us as a Working Student and become an integral member of our digitalization team, working hands-on with innovative technologies and applying them to real-world business challenges. We are seeking a student currently pursuing a degree in Data Science, Statistics, Information Technology, Computer Science, Business Informatics, or a related field, who is enthusiastic about gaining practical experience on the finance side of the business.\n\nThis is a fantastic opportunity to learn, grow, and make an impact in a supportive and dynamic environment, helping us shape the future of finance through digital transformation. If you are a motivated student with a passion for data analytics, coding, AI/ML, and digitalization, we encourage you to apply and become part of our team!\n\nHow You'll Make An Impact\n\nAssist cross-functional teams with digitalization and automation initiatives, including supporting monitoring and basic data analysis.\nLearn and support the use of digital tools from the Siemens Energy technology portfolio (such as BI tools, ETL tools, workflow automation platforms).\nSupport the creation and updating of interactive dashboards to visualize results and track project performance.\nGain exposure to SE Finance data models and related ETL processes through guided tasks and learning opportunities.\nPrepare and organize data for AI/ML projects.\nTest and document AI/ML models under supervision.\nMonitor and summarize AI/ML project results to provide input for team discussions.\nPrepare basic reports or summaries of findings for internal stakeholders.\nDocument project progress and lessons learned.\nSupport the team by documenting workflows, steps, and processes, ensuring records are clear and up to date.\nAssist in creating internal guides, presentation materials, or summaries from workshops and knowledge-sharing sessions.\nHelp coordinate with internal teams by gathering feedback and sharing updates, under the guidance of the project team.\n\nWhat You Bring\n\nCurrently enrolled in a master's program in Data Science, Computer Science, Information Technology, Business Informatics or a related field.\nPrevious experience in internships or part-time roles related to data science, data analysis information technology, or automation is a plus.\nExperience working on academic or personal projects involving AI/ML, automation, or data related fields is a plus.\nParticipation in tech communities, hackathons, or relevant student organizations.\nBasic knowledge of programming languages such as Python, R, or similar.\nFamiliarity with automation, data analysis and business intelligence tools (e.g., Alteryx, Power BI, UiPath, etc.) and willingness to learn new tools.\nUnderstanding of ETL processes and data modeling concepts is a plus\nExposure to machine learning concepts, algorithms, and frameworks is desirable\nProficiency in MS365 Office Suite and Apps (Excel, Word, PowerPoint, Teams, SharePoint.).\nStructured and detail-oriented approach to documentation and process management\nDetail-oriented with a focus on accuracy and quality\nStrong analytical mindset with the ability to interpret data and generate actionable insights\nQuick learner, able to adapt to new tools, technologies, and processes efficiently\nGood communication skills in English\nProactive, self-motivated, and eager to contribute to team success\nCuriosity and passion for digitalization, automation, and AI/ML topics\nEagerness to learn and adapt in a dynamic work environment\nAvailability to work from our Bucharest office 3 days per week, with 2 days remote\n\nAbout The Team\n\nThe Project Entity team is responsible for world class execution and the successful delivery of complex projects across all Business Areas within Siemens Energy. We create and make use of synergies and high qualified competences across all Business Areas to deliver projects as One Siemens Energy.\n\nWith a strong focus on digitalization and productivity we deliver projects on time and in budget while driving project excellence standards, best practices and lessons learned across the organization.\n\nWho is Siemens Energy?\n\nAt Siemens Energy, we are more than just an energy technology company. With ~100,000 dedicated employees in more than 90 countries, we develop the energy systems of the future, ensuring that the growing energy demand of the global community is met reliably and sustainably. The technologies created in our research departments and factories drive the energy transition and provide the base for one sixth of the world's electricity generation.\n\nOur global team is committed to making sustainable, reliable, and affordable energy a reality by pushing the boundaries of what is possible. We uphold a 150-year legacy of innovation that encourages our search for people who will support our focus on decarbonization, new technologies, and energy transformation.\n\nFind out how you can make a difference at Siemens Energy: https://www.siemens-energy.com/employeevideo\n\nOur Office\n\nSiemens Energy's location in One Cotroceni Park is more than just an office space - it's a hub for a vibrant and thriving community. Nestled in the heart of Bucharest, this urban development is the perfect place to work, surrounded by green spaces, shopping destinations, and everything the city center has to offer. And with the Academia Militara subway station just a 3-minute walk away, getting around the city has never been easier.\n\nOur Commitment to Diversity\n\nLucky for us, we are not all the same. Through diversity we generate power. We run on inclusion and our combined creative energy is fueled by over 130 nationalities. Siemens Energy celebrates character ??? no matter what ethnic background, gender, age, religion, identity, or disability. We energize society, all of society, and we do not discriminate based on our differences.\n\nRewards/Benefits\n\nYour lunch with SE meal tickets.\nKeep your brain fit with our trainings.\nSpecial for books lovers ??? Bookstore.\nStay safe and healthy with our medical subscription.\nThink about your future too with Privat Pension Pilon III.\nTake care of yourself with our Wellbeing Initiatives.\n\nJobs & Careers\n\nsiemens, .siemens li {line-height: 20px !important;} .siemens p {line-height: 20px !important;margin-left:0px !important;}"
  },
  {
    "Job ID": "4266381606",
    "Titlu Job": "Student Internship - Embedded Software for Connectivity\nStudent Internship - Embedded Software for Connectivity with verification",
    "Companie": "NXP Semiconductors",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 1 week ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4266381606/?eBP=CwEAAAGYso0H58TOg8V4Lc0ZVz8Z3DR2goT2oaAxP61nUBRNU1TrKwcXfI0UcPxrj96ZpS8nvPoe5vOrm5C-dmYnSJ_2H42maXZK8GhPFxnpblReiuS4EMlMReqLO1P5TrxFr8SvPIYdz6Xdj38G_VMEhp6cZUGF5t9mYlxN5W0rjwiG4MpgGUFynZw4g2JW0JMZnEpoU1WtJmEw5vKLSvxsr0zWB2s0pfDgrJnQyKVZfTf5o0Fxj8FN5Me7uugEgn9nPPJ0WLXkzWNXg_SRvRHEsp9ZUkS3kdOye6XPBk9tHMwwbUgbFLkylVhvVHqxwYEMliYR79m2sYMiXIGGksuup4iEwr08ZYffuAf5Cpr0mK4QupV-3-i6bJ26RSS_cLyVP_UyXy8yaCpv77NgytdZQSQDrlSdDXG-OdvqGn2_MnLpyauKDZ1jNWJ-hGhufgbrJ2Uk_xCNMxX7LeFuDU61HS1CsrDtlk53RQa5aQxEO_FG6zO5hIEVMJ5o8JvZUBYPCO_G0crWE-7l3w&refId=fIW5wQ0Qza%2FQVI%2F3XYd0fg%3D%3D&trackingId=%2BqplsfJhKD7QYNIUA8VSnw%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nOur Software R&D team focuses on low-power, cost-effective wireless solutions addressing many monitoring and control applications for the Internet of Things—including consumer, smart energy, industrial and healthcare.\n\nYour profile\n\nTo Be Successful In This Role You Have\n\nStudent attending Computer Science, Electronics/Telecomm or Informatics faculty.\nSmart, proactive and willing to learn new technologies (both hardware and software) in a world-class engineering environment.\nKnowledge of C/C++ programming language\nFamiliarity with networking fundamentals\nFamiliarity with key aspects of Real Time Operating Systems (multi-tasking, multi-threading)\nFamiliarity with processor architectures\nFluent English read/write/speak capability \n\nFurthermore, You Have\n\nA passion for innovation and a willingness to constantly challenge the status quo.\nGood spirit of teamwork. \n\nCreating Secure Connections and Infrastructure for a Smarter World\n\nNXP Semiconductors N.V. (NASDAQ: NXPI) makes products and environments safer, more sustainable, and more secure with innovative connectivity and edge processing solutions for a smarter world.\n\nWe are in the business of better. Not just better technologies, but better innovations to improve society. As the world leader in secure connectivity and processing solutions for embedded applications, NXP is solving the world’s most complex technology challenges to accelerate business innovation, enhance how we work, and advance how we live.\n\nReady to create a smarter world? Visit our career website and follow us on social: LinkedIn, Facebook and Twitter.\n\nWhat Can You Expect\n\nContract: 1 year contract, with the possibility of part time working\n\nCompensation: Besides a good salary, you will receive lunch vouchers, 25 vacation days, medical subscription or trainings. We also have flexible work hours and a work from home policy.\n\nDevelopment opportunities: We believe that a key component to growing our business is to develop our people. To enable you to grow your career at NXP, we offer online and offline learning opportunities to help you develop some of your core and professional skills.\n\nOur office: We are based in one of the high tech hubs in Bucharest with easy access to public transport and restaurants and parks close by. We have many relaxation areas on-site, including a little library where you can borrow books, sofas to relax in a quiet place and a cafeteria and restaurant in our common area.\n\nHiring process: Applying only takes a minute! Fill in the online application and share your CV with us. After a positive screening based on your CV you will have an initial phone or video conversation with our Talent Acquisition Consultant followed by several business interviews. Here are some useful tips to help you prepare.\n\nAnd more: Life at NXP is more than work alone. We like to start our day with a free coffee and chat with a colleague and on Thursdays we have fresh fruits for all employees. Join us at one of the many social activities that are organized by and for employees such as our Christmas parties, our employee children’s party and food fairs. Or help us give back to society by donating blood or collecting clothes and food for children in need.\n\nPlease note: The successful candidate may/will be responsible for security related tasks. The assignment may/will be in scope of security certifications, therefore a conscious and reliable way of working is necessary.\n\nMore information about NXP in Romania..."
  },
  {
    "Job ID": "4119302309",
    "Titlu Job": "Student Intern - Hybrid\nStudent Intern - Hybrid with verification",
    "Companie": "SLB",
    "Locatie": "Bucharest Metropolitan Area · Reposted 1 week ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4119302309/?eBP=CwEAAAGYso0L7zZdRYPjB7MLEMuRQLc_MJ3T6nAidOOANqH6hHhSMCEVndlDDxjuDR2ArsQvciDl0QpXbdVt4YcDmQUbv-fDcrc9Ezj0SouH47sUfowEmvjR-xxDHljs3XMJVmgzdFhoKubTDKBd_dAKdL9TUqiR39rktNPs55kXfq7n7wsnoRPBYdJHwmwDWEsOK0MNG4OC3GwRb4VqfxC-PXiCZ6b9WU33A5xqiDLjzBAxw-oySPEN37A67vQWmsOjo1AfOps804XvXX2dgaAcmhrWxANDAtmfx4_cdwurlfVoXwTA5Ve4ZkqJRXlUbSBzm5sMBYHuYkSrD4OAMulJfEjmsd2XjPsmBhV4K5ZlpgLxcyx0NvjB5B2b65Hc-0T5tqUFBCUyZDCYN6eNXa2cua6aBcpDTTkLMdlEErDP7W0GCAUTH1r9rpwMRuMhYP4gDEdTSL_R9obfnVOunw2cRe5EpCK6CDYN66aBIe0EtM7LK1trhzA66rz0ZG5UD9qrPjCxzP6P&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=R8twWMyV0tp8W4dE8ELmmg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nAbout SLB\n\nWe are a global technology company, driving energy innovation for a balanced planet.\n\nTogether, we create amazing technology that unlocks access to energy for the benefit of all.\n\nAt SLB, we recognize that our innovation, creativity, and success stem from our differences. We actively recruit people with a diverse range of backgrounds and cultivate a culture of inclusion that unlocks the benefits of our diversity. We want to ensure that everyone feels a sense of belonging here and we encourage, enable, and empower our people to foster inclusivity, build trust, and demonstrate respect for all across the organization.\n\nGlobal in outlook, local in practice – and with a united, shared passion for discovering solutions, we hire talented, driven people and support them to succeed, personally and professionally.\n\nWhat are we looking for?\n\nTo summarize with one sentence: We are looking for high potential students or fresh graduates who have the strong desire to move things ahead in a dynamic work environment.\n\nYou can be part of a dynamic team, the opportunities range from Finance and Digital to Legal, Human Resources and Supply Chain.\n\nFinance Internship\n\nThe internship opportunities are in the following departments: Accounts Payable, General Accounting, Statutory & Tax, Financial Analyst, Project Accounting, Management Accounting, Cost Accounting and Treasury.\n\nYour responsibilities can range from:\nAP invoice processing.\nReconciliation processes until calculating costs.\nExtracting data from Excel and other platforms and making reports.\nReview data about material assets, net worth, liabilities, capital stock, surplus, income, or expenditures.\nAnalyze business operations, trends, costs, revenues, financial commitments, and obligations to project future revenues and expenses.\n\nSupply Chain Internship\n\nThe internship opportunities are in the following departments: Logistics, Procurement & Sourcing, Purchasing, Expediting, Sourcing, Customer Service.\n\nYour responsibilities can range from:\nAccepting request from customers.\nProcessing the orders.\nHelping in planning shipments.\nTracking orders.\n\nDigital Internship\n\nYour responsibilities can range from:\nThe IT Analyst should be a customer oriented as they will be the first point of contact for our internal users that will be seeking for support.\nProvide technical support in the area of expertise.\nSustaining on internal platforms.\nWill be involved on some projects (day-to-day work) - implementation, development, automation.\n\nLegal Internship\n\nThe LSC scope of work covers contracts review and drafting (both customer and supplier contracts) as well as general legal support, including implementation of the company’s ethics and compliance program, legal knowledge management, disputes and litigation, and corporate legal tasks.\n\nHuman Resources Internship\n\nYour responsibilities can range from:\nReview, approval and administration of Benefits and Relocation Expense Reports.\nMonthly expat costs reporting.\nHousing Invoices – SAP request to send for payment, track and capture in reports.\nAdministrate schooling contracts.\nHR Support to – Expats, Schooling third parties, Housing third parties.\n\n\nYou will be integrated into a multifunctional team from your very first day on the job and work on multiple projects.\n\nA mentor, manager or team leader with technical mastery in your area of study will give you best assistance, guiding you through your period of practical training with experience and advice.\n\n\nWhat we offer\n\nWork from home allowance.\nWe work hybrid, 2 days at the office and 3 days at home.\nMeal tickets.\nPrivate medical subscription - GOLD package.\nLife insurance.\nCompany events, great office location.\n\n\nAdditional benefits\n\nOther discounts for your well-being.\nA culture that fosters inclusion, diversity, and innovation.\nMarket-specific training and ongoing personal development.\nCareer growth opportunities both national and international.\nExperienced leaders to support your professional development.\nInternational work environment.\nLearning-based platforms that allow you to study at your own pace.\nWe encourage our students to take all their exams and we are flexible with their working hours during the exams period.\nWe use latest technologies and we offer support and training to learn SAP.\nWe encourage our colleagues to apply their knowledge gained in the Universities and we assist our all our new colleagues to learn on the job.\nWe offer the possibility to become a permanent employee.\n\n\n\nSLB is an equal opportunity employer. Qualified applicants are considered without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or veteran status."
  },
  {
    "Job ID": "4283180743",
    "Titlu Job": "Predictive Modelling Analyst\nPredictive Modelling Analyst with verification",
    "Companie": "Allianz Services",
    "Locatie": "Bucharest, Bucharest, Romania · 4 days ago · 20 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4283180743/?eBP=CwEAAAGYso0L77__F4U2BGwDZRv2aUvqcdplA4yNNEkfz_k8lrmQw1MGzCeVUB8RIxCiwdN6ovbEK75bDJVJGoTWBpVbsuCBu1_OLGjKBIMi_NR1L5l6AhG8sZDfhPDd7SMkXYh2SPC63CkF6_seQ2IXN50s2IM6U0jtsdpRwv0GqqksnoWf6dKVXMQQoqqAm0S3G2u2mT3jNuOS8yiwCPmB3cPk8qVha8SomJ-xwzQar8ptPwT0i0Fy2lWAnUygZg6caNv_ZBJHFOVmQXhbBYfdqAbL8mgbjvHiuBERONsirsVxDjhXLgotwj1BOVkfOP7my7Lf4ZRPhRyvXcYx5Pox3l0JyiXi_H43ZNAwPrLh5hl1OQ9aW8P__8lEscdNXbnzd_4kmN9pU3ZF5SOUijV2ybx2FAMvhqpd7Dj31CfRJaMzBpa6UJ_gxv6xljaXkwdE1rc_UW2qidTO06IjwoLzR3ZbNhCfap8ZTDJ3XabYO41mLKmuY9L-mb_6jxX9P-uoiLO6QZWzUtc&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=PoNSeKCYpCWk8uQFAcfcgg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted; Be an early applicant",
    "Descriere Job": "About the job\nAllianz Services is proud to serve and be part of Allianz Group, one of the world's leading insurers and asset managers. Our global footprint, with more than 7,300 employees located across ten countries and four continents, enables us to unlock value for our partners across the insurance value chain and deliver superior client experience within Allianz Group. At Allianz Services, we have a strong specialization in core insurance operations, shared services, business analytics, engineering, and management consulting. Our people and our trusted relationships with partners are what matter most. These are rooted in our values of compassion, integrity, and expertise and we strive to continuously evolve, improve, and deliver excellence while contributing successfully to the transformation of Allianz. Caring actively for the environment, for people, and for our customers is what makes us a great place to work and together we are shaping a better and more caring tomorrow.\n\nAllianz Services is a company which belongs to the legal entity, Allianz Technology SE.\n\nJob Role\n\nOur Global Pricing Analytics team is seeking a Predictive Modelling / Data Science Analyst to build strong data driven pricing models for all Lines of Business across Allianz Commercial. This person will need to collaborate internationally with various stakeholders, both within Global Pricing and across other Allianz Commercial functions. Furthermore, this individual will support strategic Allianz Commercial projects, such as developing and driving data driven approaches to portfolio management.\n\nThe Pricing Analytics team is part of the Global Pricing department at Allianz Commercial and is responsible for driving the use of Predictive Analytics within Pricing across Allianz Commercial globally. You will join an international department located across London, Munich, Bucharest, Chicago and New York.\n\nWhat Will You Do\n\nApply statistical and data science techniques to support the development of predictive pricing models across a variety of business lines at Allianz Commercial\nPresent and communicate modelling results and recommendations to internal stakeholders\nHelp to improve the overall technical analytics capabilities of the Pricing Analytics team\nDevelop a strong knowledge of the company’s data and data systems\nWork as part of a project team to drive forward the development of models \n\nWhat You Bring\n\nAdvanced degree in a quantitative field desirable, preferably with significant emphasis on statistical modelling or machine learning, e.g. Statistics, Data Science, Machine Learning, Computer Science or a related field\n1-3 years’ experience working in an actuarial/technical role within the insurance industry desirable\nKnowledge of P&C insurance and pricing techniques\nTrainee P&C Actuary desirable \n\nYou have\n\nUnderstanding of a wide range of classical and modern statistical and machine learning methods such as GLMs, decision trees, ensemble and regularization techniques etc. Experience with Bayesian approaches desirable\nExperience building and validating models using statistical software (Python, R, Emblem, SAS etc.)\nAbility to work efficiently and effectively with large data sets from a variety of sources, including both internal and external data.\nStrong SQL programming skills required\nExperience with version control tools such as GIT desirable\nAbility to effectively interpret data and modelling results, and to then communicate them to audiences with differing levels of technical understanding\nAbility to express ideas and messages clearly, both written and verbally\nOrganised, self-motivated, results-oriented, collaborative and very resourceful\nExperience of working with colleagues located in different countries desirable\nCommitted to personal development and passionate about continually learning new technical skills \n\nWhat We Offer\n\nWe support your well-being \n\nWe foster an inclusive and healthy workplace with a flexible hybrid working model:\n\nExperience access to counseling services, mental health resources, and well-being sessions designed to keep you feeling your best \nEnjoy a monthly budget via the Benefit platform, for personalized benefits packages, including comprehensive medical subscriptions, meal tickets, private pensions plans, life insurance, Allianz Tiriac insurance discounts, and many more. \nPrioritize what truly matters with time off for your birthday, extra days off for each year in Allianz (up to 5), days off for legal holidays that fall on weekends, as well as 24th and 31st of December, plus special allowances to support diverse life events. \n\nWe invest in your growth \n\nBenefit from an extensive learning curriculum designed to support your career advancement and meet your professional needs, with access to technical and soft-skills trainings, international certifications (Agile, Lean Six Sigma, Prince, ITIL, IFOA, ACCA, IACCM and more), learning resources from LinkedIn and Allianz platforms, opportunities to advance your languages skills(German, French, English) and elevate with our leadership Program.\n\nWe value you and your work \n\nWe acknowledge and recognize your work through performance based-rewards to celebrate your achievements, team and individual recognition programs to celebrate your contributions and internal referral bonuses.\n\nYour personal information, including sensitive data, may be shared with Hiring Managers to assess your suitability as a candidate. Only suitable candidates will be contacted, and all applications are confidential. Allianz Group, a trusted global insurance and asset management company, values employee ambitions and challenges, fostering an empowering environment. We are committed to diversity and inclusion, welcoming applications from all backgrounds, regardless of ethnicity, age, gender, nationality, religion, disability, or sexual orientation. Allianz is an equal opportunity employer, encouraging you to bring your whole self to work."
  },
  {
    "Job ID": "4281373559",
    "Titlu Job": "[Internship] AI Engineering for FOTA Debugging (F/M)\n[Internship] AI Engineering for FOTA Debugging (F/M) with verification",
    "Companie": "Renault Group",
    "Locatie": "Bucharest, Bucharest, Romania · 1 week ago · 62 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4281373559/?eBP=CwEAAAGYso0L7y8-w6K-t-8LWwLqOy78Ge2xsY_QC4vF_3S4fqKrT0L-fkDzrLD8tIAOLEiHJv3moXHndETimoYGeEvSnoNCa2QUVzQTR7m3Om5YBDl0dVRrJYiGp2F7nzHQTxCiVcceQxlSfeaRYO49BDqfwBw51IiX4DpEZASn8gFx6hvot_E-Gv64CLUYj6LvCk3Y-dHdgfJtI-aZ20JMEGLh9f_be-jHbNIWL8G948MjeROgGMYywOQT_F6IitSdUhOCcMN-eBfIdCpYaiNRjH5NLWAPT8xz1Q-Xbl50Vk9pFE-7sO450LuL8_RcJHZLeuTUUsyz8KXHO1lnf-nq34cD6tTxPXFg2VWxk9kxDE11q7TP1xWnqvtytF8snirJU3ObOrUAeTxjjoT6kVYEeKkQdYFuDlbDTUREFxJgEdJmrTfMDXDdByNFovV858lNmwFprUhU2j2YxDeLUhL6n249zzUthvMaoxZ7Xj9cpnHYWjr1ZlWPJ-yxSQe9X_5u0udB9KCgGN4&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=kohxL66D1mzFGdvkOSwdAA%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nPosition: AI Engineering Intern – Retrieval-Augmented Generation (RAG) for FOTA Debugging \n\nDe ce să te alături companiei noastre?\n\nEşti gata să îți construiești o carieră în dezvoltarea de software auto? Alătură-te echipei noastre și fii o forță motrice a următoarelor generații de modele Dacia și Renault. Urmează-ți pasiunea pentru inovație!\n\nÎn direcția RTR Romania Systems & Software livrăm Sisteme de ultimă generație, rentabile și de cea mai înaltă calitate pentru clienții noștri, beneficiind de o expertiză competitivă în inginerie la nivel global.\n\nEchipele noastre sunt esențiale în dezvoltarea platformelor revoluționare SWEET (Software Electric Electronic Technology) și CCS (Connected Car and Services), punând în aplicare viziunile noastre ambițioase de produs.\n\nDe la stăpânirea principiilor de Inginerie a Sistemelor la crearea componentelor electrice complexe și a computerelor vehiculelor (ECU-uri), suntem implicați în fiecare etapă a dezvoltării.\n\nFie că este vorba despre îmbunătățirea caracteristicilor de siguranță cu ajutorul unui avansat Calculator Front Camera sau despre pionieratul ecranelor multimedia și a sistemelor de conectivitate la bord, noi modelăm viitorul tehnologiei auto.\n\nRolul de Tech Lead FOTA ( FOTA= Firmware Over The Air ) are ca scop gestionarea funcţionalităţii FOTA via exigenţe şi specificaţii tehnice din cadrul proiectului FOTA.\n\nProject Overview\n\nYou will contribute to the development of an AI-powered assistant designed to support FOTA (Firmware Over-the-Air) system debugging. The assistant will leverage Retrieval-Augmented Generation (RAG) techniques using Google Cloud’s Vertex AI to provide technical leads with fast, relevant insights from a large corpus of logs, bug reports, and documentation.\n\nKey Responsibilities\n\n Ingest and preprocess structured and unstructured data (logs, reports, documentation). - Use Vertex AI’s embedding models to vectorize and index knowledge base content. - Implement and evaluate retrieval pipelines using Vertex AI Matching Engine. - Design and test prompt templates for LLM-based generation. - Collaborate with FOTA experts to refine use cases and evaluate system performance. - Optionally, develop a simple user interface (chatbot or dashboard) for internal use.\n\nWhat You’ll Learn\n\n Hands-on experience with Vertex AI, LLMs, and vector databases. - Practical application of RAG in a real-world industrial context. - Exposure to FOTA systems and embedded software debugging workflows. - Agile development practices and collaboration with cross-functional teams.\n\nCandidate Profile\n\n Final-year engineering student in Computer Science or related field. - Strong Python skills; familiarity with cloud platforms (GCP preferred). - Interest in NLP, machine learning, or software debugging. - Bonus: experience with LangChain, Streamlit, or REST APIs\n\nToate candidaturile vor fi luate în considerare indiferent de rasă, cetățenie, etnie, culoare, limbă, religie, origine socială, trăsături genetice, sex, orientare sexuală, vârstă, handicap, boală cronică necontagioasă, infectare cu HIV, opțiune politică, situație sau responsabilitate familială, apartenență ori activitate sindicală, apartenență la o categorie defavorizată"
  },
  {
    "Job ID": "4280352700",
    "Titlu Job": "Data Engineer\nData Engineer with verification",
    "Companie": "Patrianna",
    "Locatie": "Romania · Reposted 1 week ago · 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4280352700/?eBP=CwEAAAGYso0L70fQ7klwpSqwaCVjuQ91tTT5SAFHmyLY0_NqFgdo9_NoN53Xc3gdYGuLEGB1V43PUYnSZhsaT7WVwhxmvCf2NT9vvJoTYrpcY0U7sle4LLa9O5IKsjIXP8ujE31seIhDOOqhidJ8R2URgV-g_x7t5KQIpbP65yP4DRVdmHNHogUpPyKpwswVdujG6tDMXkWxR-nzop_C8L97i3yS0Vx1DLEy-EOnUWqbX6Zmy0WOldPHP4lJHeJ_a7RBst1HMixEwu8iggO3Id4AJRxOzrN18d9pcI5Y-g5qMr2hv_oDgJ_mJgtjfBs0HVpiOrN6vgFFg2muIP9VFCGuGR7coFstlHiWaTxRYPuYRXe26bWczKylq5dYDE1GMrmLH8tYlSSPkdmlIBl2xiJLndD4WdECdnDAiKxlyge0_FW-FRwaDn6mq0w_zGn9-T6pbcDXpjvZ7cSScHhg5PZVx4Z5mQnp20UPN0XmPrQOYYlSG3wXdiILqeMuzOZAj1Hcs4Gfm0Zh&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=rPCBS3jxmO6wXqlZA2tSxA%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nPatrianna is a rapidly expanding product development company headquartered in Gibraltar, with a dynamic team spanning the globe. We are on the lookout for exceptional talent-driven, ambitious individuals who are ready to elevate business functions with expertise, adaptability, and a passion for continuous growth.\n\nWe’re looking for a skilled Data Engineer to design, build, and manage advanced data systems that convert raw data into actionable insights. You will collaborate across data, IT, and business teams to implement scalable architecture and robust pipelines using modern cloud and data engineering best practices, primarily within Google Cloud Platform (GCP).\n\nKey Responsibilities\n\nData Pipeline Development\n\nDevelop and maintain scalable, automated data pipelines using CI/CD practices.\nLeverage Dataform to manage transformation workflows directly in BigQuery.\nImplement end-to-end pipeline deployment with CI/CD tools in the GCP ecosystem.\n\nAPI Integration\n\nDesign and implement APIs for ingesting external data into the Data Warehouse.\nEnsure reliable, secure data flow across internal systems and third-party sources.\n\nData Modeling\n\nBuild optimized data models to enhance query performance and system integration.\nAlign models with tools like BigQuery and Datastream for efficient storage and processing.\n\nETL / Reverse ETL\n\nCreate and manage ETL and reverse ETL pipelines using Google Dataflow or other tools.\nEnsure clean, high-quality data movement and transformation.\n\nData Quality & Compliance\n\nImplement monitoring to ensure data accuracy, consistency, and integrity.\nMaintain compliance with data privacy regulations (e.g., GDPR, CCPA) and industry standards.\n\nRequired Qualifications\n\nBachelor’s degree in Computer Science, Data Science, Information Systems, or a related field.\n\nStrong experience in:\n\nGCP tools and services (especially BigQuery, Dataform, Dataflow)\nAPI development\nETL and reverse ETL processes\nData modeling\nCI/CD methodologies\nFamiliarity with data governance and compliance practices.\n\nPreferred Skills\n\nGoogle Cloud certifications (e.g., Professional Data Engineer, Cloud Architect).\nStrong communication and cross-functional collaboration skills.\nFamiliarity with modern data stack and orchestration tools."
  },
  {
    "Job ID": "4206794069",
    "Titlu Job": "Opportunities at Concentrix Romania\nOpportunities at Concentrix Romania with verification",
    "Companie": "Concentrix",
    "Locatie": "Timişoara, Timiş, Romania · Reposted 2 weeks ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4206794069/?eBP=CwEAAAGYso0L77XfrzHYcTazi6bIGpqIKgGtZicsWmLB8OfWNY0qxKApnLrtc_Ggo0DZdOsjw2U0lYXi2-NvexqaFAhQQXiHef9_rpJyNO4vjYEP0LZUf7vpuFJMjTKtxPNlh4qQccZ4FdQFL3GDhkfHwwbuuy1fKdqTkzpX8Z1-MItRtgmtPoOVUrHTV034-lQhz8YneBJEzFUBPCKHihjiVqiMYlAJYygseEwBv12Zvmc82aX-NX9l6XLqAp1efuzAOGT5QrmnNdyr17Icrz56NSQM11YKKOjVooe-UDzgEgk5QJvANw_ZbJQpCggmK-ArMeLvh_4o9oX8BSeza14XSIXyTfxMoDRA3BIdFZjXqzWVGr2sWT5EIXvv6CRJ8-rwNgrheRUWiQNRN73ICS3jFiqE51uvxKh3k_eRQYPOmq__TDKUIJJzzceBnugD676Ld9YVCwRQ3CL4cvF8jKBx48nWcaq90m4bOXwgZO7RTEBnUNXjE4WAnDPxOwLYI3GleSP02A&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=NpBbw9YWxFqrBK%2FgxEaBxw%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nJob Title:\n\nOpportunities at Concentrix Romania\n\nJob Description\n\nAre you passionate about languages? We may have what you are looking for!\n\nConcentrix offers you a big variety of opportunities within our amazing team!\n\nDue to our incredible growth, we’re looking for our new superstar colleagues to join our lively, fun-loving team in Romania to support us in providing exceptional experiences for some of the world’s biggest and most well-known brands.\n\nWe have lots of opportunities across our multiple clients and campaigns:\n\nAt various levels in the areas of Content Moderation, Customer Service, Technical Support and Sales\nWith various languages: German, French, Italian, Spanish, Portuguese, Polish, Dutch, Czech, Hungarian, Swedish, Norwegian, Finish and many more.\nWorking hours flexibility - full-time and part-time opportunities\n2 sites based in Romania – Timisoara & Cluj-Napoca - as well as opportunities for work from home, to achieve a great work-life balance\n\nCustomer Care Opportunities:\n\nOur Customer Care teams are responsible for providing exceptional customer experiences via various channels – this could be supporting customers with anything from booking a fantastic holiday to arrange returns for that new pair of sneakers.\n\nContent Moderation Opportunities:\n\nAlong with our Content Moderation teams, we work with some of the worlds’ biggest online platforms and help them ensure a safe place for their communities.\n\nTechnical Support Opportunities:\n\nOur Technical Specialists help clients resolve any and all technical issues they might have. If you have a problem-solving mindset, then this could be the job for you!\n\nSales Opportunities:\n\nAs Sales Experts, our teams work along with our fantastic clients to drive sales, overall business growth and strong partner-client relationships.\n\nAt Concentrix you will not only find a job, but a career with future!\n\nWe offer:\n\nCompetitive remuneration with Reward and Recognition programs;\nComprehensive initial training and onboarding;\nConstant support from your colleagues with coaching and mentoring opportunities;\nProfessional Development and Career Navigation programs to map out the steps in your development;\nHealth and Wellbeing initiatives;\nPart of the additional benefits are Health and Life Insurance, Multisport card, Transport allowance, Bonus for important life events, Corporate discounts and many more.\n\nApply now and one of our Talent Acquisition Specialists will be in contact to discuss the best opportunities for you!\n\nAbout us:\n\nWith 280,000 colleagues all over the world, we specialize in creating exceptional customer experiences and driving digital transformation for some of the world’s biggest and best companies.\n\nWe’re fanatical about our diverse and passionate people all across the world. We embrace all our different cultures, individualities, and personalities because we recognize that all our differences make us stronger together. Concentrix is an equal opportunity employer, and we process applicants without regard to disability, race, color, religion, gender, national origin, age, sexual orientation, gender identity or expression or any other characteristic.\n\nWe show our colleagues how important they are by showering them with perks, like a culture of belonging; clear paths for career development; professional support, coaching and mentorship programs; performance-based pay; a global network of lifelong friends and peers; and more! (Like, lots more.)\n\nLocation:\n\nRomania, Timișoara - UBC\n\nLanguage Requirements:\n\nTime Type:\n\nIf you are a California resident, by submitting your information, you acknowledge that you have read and have access to the Job Applicant Privacy Notice for California Residents\n\nR1561343"
  },
  {
    "Job ID": "4178629311",
    "Titlu Job": "Radio Navigation Engineer\nRadio Navigation Engineer with verification",
    "Companie": "GMV",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 1 week ago · Over 100 applicants\nPromoted by hirer · No response insights available yet",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4178629311/?eBP=CwEAAAGYso0L78O2MGhCWUeYKWbCGOqB1xtDO96xv3mg-AqK3TcDkZEs0daMLWZg8xXZCWlIikMUYp3omDSrWcpQvP_GZUp8x9Lm73QxvkhkqZx65vLmDvt9sz2qDHRGanigWk-offBnTSNeLVCZ7PAvliP3PAQHZ0sQI7gkBhu83UNgYvVf3xVrJwkNIzOCUZV3LX5e6pALYfFZbxTn7UbR2_ysWTlsy8hZyICPB8V3tL4IAyAg2P30eCudcty4lFK5-Y6UwOYuLPbz-uUO11Byg9KjcCskFaTeE7yVpnbPpKwWoWfUU2u0DhOeS1AMAo0OUQctM6_SWnHFv8QAbCm-zSiirDYuSMaW8cftxse7buiIT96oMJyjJhNCSJoUmzptdPa4kcQaNokuAUe8jV7iXjAG_q8BqWopt2eSKUai5T4nB_HGTQSPxaZWLicCkUrwqS8eDNxAFncJtT_CsfzyNiqxJZmSiWIKXQyXUryFjt6gSm4XqKoPlFbLk9BZM5Fu2sjmWQ&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=67lUOSIH70M%2BUzs%2FLVhhLA%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nIf the expression “Houston, we have a problem” gives you chill bumps... Your place is here!\n\nWe are expanding our teams in the Aerospace Sector to take on various projects related to satellite navigation (GNSS), alternative navigation, navigation resilience, privacy protection, and many more.\n\nWe like to get straight to the point—we'll tell you what you won’t find online. If you want to know more about us, visit the GMV website.\n\nWHAT CHALLENGE WILL YOU BE TAKING ON?\n\nAs part of a multidisciplinary and international team, you will have the opportunity to work on cutting-edge technology projects related to satellite-based applications.\n\nYou will contribute to the development of new technologies to provide robust and resilient Positioning, Navigation, and Timing (PNT) solutions, protecting critical systems against threats such as jamming and spoofing, which are becoming increasingly relevant in today's context.\n\nWHAT DO WE NEED IN OUR TEAM?\n\nWe are looking for electronic, industrial, and telecommunications engineers, or professionals from related fields, who have background, interest, and passion for areas such as signal processing, telecommunications, satellite navigation, algorithms, SDR (Software-Defined Radio) development, or Python.\n\nWe also value previous experience and knowledge in specific navigation topics (e.g., error sources, robustness, interference), GNU Radio, LabVIEW, Simulink, MATLAB/GNU Octave, Unix/Linux, and Cloud/IoT concepts.\n\nWHAT DO WE OFFER?\n\n🕑 Hybrid working model and 8 weeks per year of teleworking outside your usual geographical area.\n\n💻 Flexible start and finish times.\n\n🚀 Personalized career plan development, training and language learning support.\n\n🌍 National and international mobility. Do you come from another country? We can offer you a relocation package.\n\n💰 Competitive compensation with ongoing reviews, flexible compensation and discount on brands.\n\n💪Wellbeing program: Health, dental and accident insurance; free fruit and coffee, physical, mental and financialhealth training, and much more!\n\n⚠️ In our recruitment processes you will always have telephone and personal contact, face-to-face or online, with our talent acquisition team. In addition, bank transfers and bank cards will never be requested. If you are contacted through any other process, please write to our team at privacy@gmv.com\n\n❤️We promote equal opportunities in recruitment, and we are committed to inclusion and diversity.\n\nWHAT ARE YOU WAITING FOR? JOIN US\n\nIf you have any questions please do not hesitate to contact Diego Hernandez Rojo, in charge of this vacancy.\n\nDiego Hernandez Rojo"
  },
  {
    "Job ID": "4264119338",
    "Titlu Job": "Prompt Engineer\nPrompt Engineer",
    "Companie": "CREATEQ",
    "Locatie": "Iaşi, Iaşi, Romania · 1 month ago · Over 100 applicants\nNo response insights available yet",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4264119338/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=%2FAIMS3tmNpqtSHpEjoVpvg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply",
    "Descriere Job": "About the job\nThis project introduces an advanced self-service chatbot application specifically designed for the airline industry. The solution aims to significantly enhance the customer experience by providing immediate and efficient support for various flight-related inquiries.\n\nThe application is built on robust and scalable architecture, leveraging modern cloud-native technologies:\n\nBackend is developed using a .NET Core microservices architecture. This approach ensures scalability, resilience, and independent deployment of individual services\nFrontend & Conversation Flow are powered by the Cognigy AI platform. Cognigy is a leading framework for developing sophisticated conversational (chat) flows, enabling intuitive and effective customer interactions\n\nJob Responsibilities\n\nFollowing and applying the latest practices in AI app development (LLM prompting, RAG, Agentic AI, multi-agent architectures, MCP, and A2A protocols...)\nStay updated on industry trends and tools to improve prompt engineering techniques continuously\nExperiment with prompt structures to enhance model accuracy and ensure responses align with business objectives\nMigrating NLU-based solution (user intent-based chatbot app) to agentic architecture\nCollaborate with business analysts, software developers, data scientists, UX designers, quality assurance\nGenerative AI understanding, developing conversational AI agents and flows that include integration with backend APIs\nDocument prompt design principles, best practices, and troubleshooting guidelines\n\nRequirements\n\nBachelor's degree in Computer Science, IT, or related field (or equivalent experience)\nUnderstanding of conversational AI concepts, NLP/NLU processing, and LLM models\nExperience with prompt engineering, fine-tuning, or training AI models\nExperience developing agentic architectures with Cognigy.AI framework or similar conversational AI platforms would be a big asset\nAbility to analyze large datasets and conversation logs to improve AI responses\nSolid knowledge of JavaScript, JSON, and API integration\nStrong communication skills to collaborate across multidisciplinary teams\nAbility to analyze large datasets and conversation logs to improve AI responses\n\nBenefits\n\nChallenging projects in a highly professional, but also collaborative and supportive environment\nWorking in small and excellently skilled teams\nOpportunities for your continuous professional development\nCompetitive compensation depending on experience and skills\nPrivate Health Insurance options for you and your family members\nMeal vouchers\nHybrid and Remote work options, with provided parking for office commuters\nService Recognition Awards, our way of celebrating and rewarding long-term contributions\nAwesome Referral Bonus Program, because great people know great people\nTeam gatherings and team-building activities to foster connections, a sense of belonging and camaraderie"
  },
  {
    "Job ID": "4253309619",
    "Titlu Job": "IBM Internhsip PowerBI\nIBM Internhsip PowerBI with verification",
    "Companie": "IBM",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 1 week ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4253309619/?eBP=CwEAAAGYso0L7_oxYPNXCkgN2LIrL0UB0U458ia0Zy8ePDvJ35wTUKwqmsBt-hQM5q6-5qhb1M3m-niVLLdKq8qOcxHgVCKmfFJONZtPfBcIBQBijQTE1xzlrsKbreDCaW2fNanrJ3Nc9HMrNZvkTojq_fD790CdQStKmTN-Fe_fyC2DIFBP7z34ILNOuu4PtGbQ34swmyfP_IUnm9wJ6t_CEvlpC7fUNy_puZhUWb1_K9Gng-8wIiLL1YwcJbZdI6vBnjnU7yGpWRZXxp38XQBCKKBJ50NRlKZ2iLzdyQ_jZs-rnQerEA_d8vQCV4BQt6yK2bVbV2Ui8NQbI__yszbdb8C8YP2b5eU5CWVEL1k_YQ8Wd6FBGUFoRN5MGifjnZAhySDTeMxPdADcuw9D7J3qgLtuHIEYTpSTy6tmo0hBJBAiTdlMRpMeJdAL4x3dDzOI8zCWjhBWachs8vUUtRFAM3mD8Qx-Qm7BY70d28TPAHl1Kb9CHZT4TubldMBN8YYgHmfQ1x_T&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=0Ee96F2apsvy4El2ZoitSA%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nIntroduction\n\nThe Internship program is for a determined period of 3 months full-time. The candidate can be offered the option of a permanent position in IBM.\n\nYour Role And Responsibilities\n\n Assist in building and maintaining Power BI dashboards and reports that support business decision-making.\n Support data preparation, cleaning, and transformation activities for reporting purposes.\n Collaborate with cross-functional teams to understand reporting needs and translate them into actionable data visualizations.\n\nRequired Technical And Professional Expertise\n\n✔ Have a degree in Computer Science, Data Analytics, Economics, Statistics, Engineering, or a related field.\n\n✔ Have a strong interest in data modeling, data analysis, business intelligence, reporting and ERP systems (SAP knowledge is a plus).\n\n✔ Possess advanced knowledge of Excel and databases (experience with SQL, Python, or Power BI is a plus).\n\n✔ Are quick learners, problem solvers, and eager to work in a data-driven environment.\n\n✔ Have good analytical and communication skills to interpret data and present insights effectively."
  },
  {
    "Job ID": "4283832250",
    "Titlu Job": "Junior Data Engineer\nJunior Data Engineer",
    "Companie": "888Sparkware",
    "Locatie": "Bucharest, Bucharest, Romania · 3 days ago · Over 100 people clicked apply\nResponses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4283832250/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=q4XElhKHDHloCyAR9%2BX%2BRQ%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply",
    "Descriere Job": "About the job\nAs a data-driven company, our Data Group is at the heart of every major project and plays a critical role in most development processes. We’re looking for a talented, proactive, and quality-driven professional to join our Data team\n\nWhat You’ll Be Doing\n\nWork as part of a team of Data Engineers using Agile methodology.\nDesign, develop, and maintain Data Quality, Data Migration, and ETL processes using both on-premise and cloud technologies.\nHandle high-scale databases, delivering back-end data solutions from the design phase through development and implementation.\nCollaborate with a variety of stakeholders and applications across the organization.\n\nJob Requirements\n\nWhat We’re Looking For\n\nStrong proficiency in English.\nSolid understanding of SQL.\nFamiliarity with relational databases.\nMinimum 1 year of experience developing with ETL tools.\nGood communication skills.\nStrong analytical thinking and attention to detail.\n\nNice To Have\n\nExperience with CI/CD methodology.\nExperience using GitLab.\nExperience with Python, DBT, and Apache Airflow.\nFamiliarity with AWS cloud services.\nExperience with Docker.\nBachelor’s degree in Computer Science, Information Systems Engineering, or a related field.\n\n What We Offer\n\nOur roles offer more than just a job, you’ll become part of the evoke family! We have created an environment where our people can thrive. Check out some of the fantastic benefits on offer:\n\nFinancial: Competitive salary\nHybrid working: Our employees can work from home up to 80% of the time with 20% of office time built in to ensure we get some face-to-face collaborative team time - and the chance for a coffee and a catch-up!\nHoliday entitlement: You’ll be entitled to 22 annual leave days, plus bank holidays and an extra day for your birthday.\neLearning\nFamily Support: Industry-leading maternity and paternity leave and paid time off if you have caring responsibilities.\nHealth & wellbeing: Tools and services to help support your well-being, including support with mental health and financial education. You will also have access to gym discounts.\nHealthcare: We prioritize your health and well-being, offering comprehensive healthcare benefits.\n...and more\n\nMore About Evoke\n\nWe’re a business that embraces change and progress. The power behind big name brands William Hill, 888 and Mr Green, evoke is the new name for 888 Holdings. Marking a new sense of purpose, direction and ambition for the business, there couldn’t be a more exciting time to join us as we accelerate our journey to bring even greater delight to our customers with world-class betting and gaming experiences. That’s the future. That’s evoke.\n\nAt evoke, you’ll benefit from flexibility and a culture built on trust. We’ll give you the space to be yourself and the tools you need to protect our customers while they play. We’ll invest in your future to help you develop your unique strengths and build a career that’s right for you.\n\nApply\n\nAt evoke, we prioritize diversity, equity, and inclusion for the benefit of our company, employees, and communities. We foster a welcoming and safe workplace that values all forms of diversity and provides opportunities for growth.\n\nSound good? Then you belong at our place! The first step in the recruitment process is kickstarting your application, followed by an initial screening call and an interview stage.\n\nApply today to kickstart your application with the evoke Family!\n\nApplication\n\nJust fill in a few details below and we’ll be in touch if you’re a match for the position\n\nPOSITION | Junior Data Engineer | Position ID: 23.A55\n\nPrivacy Policy\n\nThe candidate consent that the information in this Candidate Application and any personal information concerning him/her which is obtained by the Company or from other sources, will be held and managed by the Company or on its behalf, and that the Company shall be entitled to use and transfer such information to third parties, including Company’s affiliates, business partners or contractors/service providers, in Romania or abroad, to the extent required while maintaining your right to privacy. The Company undertakes that the information will be used, and transferred for the purposes related to the recruitment process, including assessment of your qualifications against our work opportunities, verification and reference/background checks, communications with you about the recruitment process and/or your application and/or compliance with applicable laws, regulations, legal processes or enforceable governmental requests.\n\nShare this position with a friend\n\nRelated Positions"
  },
  {
    "Job ID": "4279456013",
    "Titlu Job": "Game Tester\nGame Tester with verification",
    "Companie": "Electronic Arts (EA)",
    "Locatie": "Bucharest, Romania · 1 week ago · Over 100 applicants\nPromoted by hirer · Company review time is typically 1 week",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4279456013/?eBP=CwEAAAGYso0L70GnzoLkpuQN54cO-gt3R-KV_RNoI7ruWS2SgZvLkB-HyzMtyIgANkmy6A-i-8ubDHfiYETryyIvplhHadOLtFj7PogKZifyaK73M7xe1LX7zpKbYD6tIV77ZautK4PJt0juQA5CSPutgpEhAk1Q0lDII7GIhuwzM1yRtSD5SGOhfw-1kv9LyVQPowD6YTwgPPkn6-2fWuqH1vu2xExxWuxYFP2OpzPfQ4nSu0BBmFfLjIwk3UU1X9EZ-SA1YxJzp9OJMGKP3Eo6vbzjj9hb2rxXyYcyRMYGn0woXmRHDIqDy8b-5_3abp05q2S8XDOBo_q66VRntFWbsXsL6TVIZvG4WYLHCVXBTVFAb-gdID39ecv_XcPCz85nGwkoJR7tvmcjBab_dnMa1GEc_Gj3m3xrLep-lVN_SrNlu3_ldWF2Y2eQw09Z2JlIkIv99moELr_hieinoQwBTH_TdkQ2K5pARKs&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=NCH%2FQcrLJXbciShXMKKWAQ%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nJoin us in driving the next revolution in games!\n\nPlease read the following carefully before applying.\nThis opportunity is a contractor role working for Electronic Arts Romania hired through Smartemp for a 90-day contract. Contract extensions are solely based on performance.\nThis is a popular entry-level role, particularly for those not already qualified as an artist or programmer. This is an excellent way to gain experience and learn about the gaming industry.\n\nIf your skills include being a team player and passionate about games, a keen eye for details and having excellent work ethics such as punctuality and dependability, then don't miss the opportunity to join our team!\n\nWork schedule: Full-time, from 9 AM to 6 PM\nLocation: Bucharest, Boulevard Doina Cornea 4F, AFI Park 2 building\n\nCandidate Requirements:\n\nHigh School graduate\nFluency in written and spoken English - we work with both Romanian and foreign employees.\nKnowledge of MS Office Suite, Windows, Apple, and Android.\nAbility to multitask and problem-solving skills, identifying issues and reporting them Team player mindset – Communication is the key.\nWe encourage a strong collaboration environment within the group\nExperience with consoles is a plus\n\nThе challenge аhеаd:\n Game Testers perform an important role in game development: testing, analyzing, and recording, any flaws or “bugs.”\nTesting the game in a systematic way, analyzing the game's performance against the designer's intentions, reporting problems, and suggesting improvements. However, it also involves creativity, which is used to figure out how to ‘break’ the game in different and unique ways.\n\nIn effect, Testers are the game's first audience by reporting on play-ability and identifying any aspects that could be improved. Testers are responsible for finding these bugs in a game before it goes public and assuring quality in the final product.\n\nGame testing involves playing the same game repeatedly, testing different levels and versions or revisions of the game. You must be able to stay motivated since the quality of the final product depends on your work. Sometimes, different teams oversee specific sections or areas of a game. You must be professional when communicating with other team members. You must also be able to anticipate different ways the game will be played by people around the world, and test accordingly.\n\nPerks at the office:\n\n· Fresh fruits, very good coffee and tea any time at your discretion\n· Relaxation rooms with console games and other different activities for when you need to unwind during your breaks\n· Additional free days for Christmas - NYE period (Except the bank holidays - some extra vacation time)\n\n\nElectronic Arts Romania, one of the largest tech companies and video game developers in Romania, brings together talented people from diverse work backgrounds and industries including producers, software engineers, DevOps engineers, designers, project managers, animators, graphic artists, UX experts, QA analysts, and many others, all united by a common passion: bringing the best video games in the world to life!\nIf your dream job is to work with cutting-edge technologies on some of the most popular video game franchises in the world, including EA SPORTS FC, then you've come to the right place. Prepare to level up your learning and career development together with some of the most talented industry professionals in the gaming world: a diverse, creative, and collaborative group of people united by a shared vision of excellence.\nIf your skillset includes a passion for creative storytelling, knowledge of one or more programming languages, an understanding of animation or design techniques, detailed knowledge of gaming and gaming principles, super-attention to detail, or a background in quality control or assessment, then join us in driving the next revolution in games!\nStart a new game and begin your career in an incredibly exciting environment you'll find at EA Romania!"
  },
  {
    "Job ID": "4236897841",
    "Titlu Job": "Rev-celerator Graduate Programme 2026: Python Software Engineer\nRev-celerator Graduate Programme 2026: Python Software Engineer with verification",
    "Companie": "Revolut",
    "Locatie": "Romania · Reposted 2 weeks ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4236897841/?eBP=CwEAAAGYso0L7_zEiBlGtJ_cbuL9nJ9ANDsAHqUlJfJfOuw3ASMm_V2P1QEolmG8F984OyhyD_eFmI8HTXHPdP9mln1ev-zUMmK4YkSBQ7M7M-DsJoz5rxSj4kxw-q8u7YsG02Bi7md1Ep2dz52-tLu7KsqdF9Mr03zAI52F5uwyZrgjwNiiCcVm3yn6qFEXEsfPO1r2-rigO6HFwq12olgBtb5U9IrzMwgkFgUTcj6XQRmx2JjyYRJFSZTfPURRHPgm26-aJPxIj1jQsU-ssvmmL6O8ToeJY3hYr5J6rfi4XQDUA6nAJSwdQPtAAASsCPs-SqhnleyFYVyTLm53AZompjTC2YdPNlNmMKru4wRJLIm5PWuIqNsaKxE0306Fnq0X3STCk6VOZbnpDCv36rNjFGn8NJdD7eycx7g3RCdty2adXySwErPxrKlunztu2S40IMw_R2lXq1ZR55XHMWLqNTuWfOQND7E0D2hNc_gAa7tSIRN413_DdlCbUILUCJDZ4FJuGoUhwqQ&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=j0VKj5xU48%2Frbvrqlxfkyg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nAbout Revolut\n\nPeople deserve more from their money. More visibility, more control, and more freedom. Since 2015, Revolut has been on a mission to deliver just that. Our powerhouse of products — including spending, saving, investing, exchanging, travelling, and more — help our 60+ million customers get more from their money every day.\n\nAs we continue our lightning-fast growth,‌ 2 things are essential to our success: our people and our culture. In recognition of our outstanding employee experience, we've been certified as a Great Place to Work™. So far, we have 10,000+ people working around the world, from our offices and remotely, to help us achieve our mission. And we're looking for more brilliant people. People who love building great products, redefining success, and turning the complexity of a chaotic world into the simplicity of a beautiful solution.\n\nAbout The Role\n\nOur Technology team isn’t just one of the best in the industry. It’s one of the best in the world. And we’re proud of it. It’s our driving force, our engine. From building a new financial backend to creating an innovative app that millions of people around the world will use, there’s nothing (and we mean nothing) our tech team can’t do.\n\nAbout The Rev-Celerator Graduate Programme 🎓\n\nAre you a recent graduate eager to shape the future of finance? Ready to make a meaningful impact and bring innovative ideas to life? Well, the Rev-celerator Graduate Software Engineer programme is designed just for you.\n\nFirst, kick off with a few weeks of bootcamp, where we’ll prepare you to jump into work at Revolut with workshops, lectures, and practical exercises to start developing your skills. After successful preparation, we’ll launch you into on-the-job training where you’ll be face-to-face with tough challenges, problem-solving, and tasks to own.\n\nJoin us from anywhere 🌎\n\nThe Rev-celerator Graduate Programme is now open to international candidates from around the world, willing to relocate to one of our tech hubs in the UK, UAE, Poland, Portugal, or Spain. We’ll support you every step of the way - from visa assistance (if needed) to travel costs and the first month of accommodation. We’re here to make your move as smooth as possible. Please check further details with your assigned recruiter, as conditions may apply.\n\nWe’re looking for a Python Engineer Intern who’ll write high-quality code, build complex novel solutions end to end, and help enhance our innovative financial systems.\n\nUnlock your potential, explore new horizons, and step into the future of finance.\n\n📅 Key Dates:\n\nApplication period: June 1–December 14, 2025\n\nRecruitment process: September 2025 –January 2026\n\nProgramme start: September 2026\n\nUp for the challenge? Let’s get in touch 🚀\n\nWhat You'll Be Doing\n\nHelping our team to build APIs, ensuring they’re properly designed and can scale according to business needs\nSupporting the creation of data pipelines to pull data from production services into our data warehouse, powering reporting, data analytics, and data science\nWorking within multidisciplinary squads to build new data models to provide this data to new flows and processes\nGaining commercial exposure to the most widely used OOPL, while expanding your SQL knowledge\nWorking alongside engineers with a deep understanding of distributed systems\n\nWhat You'll Need\n\nA portfolio of multiple coding side projects or open source contributions\nTo have graduated university in 2024, 2025, or 2026\nA 2:1 predicted or achieved grade (or above)\nUniversity studies in computer science, maths, physics, or a similar field\nA proactive attitude\nLove for problem-solving\nFluency in English\nTo be an ambitious, quick learner with a results-driven attitude\nExcellent communication and organisational skills\nTo feel comfortable working as part of a diverse team in a fast-paced environment\nFull-time availability for the programme starting in September 2026\n\nBuilding a global financial super app isn’t enough. Our Revoluters are a priority, and that’s why in 2021 we launched our inaugural D&I Framework, designed to help us thrive and grow everyday. We're not just doing this because it's the right thing to do. We’re doing it because we know that seeking out diverse talent and creating an inclusive workplace is the way to create exceptional, innovative products and services for our customers. That’s why we encourage applications from people with diverse backgrounds and experiences to join this multicultural, hard-working team.\n\nImportant notice for candidates:\n\nJob scams are on the rise. Please keep these guidelines in mind when applying for any open roles.\n\n Only apply through official Revolut channels. We don’t use any third-party services or platforms for our recruitment.\n Always double-check the emails you receive. Make sure all communications are being done through official Revolut emails, with an @revolut.com domain.\n\nWe won't ask for payment or personal financial information during the hiring process. If anyone does ask you for this, it’s a scam. Report it immediately.\n\nBy submitting this application, I confirm that all the information given by me in this application for employment and any additional documents attached hereto are true to the best of my knowledge and that I have not wilfully suppressed any material fact. I confirm I have disclosed if applicable any previous employment with Revolut. I accept that if any of the information given by me in this application is in any way false or incorrect, my application may be rejected, any offer of employment may be withdrawn or my employment with Revolut may be terminated summarily or I may be dismissed. By submitting this application, I agree that my personal data will be processed in accordance with Revolut's <a class=\"postings-link\" href=\"https://www.revolut.com/legal/data-privacy-for-candidates\">Candidate Privacy Notice"
  },
  {
    "Job ID": "4262144103",
    "Titlu Job": "Python Developer\nPython Developer with verification",
    "Companie": "Ahold Delhaize",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 2 weeks ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4262144103/?eBP=CwEAAAGYso0L72GFvxMZmtEVCOCBrtZSg-Xq1Rxoe_K0Jwxg753o9ikRvg-SYn53wZGIw9G-833m1MItSpmOFAgzuIw5uFy2OTxZpQqoq0uuLSWlmwLyfmy-DOTz3cXTjYCo6lreP6yIaTfvTpJE0yyTzDdJkuByY8KhubwAf8_gkcxqAHXUk0SiUqXImwVjjevZPl_poTzTrKBMqfVseCGHIs1UOqgWRiAcj0NioLfHeTzyPkTCj0FCZeD4k5ef4qUYWL_ExstuvNXu8ioVAuJMfiPZMoLTt8IS2x4ijvoSUZfvW1f7sXFcMcLccj0bdjELvsqTB4Tvv0o4gUeEgeYRw5shN6nMCESGXbPY-v_RSmV10zJZDwi8Qa6RTDI9DHPmOsujswJDTXGWaIBqkWKgr1nqEimrpWEfKaPpov5u7bNq5W8Mak3LzyKrOHY7P_IkPeZfy4dbPP4qYfBS2HA3qzTer9eVjI6yklxslSuba36YwLp0LwQGfKWRzc3MZfEBdlYjyGii&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=iaK2jPT41HMXd2LEkQGIVg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nYour new role and environment.\n\nWe are seeking a Medior Python FastAPI Developer to join our dynamic team at GET(Gall&Gall and Etos Tech).\n\nThe ideal candidate will have a strong background in Python development, particularly with FastAPI, and experience with various technologies including PostgreSQL, Kafka, Azure, Kubernetes, and GitHub.\n\nKnowledge of MuleSoft, Apache Camel, Azure Data Factory (ADF), Control-M is a plus.\n\nKey Responsibilities Of Your Role.\n\nDevelop and maintain integration solutions using Python and FastAPI.\nCollaborate with the team to migrate integrations from MuleSoft to Python.\nDesign and implement microservices and data services.\nWork with PostgreSQL for database management and data storage.\nImplement Kafka for real-time data streaming and messaging.\nParticipate in code reviews and maintain high-quality code standards.\nUse GitHub for version control and collaboration.\n\nWhat’s in it for you?\n\nWe ask a lot. (We’re looking for the best, after all). But we offer a lot, too.\n\nSo, what do we have in store for you? We offer flexible hours and a hybrid working model, allowing you to work both from home and at the office. We provide competitive benefits to support health, well-being and your professional growth. This includes: a significant budget on benefit platform and a yearly bonus. At AD01 we welcome everyone, just the way you are, and encourage individual growth with valuable opportunities and a worldwide across-brand network.\n\nRequirements.\n\nWe think you’ll be best geared for success if you can meet the following requirements:\nAt least 2 years of experience in Python development.\nProficiency in FastAPI and PostgreSQL and Kafka.\nFamiliarity with Azure cloud services and Kubernetes.\nExperience with GitHub for version control.\nKnowledge of MuleSoft, ADF, Control-M, and Apache Camel is advantageous.\nExperience in creating microservices and data services.\nStrong problem-solving skills and ability to work in a team environment.\n\nApply now\n\nIf you’re excited to help us grow, then please apply now. If you feel like you might not tick all the boxes but have the skills and personality we’re looking for, then please also apply now!\n\nGot questions? Don’t be shy. Madalina Ghitulescu at madalina.ghitulescu@ad01.com, has answers.\n\nFor us, diversity means being inclusive of thoughts and skills, generational differences, LGBTQ+, gender, race and ethnicity, disabilities, nationalities and more. We accept everyone for who they are."
  },
  {
    "Job ID": "4208461022",
    "Titlu Job": "Radar SDK Internship Student\nRadar SDK Internship Student with verification",
    "Companie": "NXP Semiconductors",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 2 weeks ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4208461022/?eBP=CwEAAAGYso0L75n9eoQ0OCF3RvoveYouchS5KbhWVVroTj9JAMK7RtKQZQ6SiHFGlDHiGoLT3O7dplPYwZW_Y8k4t5sskRbFQj_3KtvvATYS_wW5XBUoosBQbPqybjoskW3qpP5_9zrKM4Tv8FUz_pE7wbZQmcCJwZpC_PQtl1UHy9kaIYOUSA4swTQQuvztYxz3Z89IqC41JGDNasoaclKz3fZt6ZKQI0J7ePfzuUOPf6btq7AAmt2m3lw_tGIVuBya_N8_zAfvaAEQafDHllJsnYqFLdVdeASuif4xx1jiWJBRQIzfcFSJTwMl3vB82TTM6Y-nvsAWBoAbJaEAx2WMKTKOYLdvHIHJZNmdnO-afp3wyZ5ofeUS50kUCGnX8jlmx-U3kakTOR1kwhOdrXuBfybI5vjSlSNlZ46mNxt3a8_0Wp5SpnMeZQet8HVct6DC9lQKR5k7b4mpu8ccvoy2pT6NJF5lFU9C_0N1sn_hxWpdJTf1iVTCy5d9G1Gk_WYImzz7ZPb7sl4&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=8irMPbQceDn0%2FDaAy%2FRvfA%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nReady to join the future of Radar Software Development at NXP?\n\nBecome part of a highly technically skilled team, in charge of the development of the Radar SDK for all NXP supported platforms. Radar SDK enables developers to enhance radar system performance, leveraging tight coupling of NXP’s advanced software algorithms with its latest radar processor family for improved safety and differentiation. The proprietary radar algorithm library allows quick integration of proven algorithms into radar sensor applications, helping our customers to speed radar sensor development and reduce R&D investment.\n\nAs Radar SDK Internship Student you will contribute to the success of the team by ensuring the definition, prototyping and productization of the radar algorithms in alignment with marketing requirements.\n\nYour Responsibilities\n\nInvolvement in activities of problem modeling, advanced mathematical algorithm development, prototyping (in Matlab, C/C++, ML frameworks, etc…), real-data validation with experimental systems, embedded software implementation, system integration and testing tasks.\n\nJob Qualifications\n\nShould have knowledge on the following topics:\n\n Radar Basics (RF & Digital Processing Chain)\n Analog and Digital Signal Processing\n Linear Algebra, Applied Mathematics\n Statistics (Estimation Theory).\n\nYour team\n\nThe Radar SDK team is recognized in NXP for the on time and high quality deliverables. We are a diversified and innovative team with high energy, an open collaboration environment and eagerness for continuous improvement. The Radar SDK team collaborates with NXP teams from North America, Europe and Asia.\n\nYour profile\n\nTo Be Successful In This Role You Have\n\nUniversity studies in progress in a technical field such as: Electrical Engineering, Computer Science.\nTheoretical experience with signal processing and system modeling.\nFamiliarity with programming in Matlab.\n\nFurthermore, You Are\n\nSkilled in oral and written communication in English.\nAttentive to details, self-motivated and able to be a team player while working independently.\n\nCreating Secure Connections and Infrastructure for a Smarter World\n\nNXP Semiconductors N.V. (NASDAQ: NXPI) makes products and environments safer, more sustainable, and more secure with innovative connectivity and edge processing solutions for a smarter world.\n\nWe are in the business of better. Not just better technologies, but better innovations to improve society. As the world leader in secure connectivity and processing solutions for embedded applications, NXP is solving the world’s most complex technology challenges to accelerate business innovation, enhance how we work, and advance how we live.\n\nReady to create a smarter world? Visit our career website and follow us on social: LinkedIn, Facebook and Twitter.\n\nWhat Can You Expect\n\nContract: This is a fulltime position\n\nCompensation: Besides a good salary, you will be eligible for our bonus plan and receive lunch vouchers, a number of vacation days based on seniority. We also have flexible work hours and a work from home policy.\n\nDevelopment opportunities: We believe that a key component to growing our business is to develop our people. To enable you to grow your career at NXP, we offer online and offline learning opportunities to help you develop some of your core and professional skills.\n\nOur office: We are based in one of the high tech hubs in Bucharest with easy access to public transport and restaurants and parks close by. We have many relaxation areas on-site, including a little library where you can borrow books, sofas to relax in a quiet place and a cafeteria and restaurant in our common area.\n\nHiring process: Applying only takes a minute! Fill in the online application and share your CV with us. After a positive screening based on your CV you will have an initial phone or video conversation with our Talent Acquisition Consultant followed by several business interviews. Here are some useful tips to help you prepare.\n\nAnd more: Life at NXP is more than work alone. We like to start our day with a free coffee and chat with a colleague and on Thursdays we have fresh fruits for all employees. Join us at one of the many social activities that are organized by and for employees such as our Christmas parties, our employee children’s party and food fairs. Or help us give back to society by donating blood or collecting clothes and food for children in need.\n\nWhat’s Next\n\nIf you’re excited about this opportunity, we kindly invite you to apply!\n\nMore information about NXP in Romania..."
  },
  {
    "Job ID": "4265154639",
    "Titlu Job": "System/Software Validation Engineer - Automotive\nSystem/Software Validation Engineer - Automotive",
    "Companie": "TEMA",
    "Locatie": "Sector 2, Bucharest, Romania · 1 month ago · Over 100 applicants\nPromoted by hirer · No response insights available yet",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4265154639/?eBP=CwEAAAGYso0L79Kmzf2ocpBsuWGusHBQZsvGZxjByGYOlrOt7Hr8BjDwdli_enkqQzGjbAznhKIoWIOD07WgfSa4hb9zqacsCV142lib89rF_uLWiEIV5FYUw2SEMCbSZrgAx-qtBaFctOioLRa7nFbiPPDXExYCSml4MIl865IcESzOpjGD8w7-nPRsL86P6KzOBDlUKlo8F7FHT18ZUZEn76cIzoKL8JSmIhAdcK3TnIs2zmsGcBre6dI028d3Gm66gEaYpW3ZCUrBcE--oWt8-liyNKgFhsuGWTJDZyAMAkzb4J_fF2oojHeDSmA0m6V_MVMZVzGkq-V3MnEAtYu-lkdrHvr_1x3LQ8tLrXJrznqODFCPf9QI-KWGnpQsyJdq9KO1l8NoyEdBojRgTBk7dZAjSRpoT3uKK8lPsYJZFV301QtEaKOwm27AeznjcbQ7jqrcCW_6yt4mekTBNHlN4W7lVII3sNJQqGwF-wGkHupDnklcwo-R&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=5aRhii4gr6tEPytBjRi5Wg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nJob Description: \nOur Testing Team, based in Bucharest, is expanding. We are currently looking for a Test Engineer who create, execute, and document tests at System and Software levels for Heating Ventilation and Air Conditioning (HVAC) ECUs used by Automotive market.\n\nMain activities: \nCreate and execute Test Cases for the following Automotive SPICE testing levels:\n- Software Unit Verification (SWE.4) based on Software Architecture Detailed Design (SWE.3)\n- Software Integration Testing (SWE.5) based on Software Architecture Design (SWE.2)\n- Software Testing (SWE.6) based on Software Requirements Specifications (SWE.1)\n- System Integration Testing (SYS.4) based on System Architecture Design (SYS.3)\n- System Testing (SYS.5) based on System Requirements Specifications (SYS.2)\n\nDocument the Tests Results and create traceability between requirements and Test Cases.\n\nCreate Test Plan where define the Strategies, Test bench, tools to be adopted during Testing phase. \nParticipate to Peer Review of Test Cases scenarios and Test Results. \nExecute Regression and Sanity Tests for the planned deliveries, log the results. \nLog bugs found during testing and provide test summaries, as required, for each project deliverables. \n\nTechnical skills: \nKnowledge of C language.\nDevelop automated tests at system level using CAPL.\nBackground in automotive bus systems (CAN, LIN, etc) \nRequirements management (DOORS, RedMine tools) \nKnowledge of Automotive SPICE and AUTOSAR is a plus\nUnderstanding of control module embedded design – microcontroller peripherals, memory allocation, compilers, linkers, programming standards, etc. \nAbility to read HW schematics, PCB layouts.\nLaboratory measurements using Multimeter, Oscilloscope, Logic Analyzer\nSupport meetings internally and with customers to discuss test plans and test issues \nGood understanding of microcontrollers (Renesas/NXP/ST) \nKnowledge of tools: CANoe, CANape, Green Hills Multi IDE and Debug tool. \nExcellent communication skills, both in written and verbal form \nStrong analytical skills are required to support root cause investigations and support the development of robustness programs. \nAbility to work collaboratively in a team-oriented environment.\n\nEducation: Computer Science Degree, Electronic Engineering Degree. \n\nFormer Experiences: 2+ years of experiences in Testing System and Testing Embedded software in automotive area. \n\nLanguages: English, good Level Spoken and Written"
  },
  {
    "Job ID": "4223877572",
    "Titlu Job": "Data & Automation Analyst (Remote)\nData & Automation Analyst (Remote) with verification",
    "Companie": "CrowdStrike",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 2 weeks ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4223877572/?eBP=CwEAAAGYso0L8OFjtSLw0JoTiM0IDAK9aR0ukODUQ0afcFSSOMW3wcvnkksf6sgI5ig91mMZ52Y4ktzx4K_rkGmO4_GYv4jjsRbrwECUfnyppNPul4eJn3DRhqlJUmNDde59_SlRqEJVw8ZnrBaXjb9bwzLkl06gdLg4WY2dyrnPg8mMbvbhir_oJHSNxqAllnRdBg1HukjbCehU7300PNvCzanWXgSq_bQpgBwwDt-FswCETwconRkh5x23s0SaFzvpZHr47bm94ertsa7lKWMXCFvusAd95pTx7bu3Vnyo8fTWgVwd3Ll-oQW7AS4YilH4pUpUkZ-MRZkTsdUC8BpovwcQSAp79IZ213_ALbgHv9tOWmTRAbHqSNDdCQSCV7ZJlMp0CE-_lSWsZ_XrDRqQRfk2d2IxDQJGXYj-hAICPNHb5PDL4OigNPK7w75oo2bofbPnNt9QfZeSAbtOvQGTCNQcHQE9enfX73KUQRyoG870ZA8j-6D9IE430WhGvYqmLDjETOZQ&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=snC1YAf4OiKV7AE4DZVW1w%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nAs a global leader in cybersecurity, CrowdStrike protects the people, processes and technologies that drive modern organizations. Since 2011, our mission hasn’t changed — we’re here to stop breaches, and we’ve redefined modern security with the world’s most advanced AI-native platform. Our customers span all industries, and they count on CrowdStrike to keep their businesses running, their communities safe and their lives moving forward. We’re also a mission-driven company. We cultivate a culture that gives every CrowdStriker both the flexibility and autonomy to own their careers. We’re always looking to add talented CrowdStrikers to the team who have limitless passion, a relentless focus on innovation and a fanatical commitment to our customers, our community and each other. Ready to join a mission that matters? The future of cybersecurity starts with you.\n\nAbout The Role\n\nWe are looking for an Analyst in our Go-to-Market Automation team to build, test, deploy, and scale some of our high impact data products. This key role will partner closely with our sales, marketing, value, licensing, renewals, and deals teams to bring exciting new innovations to the field and drive value to our internal teams and customers. You will work with the best in the business, and we need you to bring your creativity, imagination, and energy to this high-profile position.\n\nWe need you to have a strong hands on knowledge of data & apps product development with Python, Streamlit, Snowflake, GenAI and related sales technologies like Salesforce. You'll need to develop self-service solutions for our sales team to leverage across the customer journey.\n\nWe are at a pivotal moment, poised to disrupt the cybersecurity market. We need your passion to capitalize on this unique opportunity and achieve our full potential.\n\nWhat You’ll Do\n\nDevelop and execute complex data & automation workflows using Snowflake, Python, and BI tools to automate manual processes\nContribute to data & automation projects from discovery to deployment ensuring successful delivery of our roadmap\nPartner with GTM teams (Sales, Customer Success, Renewals, Customer Value…) to identify opportunities and drive adoption of new services to improve team efficiency and customer experience.\n\nWhat You'll Need\n\n2+ years of experience with Python development in a Data, Data Science or Automation role (ideally building and scaling data products).\n6+ months of leveraging GenAI / LLM to generate text (including fine-tuning).\nUnderstanding of sales deliverables and customer journey in technology.\nStrong problem solving and coding skills.\nSelf-motivation, initiative, and resourcefulness to effectively manage multiple projects simultaneously.\nComfort in the spotlight of high-visibility initiatives.\nMaster’s degree in computer science, or engineering preferred.\n\nBonus Points\n\nExperience building, deploying, and maintaining Streamlit apps used by 50+ concurrent users.\nSnowflake and Salesforce knowledge.\nCybersecurity knowledge.\nStrong understanding on how to write great GenAI / LLM prompts.\n\nBenefits Of Working At CrowdStrike\n\nRemote-friendly and flexible work culture\nMarket leader in compensation and equity awards\nComprehensive physical and mental wellness programs\nCompetitive vacation and holidays for recharge\nPaid parental and adoption leaves\nProfessional development opportunities for all employees regardless of level or role\nEmployee Networks, geographic neighborhood groups, and volunteer opportunities to build connections\nVibrant office culture with world class amenities\nGreat Place to Work Certified™ across the globe \n\nCrowdStrike is proud to be an equal opportunity employer. We are committed to fostering a culture of belonging where everyone is valued for who they are and empowered to succeed. We support veterans and individuals with disabilities through our affirmative action program.\n\nCrowdStrike is committed to providing equal employment opportunity for all employees and applicants for employment. The Company does not discriminate in employment opportunities or practices on the basis of race, color, creed, ethnicity, religion, sex (including pregnancy or pregnancy-related medical conditions), sexual orientation, gender identity, marital or family status, veteran status, age, national origin, ancestry, physical disability (including HIV and AIDS), mental disability, medical condition, genetic information, membership or activity in a local human rights commission, status with regard to public assistance, or any other characteristic protected by law. We base all employment decisions--including recruitment, selection, training, compensation, benefits, discipline, promotions, transfers, lay-offs, return from lay-off, terminations and social/recreational programs--on valid job requirements.\n\nIf you need assistance accessing or reviewing the information on this website or need help submitting an application for employment or requesting an accommodation, please contact us at recruiting@crowdstrike.com for further assistance."
  },
  {
    "Job ID": "4271807910",
    "Titlu Job": "Intern Software Engineering\nIntern Software Engineering with verification",
    "Companie": "ACI Worldwide",
    "Locatie": "Timisoara Metropolitan Area · Reposted 1 day ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4271807910/?eBP=CwEAAAGYso0L8ERAfyAbV6kWx-eie9ObrCkH_OwjWrXqD_ucyYhL3uDm3jTo5u6OLv-HLAqnG_xU6hIPSU0UwyQBl7Ym2JONTHFMzsdvncGv3W2u7U5Pl99ULhMZ_-RU2MsHSLx_dHqJT3QY30z1XxBwq4XLm7JMJnTHEnTx2ufNXeCjQWvc8ccOfh--sCluB-deNziansNuAUthowlyOgWWW9Y33pzqTwHileXoAJLX43Lep1zNrhoTRkmp9Ds8KfUj6cA7irzK7zGlBvsQDsd-tTM2MAImZJUYEdID58GBNDSniC5St2GO_jVRNXwjKUCprTJ6w6Q5d1YYYNnFjMtp0bNLrKCA76gCB2dK8n8F1oTqyG_k-7cfC1QYalVKgY6-dZx-QBdWMpd8C7xOnnU4ovilgHoICFw2SuPSX-CtoWiAMkPRC9tbTn70I905Fvube23hEkHvsy6N5aO1Bn8llvxrs4kPdrhvf4RFkW0Y3LwQdVxMTej1fovNDo_kSnPA1qQDX_Zgvig&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=khzgon3lctxN%2BZwoPqEpGQ%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nJob Description\n\nJoin The Team Building Modern Payments Products\n\nIf you’ve ever used an ATM, paid a bill through your phone, sent money to a friend, or shopped online, chances are your transaction was safeguarded and processed using our software. Now it’s your opportunity to help shape the future of global payments.\n\nJoin us as a Software Engineer Intern at ACI Worldwide\n\nAs a Software Engineer Intern, you’ll be part of a diverse and passionate team building modern payment products in the Cloud. You’ll contribute directly to the development of our next-generation solutions and gain hands-on experience in a fast-paced, agile environment.\n\nWhat you’ll do:\n\n\nCollaborate with an Agile team to design and develop payment solutions.\nBuild Angular-based frontends and Java-based backend microservices for our Cards payment engine.\nParticipate in the full software development lifecycle: design, development, testing, and delivery.\nCreate and review unit, integration, system, and QA test plans/scripts.\nInvestigate and help resolve customer-reported issues.\nAdhere to corporate policies, including the ACI Code of Business Conduct and Ethics.\n\nWhat knowledge, skills and experience are required for this role:\n\n\n2–3 years of completed coursework in Computer Science or a related field, with graduation expected in 1–2 years.\nFamiliarity with software development methodologies and best practices (source control, unit testing, secure coding).\nA passion for learning and a proactive, self-starting attitude.\n\nOther bonus points you can bring for this role:\n\n\nExposure to Agile development practices.\nExperience or coursework in Java; familiarity with JSON, Git, Docker, or Kubernetes is a plus.\nKnowledge of cloud-based microservices (e.g., Vert.x, Spring Boot).\nUI development experience with AngularJS or ReactJS.\nFamiliarity with Linux, Vagrant, or VMware.\n\nAre you ready to help us transform the world of electronic payments? To learn more about ACI Worldwide, visit our web site at www.aciworldwide.com\n\nReq ID #16109\n\nACI Worldwide is an AA/EEO employer in the United States, which includes providing equal opportunity for protected veterans and individuals with disabilities, and an EEO employer globally"
  },
  {
    "Job ID": "4236387519",
    "Titlu Job": "Data Modeling & BI Specialist\nData Modeling & BI Specialist",
    "Companie": "Deutsche Telekom Services Europe Romania (DTSE Romania)",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 2 weeks ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4236387519/?eBP=CwEAAAGYso0L8FkoZjkMeJSLBfpHbYF8Bja4rVw6imQK5HPj7ABOCRpJxOcd3w3QSetDD_SOo3BWS75c9ql-Berwxl5YlelKvwquVWPs7MIKhjSOnYv7a3pp15VdGpdVWHKiIQy8qS-xuE3qYJHTDwPvz893VEcdyQnKCNIabfIKBf3rIehTDapGH0ev1UPpiH0G4qXUXUMraddv6RVNm1O88Zp8ZBCNKYuIgR2uaOeD_AiizQol5a2e0W23exd2e3L4tZ3Pkr3HqxgtsI0ByI9gYT9beVQTx_WbGHGySRrC9bpbdRhLjLIlKU20ThKc3wTR5CDZ0WJpqs64dCAJq2ckJRj-h36uEKjtdRbVLWp__tUZyiY0tHeUMIslR4ox3GDkbqm6kO62ag9CEklcDjnlGrW-jZ0Ddv5APbG65TSvqAv3lkLDmxwkd88j7qBAbcmGcepz5MoqQf95tsZk20F5dnwHJtDXSOezLQE3m9UJm_YDA_19ABI6kVZuUPeMA1yBhkapiA&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=8zKgZJbR3Jpq7xKO2rAL3g%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nYour Main Accountabilities\n\nAnalysis and implementation of business requirements – development of operational planning models in Jedox based on an agile cooperation with business controllers.\nYou will be a partner and advisor to business owners, collaborating to provide the best technical implementation in Jedox and helping them digitalize their planning processes at country level (Germany, Czech Republic, Slovakia)\nBusiness modeling – creating dimensions, data cubes and KPI rules – data structuring.\nFront-end design – creating reports in Jedox to facilitate data analysis and collection.\nContributing and defining platform wide standards to be used by all customers (consistent data modeling & report visualization)\nContinuous knowledge sharing with relevant team members to avoid knowledge gaps\n\nCompetence Profile\n\nBachelor’s/master’s degree in Informatics, Business Informatics, Mathematics or a related degree\n2+ years of relevant experience as a Solution Designer/Business Analyst/BI developer or a similar role\nAt least 1 year of experience working with Reporting and Planning software.\nStrong analytical and solutions-oriented mindset, ability to understand the big picture and to translate business requirements into effective technical solutions.\nCompetence in working with relational or multidimensional databases.\nCompetence in structuring large volumes of data and extracting relevant information (ETL)\nExperience in designing dashboards/reports in one of the BI systems (SAP Analytics Cloud, Tableau, Qlik Sense, Power BI, Microstrategy, IBM Cognos Analytics)\nNice to have: experience in SAP BW or other multidimensional systems (Oracle, IBM, Jedox).\nKnowledge of companywide financial planning processes would be a plus.\nLanguage: Fluent written and spoken English. German would be a plus.\n\nInterpersonal Skills\n\nExcellent teamwork and communication skills, high degree of customer and service orientation, organizational skills as well as initiative and decision-making competence\nHigh sense of responsibility, flexibility and commitment even under great time pressure\nSupports colleagues, encourages active cooperation, extroverted personality and high level tolerance\nA high level of social and intercultural competence helps you to act with confidence in critical situations\nA thorough and methodical approach to work"
  },
  {
    "Job ID": "4273504266",
    "Titlu Job": "Data Researcher\nData Researcher",
    "Companie": "Undelucram.ro",
    "Locatie": "Cluj-Napoca, Cluj, Romania · 2 weeks ago · 78 people clicked apply\nResponses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4273504266/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=eEIpmYNoOuWu2iVAlxMmRg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply",
    "Descriere Job": "About the job\nUndelucram.ro on behalf of:\n\nYardi Romania\n\nWho we are:\n\nWe are a software development company where people, passion, and technology come together to shape the future of real estate through our own innovative products.\n\nIn 2025, we’re proudly celebrating 15 years of Yardi Romania in Cluj-Napoca! Since opening our doors in 2010, our Cluj-Napoca office has grown into the second-largest Yardi location worldwide. As part of Yardi Systems, Inc., a global leader in real estate software, founded in 1984, we’re connected to a network of over 45 offices and 9,000+ colleagues across the globe. \n\nOur success is driven by a diverse team of more than 1,300 professionals, including software developers, marketers, consultants, data researchers, customer service specialists, and many more. Think you’d be a great fit? Join #TeamYardi.\n\nYour impact:\n\nOur Commercial Data research department, already counting 200 people in Cluj-Napoca, is looking to hire Data Researchers for our Commercial Edge product.\n\nAs a member of our Commercial Edge team, your main responsibilities will be to collect, verify, analyze and add commercial real estate property information to our database. Starting from a property address, you will need to identify certain characteristics (year built, lot area), contacts related to the property (owner, leasing agent, who is occupying the building), listings, previous transactions that involved the property, its financial and vacancy status. Market data will be gathered mostly via web research but also some phone calls, maintaining a high level of customer service and professionalism.\n\nCommercial Edge is conducting research and reports mostly on high-end Office, Industrial and Retail properties across the United States.\n\nYour work will help a wide variety of real estate professionals in the US to make savvy decisions and investments. As one of our new team members, you will have the full support of our colleagues, who will provide you with all the necessary tools to succeed! You start as an Associate Researcher with the possibility of reaching the Senior Analyst role without the need to switch to other teams.\n\nThis is a great role for students and new graduates as you will be offered a daily flexible schedule, room to grow, train, and develop your English language, analytical and technical skills in a friendly, relaxed and professional environment.\n\nWorking hours are flexible, Monday to Friday, with a start time anytime between 08:00 am and 12:00 pm.\n\nThis position is available in a hybrid regime that implies working from the office at least once a week. Therefore, please take into account that you would need to be located in or near the Cluj-Napoca area.\n\nWhat you'll bring along:\n\nSecondary education (high school) with Baccalaureate Diploma;\nVery good English skills;\nFine attention to detail;\nProblem-solving and analytical skills; ability to understand how data relates to other fields/records and the ability to identify more complex issues;\nVery good communication and interaction skills;\nAbility to lead a professional conversation over the phone;\nPrior professional experience is not a must: we believe in your potential, so we offer you the chance to prove yourself;\n\nWhat you'll do:\n\nResearch official government websites to find specific information about the properties;\nAnalyze official documents to extract information about the properties (sales, mortgages, loans);\nAdd and link collected information to current business intelligence using internal tools.\nCall real estate professionals and property representatives across the US to validate or obtain new information;\n\nWhat you'll enjoy once you become part of the Yardi Romania team:\n\nA flexible hybrid work setup that blends the best of remote and office life.\nUp to $2,000 per year reimbursed for eligible learning and professional development expenses.\n40 RON/working day meal tickets (taxable according to current legislation).\nUp to 26 vacation days to recharge your energy, based on tenure.\nComprehensive private medical insurance (including dental care, physiotherapy & psychotherapy) for you and your dependents.\nUp to 20 days of EU remote work per year, subject to current policy.\nAnnual salary review to keep it in line with your performance and industry changes.\nThe possibility of a yearly bonus through our profit-sharing program.\nLife insurance for you & global travel insurance for you and your family.\nCurrently granting a fixed monthly Work/Life Stipend for your well-being activities.\nDiscounts at gyms, restaurants, and other service providers.\nAll necessary equipment provided for both home and office setups.\nA modern, central workspace @ The Office in Cluj-Napoca, with an open-air terrace and game rooms to unwind.\nFresh fruit, snacks, and specialty coffee available daily at the office.\nEngaging office events, themed parties, and team buildings."
  },
  {
    "Job ID": "4009751166",
    "Titlu Job": "Researcher (Proactive Data Creation)\nResearcher (Proactive Data Creation) with verification",
    "Companie": "Exiger",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 2 days ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4009751166/?eBP=CwEAAAGYso0L8ODqdmeMCx4kPSy3osW1wb_7yCZqX30pRb720sglqa53i5-PKe9MR8qe-D1H8PJ872WT78eVPfdE_FMBAALJ4__4150yT_20rSoHb5ma7CzIHVatduhnUmOYHfcuR7pJ4saZ7FZoKUUIMy2AxsWpasfDXnoK_SoSnfyNXhgy_dqKr_ptUw30k643vQNy1kLwPOVWM2CLGvJOKaBPT247RPC_Aq4QFyQl0opUTR_Agzr9KCW_8NxKSC5DaTlkCPV5JTYIm9fi_KX_Q5wnYqUSamFbRHSN9vhZIDp8Qjcb71rmsfrY9tZ8WJLrvstQjve7yvru0UjdQmBqbDLm-WFFnXDnoVxfqZsyVL_VQY8TfPx40V2mo430rXS1gn8EjMDPiaRTd0LWqrgXsRPcvLAq2q05sB3o7yWLbJLcSR8HYJ6DJYy9rbnHHq5dGqTEH71M5QK-Fu4Jqsy9koZmGF8f33ifsnBQBwt4EIoFUhKguV5dHdNRpFqmoxY2ADAhpA&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=OP4tc5eD4DKfq76Lt4TXOg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nExiger's Proactive Data Creation Team is excited to welcome to an experienced due diligence, compliance, and risk research professional. We are searching for talented research professionals who know this industry and are passionate about research. This function focuses on research for a variety of clients using a wide range of research tools to gather risk and compliance intelligence on individuals and companies. The research is then analyzed and developed into a narrative report, which is used by clients to understand the general background of the subject, assess the subject’s legitimacy and reputation, and inform strategic decision-making.This is a full-time,opportunity. Exiger's Researchers are creative and inquisitive. They seek to provide thorough and accurate information to the client in every report they complete. Researchers work both independently and collaboratively on research and reports for a variety of domestic and international clients.\n\nJob Location: Bucharest\n\nWhat You'll Do:\n\nCreate and determine contents of reports using a combination of web-based compliance tools, open source resources, client-provided information, and Exiger’s case management system.\nWrite clear, concise and thoroughly researched reports for clients using a variety of public records, databases, and other web-based sources and tools.\nUtilize judgement and best practices to complete research, writing and editing of cases of different products, scopes, jurisdictions and complexity.\nDetermine and escalate identified risk factors.\nSuccessfully manage case lifecycle, personal workload and pipeline.\nCommunicate effectively with others both verbally and in writing.\nCollaborate and work within a team to achieve desired outcomes.\nIdentification of pertinent information and development of useful insights into the subject.\nAssist with research, writing, and editing of large and complex cases\nUtilize best practices in research methodology to effectively complete reports for various different clients and of various different scopes.\n\n\nWhat You'll Need:\n\nStrong analytical and research skills. \nSolid communication (written and verbal) and organizational skills.\nAbility to deliver high quality work in a fast-paced, high-volume environment with strict deadlines.\nTeam player with high level of initiative and a proactive approach to work.\nAbility to work effectively in a team as well as independently; takes ownership of tasks and follow up to ensure that they are successfully brought to completion.\nAbility to utilize technology to solve problems.\nRigorous attention to detail.\nStrong logical deductive skills\n\n\nProfessional Experience Required\n\nProficient written and verbal English language skills.\nBachelor's Degree required;\n0-2 years of professional experience.\nKeen interest in the banking and financial services sector and regulations, current events and international affairs.\nStrong commitment to continuous improvement and learning, with an openness to receiving feedback and training.\nPrevious experience conducting due diligence, risk, or compliance research is a plus.\nFamiliarity with public-records research and an understanding of due diligence research methodology is a plus\n\n\nExiger is revolutionizing the way corporations, government agencies and banks manage risk and compliance with a combination of technology-enabled and SaaS solutions. In recognition of the growing volume and complexity of data and regulation, Exiger is committed to creating a more sustainable risk and compliance environment through its holistic and innovative approach to problem solving. Exiger's mission to make the world a safer place to do business drives its award-winning AI technology platform, DDIQ, built to anticipate the market's most pressing needs related to evolving ESG, cyber, financial crime, third-party and supply chain risk. Exiger has won 30+ AI, RegTech and Supply Chain partner awards.\n\nExiger’s core values are courage, excellence, expertise, innovation, integrity, teamwork and trust.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.\n\nExiger’s hybrid work policy is periodically reviewed and adjusted to align with evolving business needs."
  },
  {
    "Job ID": "4283291735",
    "Titlu Job": "Junior Automation Testing\nJunior Automation Testing with verification",
    "Companie": "Endava",
    "Locatie": "Iaşi, Iaşi, Romania · 1 day ago · 36 applicants\nPromoted by hirer · No response insights available yet",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4283291735/?eBP=CwEAAAGYso0L8GJoW-vET5jcxJxCenrZnqaLrreZgaBt5pKfQy4DMq5JObaY8D7HI1g8M0qIa29sW6jz-nGcw_r0aFj6IflVnwnXD-FcB6Fhe5JaARIZskWD2O4c87uuGM0f_i2LmOrhK1PvnOIeNVk-pDPx0WYvM6lJxAtPr0jVscinFp9p0yIUNqoML6FX5J740eKUp6AkwJYlTOll6786nkcfp7nmOui-XbQoB-ni2WIFLCMNhHexjG0hwNA9ciUfKlOSSKBZYIYhDev_4vJgQQPGqo7_OvUAZoO3RDBEdYSWy3Qd3dEXrO8H_j8B1kJ-L36v7l0o4lZ3ZHjtU5cODEEnbkPTj00OQUknLyS0drH-BR5ZpJZUVrwQlw2ZNZ3i7Am1FtQGN2T2K5xN3XWLHITwDw1emznehkXuNfFQhjkKNrsiMJaEbrOPt-yADqEIE50QrXcLB8V23xbtkpIsMzioWLThuNiGCMzBoQ&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=91OcHT385ojU2siDt9F2zw%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nCompany Description\n\nTechnology is our how. And people are our why. For over two decades, we have been harnessing technology to drive meaningful change.\n\nBy combining world-class engineering, industry expertise and a people-centric mindset, we consult and partner with leading brands from various industries to create dynamic platforms and intelligent digital experiences that drive innovation and transform businesses.\n\nFrom prototype to real-world impact - be part of a global shift by doing work that matters.\n\nJob Description\n\nQuality Assurance & Testing is one of Endava’s core disciplines. Our QA Automation teams design, develop, and maintain automated testing frameworks and scripts to ensure the highest quality of the software solutions we deliver. We work closely with development, business analysis, and project management teams, being problem-solvers with a strong client-oriented mindset.\n\nThis is a full-time, permanent hybrid role, requiring 2–3 days per week of work from our office in Iasi.\n\nAs a QA Automation Engineer at Endava, you will be responsible for:\n\n\nDeveloping and maintaining automated tests for web applications, APIs, and back-end components using at least one of the following technologies:\nJava, JavaScript, Python, or .NET.\nAnalysing requirements and defining both automated and manual test scenarios.\nParticipating in code reviews for test scripts.\nIntegrating automated tests into CI/CD pipelines and monitoring execution results.\nCollaborating closely with development teams to identify and resolve defects.\nParticipating in daily meetings and maintaining regular communication with the client via email, calls, and sync-ups.\n\nQualifications\n\nAt least 0.5 years of experience with at least one of the following is mandatory:\nJava (version 17+), Python (version 3+), JavaScript / TypeScript (version 2020+), .Net (version 4+)\nA good understanding of fundamental programming concepts as OOP principles within a micro-services landscape is a plus;\nA good understanding of Selenium / Playwright / Cypress with TestNg, NUnit, JUnit, Mocha, PyTest or equivalent is nice to have;\nExperience with cloud platforms (e.g. Azure, AWS) is desirable;\nKnowledge of Web protocols and technologies, RESTful Web services is essential;\nExperience with source code versioning systems (Perforce, Git, SVN) is a plus;\nA good understanding of either SQL & NoSQL databases is desirable;\nSolid understanding along with analytical and assertive approach of the complete product development cycle within an Agile/Scrum environment is essential;\nExperience with Kubernetes and Docker, Spring and Spring Boot is a plus;\nGood verbal and written English is mandatory.\n\nAdditional Information\n\nDiscover some of the global benefits that empower our people to become the best version of themselves:\n\n\nFinance:\nCompetitive salary package, share plan, company performance bonuses, value-based recognition awards, referral bonus; \nCareer Development:\nCareer coaching, global career opportunities, non-linear career paths, internal development programmes for management and technical leadership;\nLearning Opportunities:\nComplex projects, rotations, internal tech communities, training, certifications, coaching, online learning platforms subscriptions, pass-it-on sessions, workshops, conferences;\nWork-Life Balance:\nHybrid work and flexible working hours, employee assistance programme;\nHealth:\nGlobal internal wellbeing programme, access to wellbeing apps;\nCommunity:\nGlobal internal tech communities, hobby clubs and interest groups, inclusion and diversity programmes, events and celebrations.\n\nAt Endava, we’re committed to creating an open, inclusive, and respectful environment where everyone feels safe, valued, and empowered to be their best. We welcome applications from people of all backgrounds, experiences, and perspectives—because we know that inclusive teams help us deliver smarter, more innovative solutions for our customers. Hiring decisions are based on merit, skills, qualifications, and potential. If you need adjustments or support during the recruitment process, please let us know."
  },
  {
    "Job ID": "4179402151",
    "Titlu Job": "PwC Students Opportunity\nPwC Students Opportunity with verification",
    "Companie": "PwC Romania",
    "Locatie": "Bucharest, Bucharest, Romania · Reposted 1 week ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4179402151/?eBP=CwEAAAGYso0L8IGVJcekcmc_tvfMNMfaJ42MF8mKxn92FHHSFHS_Lha54tTrQsCP0-t-lRXbpZtzQmKWBnxP2s9tn4ZqQ4jhLnoHACTFnuCBn5__K52cfpO8GeCGu9mFn4yU5KS-Xr_Mgz4hfYV1RfWqSQwPoTot109i5xEcs0HhfoR8F1DCW_cKgaPUSDgYNLoz6WXPXAFxQp4Yf_gpYkdzJ_46rI9_nvyvK_nxw2Qt0xQiKIsnEj_WZP70m7EFRqvWxNVoVMvmdAMMeJQAzDGTuTuxzx131lJfA8cB1l9QYEVBSWKLxh1GsrtG2GdGgUrahMIYfNlIuSfOI7UdnFYJz8W-sGTtgw2SEnqc64EJKg3Nj8vvmIKDdk0h86djpWnuA_2iPkSbr4IZ1l3wxiMIp5TF8Sfm_-18FOZzA4xcXgpN4mNUKeVd_2eiYl7jIwpRQMVN6VRg0Bmkp0f5bV9C5bGR4a1O3bNo2tUrAxzo75yoiOz6MsEwz8KVH7XyC9-zCC4CqQK3&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=4GyAdSdTtZkQXST6yldUhQ%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nPwC is one of the leading professional services firms in the world, offering industry-focused: Tax, Assurance (Audit) and Advisory (Business Consulting) services for the largest public and multinational companies.\n\nSay 'yes' when a new opportunity arises! Come join our creative team of professionals, where you can expect to be involved in a variety of interesting, challenging and diverse activities.\n\nOur Trainee Programme kicks off 27th March 2025 and it's your chance to dive into real world challenges.\n\nWhat we need from you:\n\nTo be a 2nd year bachelor's degree student at ASE\nBe curious and try new things. \nLearn about how PwC works as a business and adds value to clients. \nThink broadly and ask questions about data, facts and other information."
  },
  {
    "Job ID": "4280307644",
    "Titlu Job": "Working Student - Digitalization and AI/ML\nWorking Student - Digitalization and AI/ML with verification",
    "Companie": "Siemens Energy",
    "Locatie": "Bucharest, Bucharest, Romania · 1 week ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4280307644/?eBP=CwEAAAGYso0L8DkHQfDpQSGG-5_eSCMv8jqmifmKJEynjHT8QKruD0oeqvuhDp19cTFYGejGzTp6XV04DSnPniu6OcTKNt9bJmEEvGr19Ng6_pfQFOqEIOxRTZirxSG-I523hDgv984RWJLFYuKVY01tx89Tec9v7qoQ4A25RqUePwVfCOUR9dxj3vp-AA1tPhGjoMqcL4x356X_P_We4lOO7Rrd56pGKztKuD0O0nsW8YyIAK_u0ffkWyrj7MtqnK6-PKg3o4tH1biM1EWv9sqWg2Cr9yHJsFw8XfT9AwKdmqAAbU9mDZ2iCJyAfpvVSX9mrqdxVkJ287nRCUjI8AWUfRWYDBolqWen1qqIlRFFSUwiLv3ylo54rHQ9m9aGkK-DPvCU_z1fiI9sz6lzMExo1TS0TehrtbVBvEM9rWkcJcRZE1qqtzAS0RBTKOHs51gMkRWbPUtj28rZClDBwLsU2hwHKMuKGLbc7X73OY7uLggh0hs1Dxrtn3gf-3O7rO9qC8yW6L1dg-I&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=q0kZistjURSF1c1v%2FkpM5g%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nA Snapshot of Your Day\n\nAre you a student passionate about technology and eager to explore the world of digitalization, Artificial Intelligence (AI), and Machine Learning (ML) in a business environment?\n\nJoin us as a Working Student and become an integral member of our digitalization team, working hands-on with innovative technologies and applying them to real-world business challenges. We are seeking a student currently pursuing a degree in Data Science, Statistics, Information Technology, Computer Science, Business Informatics, or a related field, who is enthusiastic about gaining practical experience on the finance side of the business.\n\nThis is a fantastic opportunity to learn, grow, and make an impact in a supportive and dynamic environment, helping us shape the future of finance through digital transformation. If you are a motivated student with a passion for data analytics, coding, AI/ML, and digitalization, we encourage you to apply and become part of our team!\n\nHow You’ll Make An Impact\n\nAssist cross-functional teams with digitalization and automation initiatives, including supporting monitoring and basic data analysis.\nLearn and support the use of digital tools from the Siemens Energy technology portfolio (such as BI tools, ETL tools, workflow automation platforms).\nSupport the creation and updating of interactive dashboards to visualize results and track project performance.\nGain exposure to SE Finance data models and related ETL processes through guided tasks and learning opportunities.\nPrepare and organize data for AI/ML projects.\nTest and document AI/ML models under supervision.\nMonitor and summarize AI/ML project results to provide input for team discussions.\nPrepare basic reports or summaries of findings for internal stakeholders.\nDocument project progress and lessons learned.\nSupport the team by documenting workflows, steps, and processes, ensuring records are clear and up to date.\nAssist in creating internal guides, presentation materials, or summaries from workshops and knowledge-sharing sessions.\nHelp coordinate with internal teams by gathering feedback and sharing updates, under the guidance of the project team.\n\n\nWhat You Bring\n\nCurrently enrolled in a master’s program in Data Science, Computer Science, Information Technology, Business Informatics or a related field.\nPrevious experience in internships or part-time roles related to data science, data analysis information technology, or automation is a plus.\nExperience working on academic or personal projects involving AI/ML, automation, or data related fields is a plus.\nParticipation in tech communities, hackathons, or relevant student organizations.\nBasic knowledge of programming languages such as Python, R, or similar.\nFamiliarity with automation, data analysis and business intelligence tools (e.g., Alteryx, Power BI, UiPath, etc.) and willingness to learn new tools.\nUnderstanding of ETL processes and data modeling concepts is a plus\nExposure to machine learning concepts, algorithms, and frameworks is desirable\nProficiency in MS365 Office Suite and Apps (Excel, Word, PowerPoint, Teams, SharePoint.).\nStructured and detail-oriented approach to documentation and process management\nDetail-oriented with a focus on accuracy and quality\nStrong analytical mindset with the ability to interpret data and generate actionable insights\nQuick learner, able to adapt to new tools, technologies, and processes efficiently\nGood communication skills in English\nProactive, self-motivated, and eager to contribute to team success\nCuriosity and passion for digitalization, automation, and AI/ML topics\nEagerness to learn and adapt in a dynamic work environment\nAvailability to work from our Bucharest office 3 days per week, with 2 days remote\n\n\nAbout The Team\n\nThe Project Entity team is responsible for world class execution and the successful delivery of complex projects across all Business Areas within Siemens Energy. We create and make use of synergies and high qualified competences across all Business Areas to deliver projects as One Siemens Energy.\n\nWith a strong focus on digitalization and productivity we deliver projects on time and in budget while driving project excellence standards, best practices and lessons learned across the organization.\n\nWho is Siemens Energy?\n\nAt Siemens Energy, we are more than just an energy technology company. With ~100,000 dedicated employees in more than 90 countries, we develop the energy systems of the future, ensuring that the growing energy demand of the global community is met reliably and sustainably. The technologies created in our research departments and factories drive the energy transition and provide the base for one sixth of the world's electricity generation.\n\nOur global team is committed to making sustainable, reliable, and affordable energy a reality by pushing the boundaries of what is possible. We uphold a 150-year legacy of innovation that encourages our search for people who will support our focus on decarbonization, new technologies, and energy transformation.\n\nFind out how you can make a difference at Siemens Energy: https://www.siemens-energy.com/employeevideo\n\nOur Office\n\nSiemens Energy's location in One Cotroceni Park is more than just an office space - it's a hub for a vibrant and thriving community. Nestled in the heart of Bucharest, this urban development is the perfect place to work, surrounded by green spaces, shopping destinations, and everything the city center has to offer. And with the Academia Militara subway station just a 3-minute walk away, getting around the city has never been easier.\n\nOur Commitment to Diversity\n\nLucky for us, we are not all the same. Through diversity we generate power. We run on inclusion and our combined creative energy is fueled by over 130 nationalities. Siemens Energy celebrates character – no matter what ethnic background, gender, age, religion, identity, or disability. We energize society, all of society, and we do not discriminate based on our differences.\n\nRewards/Benefits\n\nYour lunch with SE meal tickets.\nKeep your brain fit with our trainings.\nSpecial for books lovers – Bookstore.\nStay safe and healthy with our medical subscription.\nThink about your future too with Privat Pension Pilon III.\nTake care of yourself with our Wellbeing Initiatives.\n\n\nJobs & Careers: https://jobs.siemens-energy.com/jobs"
  },
  {
    "Job ID": "4248889445",
    "Titlu Job": "Academy for DevOps – Paid internship, starting 01 October 2025!\nAcademy for DevOps – Paid internship, starting 01 October 2025!",
    "Companie": "EDEKA IT ROMANIA",
    "Locatie": "Cluj-Napoca, Cluj, Romania · Reposted 3 weeks ago · Over 100 applicants\nPromoted by hirer · Actively reviewing applicants",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4248889445/?eBP=CwEAAAGYso0L8KQSIG-1eOBDCzr9MvpbZG4UdXD25fryTBXiLqUVux-vkuNiPasJxHEVExplZygem4ur4Kds0LzmyAonA6ruV7j7R-VT8mjOY4Ntwb_99t1gKGkJ4p5HH12dYgu2I2qx3OyO0nwosAJbdQtwmuKlSrQrEwO_vpGH5xQW3C7wD4s4Q3LaCqBR4v8HwsopyX7JW12whzrrHdbd1tE_XrS7n7ec0TCGYUxyIRE2MYDjmiYTB_UTt1Uw1D5u_8dxPjjwaPBqx4YgwTHLn88Ihd01faf65q53wRcQddeebSfXV96DevJzAmLOah3KvVBsP6V9I6nag0UIB12mUoKIlZDMcTAqUNzctr5PUxJjuP9A1up6fqT0aq_qdxoaOhh1eVYxqzwq80g31GqXx1J852_VLZyIwTEhOarduIAWG7akoA8kBINZBPVr8JBII5JFbqOGQN8_yjf-6AjQ3utWiwgoIxIeoYcNP7e49xQWVCdYnYQj6KYwaGc_T6zDNBUkVUl1&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=8pk4zAM1yxDFHyYO5nuAKA%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\n🚀Academy for DevOps – Paid internship, starting 01 October 2025!🚀\n\nAre you passionate about technology and eager to switch or advance your career in DevOps?\nWe’re launching a specialized DevOps Academy at EDEKA IT in Cluj, designed to equip you with the skills needed to kickstart your career in this dynamic field!\n\nWho are we looking for?\n\n🚀 Graduates or master students with a technical profile or technical affinities\n🚀 Candidates with some experience (programming, networking, sysadmin) interested in a professional switch\n🚀 Good command of German (minimum B2 level, ideally C1 with Sprachdiplom)\n\nDetails:\n\nStart date: 01 October\nDuration: 6 months\nSchedule: 8-hour daily sessions\nLocation: Cluj-Napoca only, fully onsite\n\nWhat will you learn?\n\n✅ Master DevOps principles, CI/CD pipelines, Infrastructure as Code (IaC), automation, monitoring, and cloud-native development using Azure.\n✅ Gain hands-on experience with Azure services, Terraform, Kubernetes (AKS), Docker, GitHub Actions, Ansible, and monitoring tools like Datadog and Azure Monitor.\n✅ Complete a capstone project implementing a full DevOps pipeline.\n✅ Develop strong Azure Cloud knowledge.\n\nThe academy will be led by passionate and experienced colleagues who are dedicated to supporting your learning journey every step of the way.\n\nAt the end of the academy, there will be an exam to evaluate your progress and help guide your next steps in your DevOps journey @EDEKA IT Romania as a full time DevOps Engineer.\n\nIf you’re ready to jump into the world of DevOps and transform your career, apply now!"
  },
  {
    "Job ID": "4245104258",
    "Titlu Job": "R&D Backend Developer\nR&D Backend Developer with verification",
    "Companie": "OpenText",
    "Locatie": "Cluj-Napoca, Cluj, Romania · Reposted 1 day ago · 93 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4245104258/?eBP=CwEAAAGYso0L8FS-poj0lFoDOlG0_vFeEkIiqfwmNXCrsnnOmx_y7gQh8-e_ra-vlcHk1OusJKh2-6wzN4TqZ0Jy9S0mNLyoNQbGO4eNNAXkXkn5dsc0WxCt-JTl31F6kRDzhlgIetBT_kK7X7Tf7-rACaTmtBMhpArEI7zJmHrCuWf6GdYECNAeW3zzw4ehA1P6QBfulXt0b7s4Cp4ZkLPM-dPK-hHZpaQ5NAytYGnLSZe0p354r23Ioc2zGCdX70DDjh1xjugm70UPi5kV1clBBwAn6FiU0Cku8mIYiv0XCsS3H3VO4w4xVFrikkUUd7jfMSf2iAaWIsoDppwGB_IWMXM0pHdiryGuR2uGvQxG_l63Cby48h4Mx2jvdQiiBfvI8_PaXS_FgWsxnAf-mjd9lHYFBqRQC5TPlplSu8k-cvdL4DwQx-aecbaOSmaSl1CUgp9BrSst6ZUny7htJRI4kdosr8MMqzZTuLdtzyxoGLJiBZfpBtHDdieIw938KlAcVa_ZDzUUYc4&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=QqeJ58%2FhGojbgdiTQyOKjQ%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nOPENTEXT \n\nOpenText is a global leader in information management, where innovation, creativity, and collaboration are the key components of our corporate culture. As a member of our team, you will have the opportunity to partner with the most highly regarded companies in the world, tackle complex issues, and contribute to projects that shape the future of digital transformation.\n\nYour impact\n\nAs a Backend Developer in the Performance Engineering for Developers team at OpenText, you’ll help shape the tools that power some of the world’s most robust load and performance testing solutions. Your code will directly support developers in building faster, more resilient applications by delivering tools that test system performance under real-world web protocol scenarios. From crafting clean code to solving customer challenges, your contributions will help teams deliver at scale — faster and with confidence.\n\nWhat The Role Offers\n\nA chance to work on cutting-edge performance testing technology used by engineers globally\nHands-on development with modern backend stacks like Go and Node.js\nDirect involvement in the full product lifecycle, from design to delivery\nA smart, collaborative team that values clean code, learning, and continuous improvement\nA great place to start and grow your career — even with 0–2 years of experience\n\nRequired Qualifications\n\nWhat you need to succeed\n\nBSc in Computer Science or a related field\n0–2 years of backend development experience, preferably with Go and Node.js\nStrong passion for code quality, clean architecture, and reliable delivery\nA team-first mindset with strong communication and collaboration skills\n\nPreferred Qualifications\n\nExperience with C/C++, Python, or multi-threaded systems\nUnderstanding of web transport protocols: HTTP, HTTP/2, HTTPS, WebSocket\nInterest in performance engineering, testing tools, and system optimization\n\nOne last thing\n\nWhether you're just starting your development career or looking to grow your backend expertise, this is your opportunity to be part of a forward-thinking team working on real-world problems. If you're excited to build tools that help developers succeed — and want to learn from experienced engineers in a supportive, agile environment — we'd love to hear from you.\n\nOpenText's efforts to build an inclusive work environment go beyond simply complying with applicable laws. Our Employment Equity and Diversity Policy provides direction on maintaining a working environment that is inclusive of everyone, regardless of culture, national origin, race, color, gender, gender identification, sexual orientation, family status, age, veteran status, disability, religion, or other basis protected by applicable laws.\n\nIf you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please contact us at hr@opentext.com. Our proactive approach fosters collaboration, innovation, and personal growth, enriching OpenText's vibrant workplace."
  },
  {
    "Job ID": "4248697770",
    "Titlu Job": "Software Qi Standards Engineer\nSoftware Qi Standards Engineer",
    "Companie": "microTECH Global LTD",
    "Locatie": "Romania · Reposted 1 day ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "Tip": "",
    "Link Job": "https://www.linkedin.com/jobs/view/4248697770/?eBP=CwEAAAGYso0L8PS6uanPlzmClTBspMR8TtRLZxBpc4jG9LRSih1kCW7o7knIdwkwfMbxgQojEoSTTKC3au-q_bdgjIzYs1dXVWHSUSkxOcrb-MBiIAHLyY5SivMazfMGOZxds_9KV0Z21gv060BiyjjTVEG_q2hUnHayfXOZ95i45zeSqgAZqcTVrv_QnZT36CRpcPFBcM8umuEidWuVtH4pQHgNPKo7IdRgjdDOKIVp78Us8oKgCCd-1EZRoIHveQ6WQwluWVlCKNlgltS7DEHFbOyJNOuvqBA6QptbzwtyqthLmn2j0Fo0mXAaGq8BC1buUa_tWj6_xII2JOViyyFRjdel4YvFRYhgJpRJ_nH9VJwYgYu412az1dU76rRypNbPzpN23c4vJhkM747guIK-0jeSrwgLYejUycnuhDgpybOnDgChtqQwQFoqRhLcCpiOzitT_qrw5WCth4PEbexTlBD4oGzFEIdvFYdyYQLfTHjXfmVOB6G9ihl2CHKAlZH4CDBdOocb&refId=QBzw6ZmIP03BAgFBhdOj4w%3D%3D&trackingId=TA5UEKng5GTsxINUX07GMg%3D%3D&trk=flagship3_search_srp_jobs",
    "Data postare": "",
    "Observatii": "Viewed; Easy Apply; Promoted",
    "Descriere Job": "About the job\nJob Description\n\nJob Title: Software Qi Standards Engineer\n\nLocation: Remote\n\nEmployment Type: 6 month contract\n\nAbout The Role\n\nWe are seeking a Software Qi Standards Engineer to develop, test, and ensure compliance with the Qi wireless charging standard. In this role, you will work with cross-functional teams to integrate Qi-compliant solutions into software and embedded systems, ensuring performance, efficiency, and adherence to the latest Wireless Power Consortium (WPC) standards.\n\nKey Responsibilities\n\n Develop and optimize Qi-compliant software for wireless charging systems.\n Ensure software meets WPC Qi standards, including interoperability, power transfer efficiency, and safety regulations.\n Collaborate with hardware and firmware teams to integrate Qi charging protocols into embedded systems.\n Conduct testing, debugging, and validation of wireless power transmission software.\n Stay up to date with Qi standard updates and implement necessary software modifications.\n Perform compliance testing and certification support for Qi-enabled devices.\n Develop and maintain software documentation, including API references and test reports.\n Work with external certification bodies and the Wireless Power Consortium (WPC) to ensure full compliance with Qi specifications.\n\nKey Requirements\n\n Bachelor’s or Master’s degree in Software Engineering, Electrical Engineering, Computer Science, or a related field.\n Experience in wireless power transfer technologies and Qi standard compliance.\n Strong proficiency in C, C++, Python, or Embedded C for firmware and software development.\n Knowledge of power management, embedded systems, and microcontrollers.\n Experience with wireless communication protocols (e.g., NFC, Bluetooth, or RF communication).\n Familiarity with WPC Qi standard specifications, including power profiles, FOD (Foreign Object Detection), and communication protocols.\n Experience with compliance testing and debugging tools (e.g., oscilloscopes, power analyzers, protocol analyzers).\n Strong analytical and problem-solving skills.\n\nPreferred Qualifications\n\n Hands-on experience with Qi-enabled devices and charging solutions.\n Familiarity with wireless charging standards beyond Qi, such as PMA or AirFuel.\n Experience working with wireless power test labs for certification.\n Understanding of EMI/EMC compliance requirements.\n Certifications in embedded software development or power electronics.\n\nWhat We Offer\n\n Competitive salary and benefits package.\n Opportunity to work on cutting-edge wireless charging technologies.\n Career growth and professional development in the wireless power industry.\n A collaborative and innovative workplace culture.\n\nIf you’re passionate about wireless charging, software development, and industry standards, we’d love to hear from you! Apply now or reach out for more details."
  }
]